[Killed] LogicalOperator
src/core/api/allocate.ts:87:23
       greaterThanFn(amount, zero)
     );
 
-    const condition = hasRatios && hasOnlyPositiveRatios && hasOneNonZeroRatio;
+    const condition = hasRatios && hasOnlyPositiveRatios || hasOneNonZeroRatio;
     assert(condition, INVALID_RATIOS_MESSAGE);
 
killedBy: allocate number decimal currencies throws when using only zero ratios
statusReason: snapshot function didn't throw
