[Killed] BlockStatement
src/core/api/add.ts:13:68
   addend: Dinero<TAmount, NoInfer<TCurrency>>,
 ];
 
-function unsafeAdd<TAmount>(calculator: DineroCalculator<TAmount>) {
-  return function add<TCurrency extends string>(
-    ...[augend, addend]: AddParams<TAmount, TCurrency>
-  ) {
-    const { amount: augendAmount, currency, scale } = augend.toJSON();
-    const { amount: addendAmount } = addend.toJSON();
-
-    const amount = calculator.add(augendAmount, addendAmount);
-
-    return augend.create({
-      amount,
-      currency,
-      scale,
-    });
-  };
-}
+function unsafeAdd<TAmount>(calculator: DineroCalculator<TAmount>) {}
 
 export function safeAdd<TAmount>(calculator: DineroCalculator<TAmount>) {
killedBy: add number decimal currencies adds up positive Dinero objects
statusReason: addFn is not a function

[Killed] BlockStatement
src/core/api/add.ts:16:5
 function unsafeAdd<TAmount>(calculator: DineroCalculator<TAmount>) {
   return function add<TCurrency extends string>(
     ...[augend, addend]: AddParams<TAmount, TCurrency>
-  ) {
-    const { amount: augendAmount, currency, scale } = augend.toJSON();
-    const { amount: addendAmount } = addend.toJSON();
-
-    const amount = calculator.add(augendAmount, addendAmount);
-
-    return augend.create({
-      amount,
-      currency,
-      scale,
-    });
-  };
+  ) {};
 }
 
killedBy: add number decimal currencies adds up positive Dinero objects
statusReason: Cannot read properties of undefined (reading 'toJSON')

[Killed] ObjectLiteral
src/core/api/add.ts:22:26
 
     const amount = calculator.add(augendAmount, addendAmount);
 
-    return augend.create({
-      amount,
-      currency,
-      scale,
-    });
+    return augend.create({});
   };
 }
killedBy: add number decimal currencies adds up positive Dinero objects
statusReason: Cannot read properties of undefined (reading 'code')

[Killed] BlockStatement
src/core/api/add.ts:30:73
   };
 }
 
-export function safeAdd<TAmount>(calculator: DineroCalculator<TAmount>) {
-  const normalizeFn = normalizeScale(calculator);
-  const addFn = unsafeAdd(calculator);
-
-  return function add<TCurrency extends string>(
-    ...[augend, addend]: AddParams<TAmount, TCurrency>
-  ) {
-    const condition = haveSameCurrency([augend, addend]);
-    assert(condition, UNEQUAL_CURRENCIES_MESSAGE);
-
-    const [newAugend, newAddend] = normalizeFn([augend, addend]);
-
-    return addFn(newAugend, newAddend);
-  };
-}
+export function safeAdd<TAmount>(calculator: DineroCalculator<TAmount>) {}
 
killedBy: add number decimal currencies adds up positive Dinero objects
statusReason: addFn is not a function

[Killed] BlockStatement
src/core/api/add.ts:36:5
 
   return function add<TCurrency extends string>(
     ...[augend, addend]: AddParams<TAmount, TCurrency>
-  ) {
-    const condition = haveSameCurrency([augend, addend]);
-    assert(condition, UNEQUAL_CURRENCIES_MESSAGE);
-
-    const [newAugend, newAddend] = normalizeFn([augend, addend]);
-
-    return addFn(newAugend, newAddend);
-  };
+  ) {};
 }
 
killedBy: add number decimal currencies adds up positive Dinero objects
statusReason: Cannot read properties of undefined (reading 'toJSON')

[Killed] CallExpression
src/core/api/add.ts:38:5
     ...[augend, addend]: AddParams<TAmount, TCurrency>
   ) {
     const condition = haveSameCurrency([augend, addend]);
-    assert(condition, UNEQUAL_CURRENCIES_MESSAGE);
+    ;
 
     const [newAugend, newAddend] = normalizeFn([augend, addend]);
killedBy: add number decimal currencies throws when using different currencies
statusReason: snapshot function didn't throw
