[Killed] BlockStatement
src/core/api/allocate.ts:23:73
   ratios: ReadonlyArray<DineroScaledAmount<TAmount>>,
 ];
 
-function unsafeAllocate<TAmount>(calculator: DineroCalculator<TAmount>) {
-  return function allocate<TCurrency extends string>(
-    ...[dineroObject, ratios]: UnsafeAllocateParams<TAmount, TCurrency>
-  ) {
-    const { amount, currency, scale } = dineroObject.toJSON();
-    const distributeFn = distribute(calculator);
-    const shares = distributeFn(
-      amount,
-      ratios.map((ratio) => ratio.amount)
-    );
-
-    return shares.map((share) => {
-      return dineroObject.create({
-        amount: share,
-        currency,
-        scale,
-      });
-    });
-  };
-}
+function unsafeAllocate<TAmount>(calculator: DineroCalculator<TAmount>) {}
 
 export type AllocateParams<
killedBy: allocate number decimal currencies allocates to percentages
statusReason: allocateFn is not a function

[Killed] BlockStatement
src/core/api/allocate.ts:26:5
 function unsafeAllocate<TAmount>(calculator: DineroCalculator<TAmount>) {
   return function allocate<TCurrency extends string>(
     ...[dineroObject, ratios]: UnsafeAllocateParams<TAmount, TCurrency>
-  ) {
-    const { amount, currency, scale } = dineroObject.toJSON();
-    const distributeFn = distribute(calculator);
-    const shares = distributeFn(
-      amount,
-      ratios.map((ratio) => ratio.amount)
-    );
-
-    return shares.map((share) => {
-      return dineroObject.create({
-        amount: share,
-        currency,
-        scale,
-      });
-    });
-  };
+  ) {};
 }
 
killedBy: allocate number decimal currencies allocates to percentages
statusReason: shares is not iterable

[Killed] ArrowFunction
src/core/api/allocate.ts:31:18
     const distributeFn = distribute(calculator);
     const shares = distributeFn(
       amount,
-      ratios.map((ratio) => ratio.amount)
+      ratios.map(() => undefined)
     );
 
killedBy: allocate number decimal currencies allocates to percentages
statusReason: [Dinero.js] Amount is invalid.

[Killed] BlockStatement
src/core/api/allocate.ts:34:34
       ratios.map((ratio) => ratio.amount)
     );
 
-    return shares.map((share) => {
-      return dineroObject.create({
-        amount: share,
-        currency,
-        scale,
-      });
-    });
+    return shares.map((share) => {});
   };
 }
killedBy: allocate number decimal currencies allocates to percentages
statusReason: Cannot read properties of undefined (reading 'toJSON')

[Killed] EqualityOperator
src/core/api/allocate.ts:65:23
   return function allocate<TCurrency extends string>(
     ...[dineroObject, ratios]: AllocateParams<TAmount, TCurrency>
   ) {
-    const hasRatios = ratios.length > 0;
+    const hasRatios = ratios.length <= 0;
     const scaledRatios = ratios.map((ratio) => getAmountAndScale(ratio, zero));
     const highestRatioScale = hasRatios
killedBy: allocate number decimal currencies allocates to percentages
statusReason: [Dinero.js] Ratios are invalid.

[Killed] ConditionalExpression
src/core/api/allocate.ts:65:23
   return function allocate<TCurrency extends string>(
     ...[dineroObject, ratios]: AllocateParams<TAmount, TCurrency>
   ) {
-    const hasRatios = ratios.length > 0;
+    const hasRatios = false;
     const scaledRatios = ratios.map((ratio) => getAmountAndScale(ratio, zero));
     const highestRatioScale = hasRatios
killedBy: allocate number decimal currencies allocates to percentages
statusReason: [Dinero.js] Ratios are invalid.

[Killed] ArrowFunction
src/core/api/allocate.ts:66:37
     ...[dineroObject, ratios]: AllocateParams<TAmount, TCurrency>
   ) {
     const hasRatios = ratios.length > 0;
-    const scaledRatios = ratios.map((ratio) => getAmountAndScale(ratio, zero));
+    const scaledRatios = ratios.map(() => undefined);
     const highestRatioScale = hasRatios
       ? maximumFn(scaledRatios.map(({ scale }) => scale))
killedBy: allocate number decimal currencies allocates to percentages
statusReason: Cannot destructure property 'scale' of 'undefined' as it is undefined.

[Killed] ArrowFunction
src/core/api/allocate.ts:68:36
     const hasRatios = ratios.length > 0;
     const scaledRatios = ratios.map((ratio) => getAmountAndScale(ratio, zero));
     const highestRatioScale = hasRatios
-      ? maximumFn(scaledRatios.map(({ scale }) => scale))
+      ? maximumFn(scaledRatios.map(() => undefined))
       : zero;
     const normalizedRatios = scaledRatios.map(({ amount, scale }) => {
killedBy: allocate number decimal currencies allocates to percentages
statusReason: [Dinero.js] Amount is invalid.

[Killed] BlockStatement
src/core/api/allocate.ts:70:70
     const highestRatioScale = hasRatios
       ? maximumFn(scaledRatios.map(({ scale }) => scale))
       : zero;
-    const normalizedRatios = scaledRatios.map(({ amount, scale }) => {
-      const factor = equalFn(scale, highestRatioScale)
-        ? zero
-        : calculator.subtract(highestRatioScale, scale);
-
-      return {
-        amount: calculator.multiply(amount, calculator.power(ten, factor)),
-        scale,
-      };
-    });
+    const normalizedRatios = scaledRatios.map(({ amount, scale }) => {});
     const hasOnlyPositiveRatios = normalizedRatios.every(({ amount }) =>
       greaterThanOrEqualFn(amount, zero)
killedBy: allocate number decimal currencies allocates to percentages
statusReason: Cannot destructure property 'amount' of 'undefined' as it is undefined.

[Killed] MethodExpression
src/core/api/allocate.ts:80:35
         scale,
       };
     });
-    const hasOnlyPositiveRatios = normalizedRatios.every(({ amount }) =>
-      greaterThanOrEqualFn(amount, zero)
-    );
+    const hasOnlyPositiveRatios = normalizedRatios.some(({
+  amount
+}) => greaterThanOrEqualFn(amount, zero));
     const hasOneNonZeroRatio = normalizedRatios.some(({ amount }) =>
       greaterThanFn(amount, zero)
killedBy: allocate with mixed negative and positive ratios throws for number amounts
statusReason: expected [Function] to throw an error

[Killed] ArrowFunction
src/core/api/allocate.ts:80:58
         scale,
       };
     });
-    const hasOnlyPositiveRatios = normalizedRatios.every(({ amount }) =>
-      greaterThanOrEqualFn(amount, zero)
+    const hasOnlyPositiveRatios = normalizedRatios.every(() => undefined
     );
     const hasOneNonZeroRatio = normalizedRatios.some(({ amount }) =>
killedBy: allocate number decimal currencies allocates to percentages
statusReason: [Dinero.js] Ratios are invalid.

[Killed] ArrowFunction
src/core/api/allocate.ts:83:54
     const hasOnlyPositiveRatios = normalizedRatios.every(({ amount }) =>
       greaterThanOrEqualFn(amount, zero)
     );
-    const hasOneNonZeroRatio = normalizedRatios.some(({ amount }) =>
-      greaterThanFn(amount, zero)
+    const hasOneNonZeroRatio = normalizedRatios.some(() => undefined
     );
 
killedBy: allocate number decimal currencies allocates to percentages
statusReason: [Dinero.js] Ratios are invalid.

[Killed] MethodExpression
src/core/api/allocate.ts:83:32
     const hasOnlyPositiveRatios = normalizedRatios.every(({ amount }) =>
       greaterThanOrEqualFn(amount, zero)
     );
-    const hasOneNonZeroRatio = normalizedRatios.some(({ amount }) =>
-      greaterThanFn(amount, zero)
-    );
+    const hasOneNonZeroRatio = normalizedRatios.every(({
+  amount
+}) => greaterThanFn(amount, zero));
 
     const condition = hasRatios && hasOnlyPositiveRatios && hasOneNonZeroRatio;
killedBy: allocate number decimal currencies ignores zero ratios
statusReason: [Dinero.js] Ratios are invalid.

[Killed] ConditionalExpression
src/core/api/allocate.ts:87:23
       greaterThanFn(amount, zero)
     );
 
-    const condition = hasRatios && hasOnlyPositiveRatios && hasOneNonZeroRatio;
+    const condition = false;
     assert(condition, INVALID_RATIOS_MESSAGE);
 
killedBy: allocate number decimal currencies allocates to percentages
statusReason: [Dinero.js] Ratios are invalid.

[Killed] LogicalOperator
src/core/api/allocate.ts:87:23
       greaterThanFn(amount, zero)
     );
 
-    const condition = hasRatios && hasOnlyPositiveRatios && hasOneNonZeroRatio;
+    const condition = hasRatios || hasOnlyPositiveRatios && hasOneNonZeroRatio;
     assert(condition, INVALID_RATIOS_MESSAGE);
 
killedBy: allocate with mixed negative and positive ratios throws for number amounts
statusReason: expected [Function] to throw an error

[Killed] CallExpression
src/core/api/allocate.ts:88:5
     );
 
     const condition = hasRatios && hasOnlyPositiveRatios && hasOneNonZeroRatio;
-    assert(condition, INVALID_RATIOS_MESSAGE);
+    ;
 
     const { scale } = dineroObject.toJSON();
killedBy: allocate number decimal currencies throws when using empty ratios
statusReason: snapshot function didn't throw
