[Killed] BlockStatement
src/core/api/compare.ts:17:72
   comparator: Dinero<TAmount, NoInfer<TCurrency>>,
 ];
 
-function unsafeCompare<TAmount>(calculator: DineroCalculator<TAmount>) {
-  const compareFn = cmp(calculator);
-
-  return function compare<TCurrency extends string>(
-    ...[dineroObject, comparator]: CompareParams<TAmount, TCurrency>
-  ) {
-    const dineroObjects = [dineroObject, comparator];
-
-    const [subjectAmount, comparatorAmount] = dineroObjects.map((d) => {
-      const { amount } = d.toJSON();
-
-      return amount;
-    });
-
-    return compareFn(subjectAmount, comparatorAmount);
-  };
-}
+function unsafeCompare<TAmount>(calculator: DineroCalculator<TAmount>) {}
 
 export function safeCompare<TAmount>(calculator: DineroCalculator<TAmount>) {
killedBy: compare number decimal currencies returns -1 when the first amount is less than the other
statusReason: compareFn is not a function

[Killed] BlockStatement
src/core/api/compare.ts:22:5
 
   return function compare<TCurrency extends string>(
     ...[dineroObject, comparator]: CompareParams<TAmount, TCurrency>
-  ) {
-    const dineroObjects = [dineroObject, comparator];
-
-    const [subjectAmount, comparatorAmount] = dineroObjects.map((d) => {
-      const { amount } = d.toJSON();
-
-      return amount;
-    });
-
-    return compareFn(subjectAmount, comparatorAmount);
-  };
+  ) {};
 }
 
killedBy: compare number decimal currencies returns -1 when the first amount is less than the other
statusReason: expected undefined to be -1 // Object.is equality

[Killed] BlockStatement
src/core/api/compare.ts:25:72
   ) {
     const dineroObjects = [dineroObject, comparator];
 
-    const [subjectAmount, comparatorAmount] = dineroObjects.map((d) => {
-      const { amount } = d.toJSON();
-
-      return amount;
-    });
+    const [subjectAmount, comparatorAmount] = dineroObjects.map((d) => {});
 
     return compareFn(subjectAmount, comparatorAmount);
killedBy: compare number decimal currencies returns -1 when the first amount is less than the other
statusReason: expected +0 to be -1 // Object.is equality

[Killed] BlockStatement
src/core/api/compare.ts:35:77
   };
 }
 
-export function safeCompare<TAmount>(calculator: DineroCalculator<TAmount>) {
-  const normalizeFn = normalizeScale(calculator);
-  const compareFn = unsafeCompare(calculator);
-
-  return function compare<TCurrency extends string>(
-    ...[dineroObject, comparator]: CompareParams<TAmount, TCurrency>
-  ) {
-    const condition = haveSameCurrency([dineroObject, comparator]);
-    assert(condition, UNEQUAL_CURRENCIES_MESSAGE);
-
-    const [subjectAmount, comparatorAmount] = normalizeFn([
-      dineroObject,
-      comparator,
-    ]);
-
-    return compareFn(subjectAmount, comparatorAmount);
-  };
-}
+export function safeCompare<TAmount>(calculator: DineroCalculator<TAmount>) {}
 
killedBy: compare number decimal currencies returns -1 when the first amount is less than the other
statusReason: compareFn is not a function

[Killed] BlockStatement
src/core/api/compare.ts:41:5
 
   return function compare<TCurrency extends string>(
     ...[dineroObject, comparator]: CompareParams<TAmount, TCurrency>
-  ) {
-    const condition = haveSameCurrency([dineroObject, comparator]);
-    assert(condition, UNEQUAL_CURRENCIES_MESSAGE);
-
-    const [subjectAmount, comparatorAmount] = normalizeFn([
-      dineroObject,
-      comparator,
-    ]);
-
-    return compareFn(subjectAmount, comparatorAmount);
-  };
+  ) {};
 }
 
killedBy: compare number decimal currencies returns -1 when the first amount is less than the other
statusReason: expected undefined to be -1 // Object.is equality

[Killed] CallExpression
src/core/api/compare.ts:43:5
     ...[dineroObject, comparator]: CompareParams<TAmount, TCurrency>
   ) {
     const condition = haveSameCurrency([dineroObject, comparator]);
-    assert(condition, UNEQUAL_CURRENCIES_MESSAGE);
+    ;
 
     const [subjectAmount, comparatorAmount] = normalizeFn([
killedBy: compare number decimal currencies throws when using different currencies
statusReason: snapshot function didn't throw
