[Killed] BlockStatement
src/core/api/convert.ts:36:5
       TCurrency,
       TNewCurrency
     >
-  ) {
-    const rate = rates[newCurrency.code];
-    const { amount, currency, scale } = dineroObject.toJSON();
-
-    const sourceBase = computeBaseFn(currency.base);
-    const targetBase = computeBaseFn(newCurrency.base);
-
-    assert(equalFn(sourceBase, targetBase), MISMATCHED_BASES_MESSAGE);
-
-    const { amount: rateAmount, scale: rateScale } = getAmountAndScale(
-      rate,
-      zero
-    );
-
-    const newScale = calculator.add(scale, rateScale);
-
-    return convertScaleFn(
-      dineroObject.create({
-        amount: calculator.multiply(amount, rateAmount),
-        currency: newCurrency,
-        scale: newScale,
-      }),
-      maximumFn([newScale, newCurrency.exponent])
-    );
-  };
+  ) {};
 }
 
killedBy: convert number decimal currencies converts a Dinero object to another currency
statusReason: Cannot read properties of undefined (reading 'toJSON')

[Killed] CallExpression
src/core/api/convert.ts:43:5
     const sourceBase = computeBaseFn(currency.base);
     const targetBase = computeBaseFn(newCurrency.base);
 
-    assert(equalFn(sourceBase, targetBase), MISMATCHED_BASES_MESSAGE);
+    ;
 
     const { amount: rateAmount, scale: rateScale } = getAmountAndScale(
killedBy: convert number non-decimal currencies throws when converting between different bases
statusReason: snapshot function didn't throw
