[Killed] BlockStatement
src/core/api/equal.ts:11:71
   comparator: Dinero<TAmount, NoInfer<TCurrency>>,
 ];
 
-export function equal<TAmount>(calculator: DineroCalculator<TAmount>) {
-  return function _equal<TCurrency extends string>(
-    ...[dineroObject, comparator]: EqualParams<TAmount, TCurrency>
-  ) {
-    return (
-      haveSameAmount(calculator)([dineroObject, comparator]) &&
-      haveSameCurrency([dineroObject, comparator])
-    );
-  };
-}
+export function equal<TAmount>(calculator: DineroCalculator<TAmount>) {}
 
killedBy: compare properties is consistent with equal: compare(a, b) === 0 iff equal(a, b)
statusReason: Property failed after 1 tests
{ seed: 1625609980, path: "0:0:0", endOnFailure: true }
Counterexample: [0,0]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/core/api/equal.ts:14:5
 export function equal<TAmount>(calculator: DineroCalculator<TAmount>) {
   return function _equal<TCurrency extends string>(
     ...[dineroObject, comparator]: EqualParams<TAmount, TCurrency>
-  ) {
-    return (
-      haveSameAmount(calculator)([dineroObject, comparator]) &&
-      haveSameCurrency([dineroObject, comparator])
-    );
-  };
+  ) {};
 }
 
killedBy: add properties is commutative: add(a, b) equals add(b, a)
statusReason: Property failed after 1 tests
{ seed: -158405893, path: "0:0:0", endOnFailure: true }
Counterexample: [0,0]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/core/api/equal.ts:16:7
     ...[dineroObject, comparator]: EqualParams<TAmount, TCurrency>
   ) {
     return (
-      haveSameAmount(calculator)([dineroObject, comparator]) &&
-      haveSameCurrency([dineroObject, comparator])
+      false
     );
   };
killedBy: add properties is commutative: add(a, b) equals add(b, a)
statusReason: Property failed after 1 tests
{ seed: 1156950507, path: "0:0:0", endOnFailure: true }
Counterexample: [0,0]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
src/core/api/equal.ts:16:7
     ...[dineroObject, comparator]: EqualParams<TAmount, TCurrency>
   ) {
     return (
-      haveSameAmount(calculator)([dineroObject, comparator]) &&
-      haveSameCurrency([dineroObject, comparator])
+      haveSameAmount(calculator)([dineroObject, comparator]) || haveSameCurrency([dineroObject, comparator])
     );
   };
killedBy: compare properties is consistent with equal: compare(a, b) === 0 iff equal(a, b)
statusReason: Property failed after 1 tests
{ seed: 1570001411, path: "0:0:1:0:0", endOnFailure: true }
Counterexample: [0,1]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrayDeclaration
src/core/api/equal.ts:17:24
   ) {
     return (
       haveSameAmount(calculator)([dineroObject, comparator]) &&
-      haveSameCurrency([dineroObject, comparator])
+      haveSameCurrency([])
     );
   };
killedBy: add properties is commutative: add(a, b) equals add(b, a)
statusReason: Property failed after 1 tests
{ seed: 588194861, path: "0:0:0", endOnFailure: true }
Counterexample: [0,0]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
