[Killed] BlockStatement
src/core/api/greaterThan.ts:17:76
   comparator: Dinero<TAmount, NoInfer<TCurrency>>,
 ];
 
-function unsafeGreaterThan<TAmount>(calculator: DineroCalculator<TAmount>) {
-  const greaterThanFn = gt(calculator);
-
-  return function greaterThan<TCurrency extends string>(
-    ...[dineroObject, comparator]: GreaterThanParams<TAmount, TCurrency>
-  ) {
-    const dineroObjects = [dineroObject, comparator];
-
-    const [subjectAmount, comparatorAmount] = dineroObjects.map((d) => {
-      const { amount } = d.toJSON();
-
-      return amount;
-    });
-
-    return greaterThanFn(subjectAmount, comparatorAmount);
-  };
-}
+function unsafeGreaterThan<TAmount>(calculator: DineroCalculator<TAmount>) {}
 
 export function safeGreaterThan<TAmount>(
killedBy: greaterThan number decimal currencies returns false when the first amount is less than the other
statusReason: greaterThanFn is not a function

[Killed] BlockStatement
src/core/api/greaterThan.ts:22:5
 
   return function greaterThan<TCurrency extends string>(
     ...[dineroObject, comparator]: GreaterThanParams<TAmount, TCurrency>
-  ) {
-    const dineroObjects = [dineroObject, comparator];
-
-    const [subjectAmount, comparatorAmount] = dineroObjects.map((d) => {
-      const { amount } = d.toJSON();
-
-      return amount;
-    });
-
-    return greaterThanFn(subjectAmount, comparatorAmount);
-  };
+  ) {};
 }
 
killedBy: greaterThan number decimal currencies returns false when the first amount is less than the other
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
src/core/api/greaterThan.ts:37:3
 
 export function safeGreaterThan<TAmount>(
   calculator: DineroCalculator<TAmount>
-) {
-  const normalizeFn = normalizeScale(calculator);
-  const greaterThanFn = unsafeGreaterThan(calculator);
-
-  return function greaterThan<TCurrency extends string>(
-    ...[dineroObject, comparator]: GreaterThanParams<TAmount, TCurrency>
-  ) {
-    const condition = haveSameCurrency([dineroObject, comparator]);
-    assert(condition, UNEQUAL_CURRENCIES_MESSAGE);
-
-    const [subjectAmount, comparatorAmount] = normalizeFn([
-      dineroObject,
-      comparator,
-    ]);
-
-    return greaterThanFn(subjectAmount, comparatorAmount);
-  };
-}
+) {}
 
killedBy: greaterThan number decimal currencies returns false when the first amount is less than the other
statusReason: greaterThanFn is not a function

[Killed] BlockStatement
src/core/api/greaterThan.ts:43:5
 
   return function greaterThan<TCurrency extends string>(
     ...[dineroObject, comparator]: GreaterThanParams<TAmount, TCurrency>
-  ) {
-    const condition = haveSameCurrency([dineroObject, comparator]);
-    assert(condition, UNEQUAL_CURRENCIES_MESSAGE);
-
-    const [subjectAmount, comparatorAmount] = normalizeFn([
-      dineroObject,
-      comparator,
-    ]);
-
-    return greaterThanFn(subjectAmount, comparatorAmount);
-  };
+  ) {};
 }
 
killedBy: greaterThan number decimal currencies returns false when the first amount is less than the other
statusReason: expected undefined to be false // Object.is equality

[Killed] ArrayDeclaration
src/core/api/greaterThan.ts:44:40
   return function greaterThan<TCurrency extends string>(
     ...[dineroObject, comparator]: GreaterThanParams<TAmount, TCurrency>
   ) {
-    const condition = haveSameCurrency([dineroObject, comparator]);
+    const condition = haveSameCurrency([]);
     assert(condition, UNEQUAL_CURRENCIES_MESSAGE);
 
killedBy: greaterThan number decimal currencies returns false when the first amount is less than the other
statusReason: Cannot read properties of undefined (reading 'calculator')
