[Killed] BlockStatement
src/core/api/greaterThanOrEqual.ts:19:3
 
 function unsafeGreaterThanOrEqual<TAmount>(
   calculator: DineroCalculator<TAmount>
-) {
-  const greaterThanOrEqualFn = gte(calculator);
-
-  return function greaterThanOrEqual<TCurrency extends string>(
-    ...[dineroObject, comparator]: GreaterThanOrEqualParams<TAmount, TCurrency>
-  ) {
-    const dineroObjects = [dineroObject, comparator];
-
-    const [subjectAmount, comparatorAmount] = dineroObjects.map((d) => {
-      const { amount } = d.toJSON();
-
-      return amount;
-    });
-
-    return greaterThanOrEqualFn(subjectAmount, comparatorAmount);
-  };
-}
+) {}
 
 export function safeGreaterThanOrEqual<TAmount>(
killedBy: compare properties is total: for any a, b either a <= b or b <= a
statusReason: Property failed after 1 tests
{ seed: -250859700, path: "0:1:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [1,0]
Shrunk 13 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/core/api/greaterThanOrEqual.ts:24:5
 
   return function greaterThanOrEqual<TCurrency extends string>(
     ...[dineroObject, comparator]: GreaterThanOrEqualParams<TAmount, TCurrency>
-  ) {
-    const dineroObjects = [dineroObject, comparator];
-
-    const [subjectAmount, comparatorAmount] = dineroObjects.map((d) => {
-      const { amount } = d.toJSON();
-
-      return amount;
-    });
-
-    return greaterThanOrEqualFn(subjectAmount, comparatorAmount);
-  };
+  ) {};
 }
 
killedBy: compare properties is total: for any a, b either a <= b or b <= a
statusReason: Property failed after 1 tests
{ seed: 1227419321, path: "0:3:0:0:6:1:2:0:0:0:0:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [1,0]
Shrunk 26 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrayDeclaration
src/core/api/greaterThanOrEqual.ts:25:27
   return function greaterThanOrEqual<TCurrency extends string>(
     ...[dineroObject, comparator]: GreaterThanOrEqualParams<TAmount, TCurrency>
   ) {
-    const dineroObjects = [dineroObject, comparator];
+    const dineroObjects = [];
 
     const [subjectAmount, comparatorAmount] = dineroObjects.map((d) => {
killedBy: greaterThanOrEqual number returns false when the first amount is less than the other
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/core/api/greaterThanOrEqual.ts:39:3
 
 export function safeGreaterThanOrEqual<TAmount>(
   calculator: DineroCalculator<TAmount>
-) {
-  const normalizeFn = normalizeScale(calculator);
-  const greaterThanOrEqualFn = unsafeGreaterThanOrEqual(calculator);
-
-  return function greaterThanOrEqual<TCurrency extends string>(
-    ...[dineroObject, comparator]: GreaterThanOrEqualParams<TAmount, TCurrency>
-  ) {
-    const condition = haveSameCurrency([dineroObject, comparator]);
-    assert(condition, UNEQUAL_CURRENCIES_MESSAGE);
-
-    const [subjectAmount, comparatorAmount] = normalizeFn([
-      dineroObject,
-      comparator,
-    ]);
-
-    return greaterThanOrEqualFn(subjectAmount, comparatorAmount);
-  };
-}
+) {}
 
killedBy: compare properties is total: for any a, b either a <= b or b <= a
statusReason: Property failed after 2 tests
{ seed: 1620370031, path: "1:1:0:0:0:0:0:0:0:0:0:0:0:0:3:0:0:0:0", endOnFailure: true }
Counterexample: [1,0]
Shrunk 18 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/core/api/greaterThanOrEqual.ts:45:5
 
   return function greaterThanOrEqual<TCurrency extends string>(
     ...[dineroObject, comparator]: GreaterThanOrEqualParams<TAmount, TCurrency>
-  ) {
-    const condition = haveSameCurrency([dineroObject, comparator]);
-    assert(condition, UNEQUAL_CURRENCIES_MESSAGE);
-
-    const [subjectAmount, comparatorAmount] = normalizeFn([
-      dineroObject,
-      comparator,
-    ]);
-
-    return greaterThanOrEqualFn(subjectAmount, comparatorAmount);
-  };
+  ) {};
 }
 
killedBy: compare properties is total: for any a, b either a <= b or b <= a
statusReason: Property failed after 5 tests
{ seed: 1442856419, path: "4:0:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [0,-1]
Shrunk 17 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrayDeclaration
src/core/api/greaterThanOrEqual.ts:49:59
     const condition = haveSameCurrency([dineroObject, comparator]);
     assert(condition, UNEQUAL_CURRENCIES_MESSAGE);
 
-    const [subjectAmount, comparatorAmount] = normalizeFn([
-      dineroObject,
-      comparator,
-    ]);
+    const [subjectAmount, comparatorAmount] = normalizeFn([]);
 
     return greaterThanOrEqualFn(subjectAmount, comparatorAmount);
killedBy: greaterThanOrEqual number returns false when the first amount is less than the other
statusReason: Cannot read properties of undefined (reading 'toJSON')
