[Killed] BlockStatement
src/core/api/hasSubUnits.ts:8:77
   dineroObject: Dinero<TAmount>,
 ];
 
-export function hasSubUnits<TAmount>(calculator: DineroCalculator<TAmount>) {
-  const equalFn = equal(calculator);
-  const computeBaseFn = computeBase(calculator);
-
-  return function _hasSubUnits(...[dineroObject]: HasSubUnitsParams<TAmount>) {
-    const { amount, currency, scale } = dineroObject.toJSON();
-    const base = computeBaseFn(currency.base);
-
-    return !equalFn(
-      calculator.modulo(amount, calculator.power(base, scale)),
-      calculator.zero()
-    );
-  };
-}
+export function hasSubUnits<TAmount>(calculator: DineroCalculator<TAmount>) {}
 
killedBy: hasSubUnits number decimal currencies returns false when there are no sub-units
statusReason: hasSubUnitsFn is not a function

[Killed] BlockStatement
src/core/api/hasSubUnits.ts:12:79
   const equalFn = equal(calculator);
   const computeBaseFn = computeBase(calculator);
 
-  return function _hasSubUnits(...[dineroObject]: HasSubUnitsParams<TAmount>) {
-    const { amount, currency, scale } = dineroObject.toJSON();
-    const base = computeBaseFn(currency.base);
-
-    return !equalFn(
-      calculator.modulo(amount, calculator.power(base, scale)),
-      calculator.zero()
-    );
-  };
+  return function _hasSubUnits(...[dineroObject]: HasSubUnitsParams<TAmount>) {};
 }
 
killedBy: hasSubUnits number decimal currencies returns false when there are no sub-units
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
src/core/api/hasSubUnits.ts:16:12
     const { amount, currency, scale } = dineroObject.toJSON();
     const base = computeBaseFn(currency.base);
 
-    return !equalFn(
-      calculator.modulo(amount, calculator.power(base, scale)),
-      calculator.zero()
-    );
+    return equalFn(calculator.modulo(amount, calculator.power(base, scale)), calculator.zero());
   };
 }
killedBy: hasSubUnits number decimal currencies returns false when there are no sub-units
statusReason: expected true to be false // Object.is equality
