[Killed] BlockStatement
src/core/api/haveSameAmount.ts:16:80
   ],
 ];
 
-export function haveSameAmount<TAmount>(calculator: DineroCalculator<TAmount>) {
-  const normalizeFn = normalizeScale(calculator);
-  const equalFn = equal(calculator);
-
-  return function _haveSameAmount<TCurrency extends string>(
-    ...[dineroObjects]: HaveSameAmountParams<TAmount, TCurrency>
-  ) {
-    const [firstDinero, ...otherDineros] = normalizeFn(dineroObjects);
-    const { amount: comparatorAmount } = firstDinero.toJSON();
-
-    return otherDineros.every((d) => {
-      const { amount: subjectAmount } = d.toJSON();
-
-      return equalFn(subjectAmount, comparatorAmount);
-    });
-  };
-}
+export function haveSameAmount<TAmount>(calculator: DineroCalculator<TAmount>) {}
 
killedBy: subtract properties is the inverse of add: add(subtract(a, b), b) equals a
statusReason: Property failed after 1 tests
{ seed: -2060961823, path: "0:0:0", endOnFailure: true }
Counterexample: [0,0]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/core/api/haveSameAmount.ts:22:5
 
   return function _haveSameAmount<TCurrency extends string>(
     ...[dineroObjects]: HaveSameAmountParams<TAmount, TCurrency>
-  ) {
-    const [firstDinero, ...otherDineros] = normalizeFn(dineroObjects);
-    const { amount: comparatorAmount } = firstDinero.toJSON();
-
-    return otherDineros.every((d) => {
-      const { amount: subjectAmount } = d.toJSON();
-
-      return equalFn(subjectAmount, comparatorAmount);
-    });
-  };
+  ) {};
 }
 
killedBy: compare properties is consistent with equal: compare(a, b) === 0 iff equal(a, b)
statusReason: Property failed after 1 tests
{ seed: 1526498901, path: "0:0:0", endOnFailure: true }
Counterexample: [0,0]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/core/api/haveSameAmount.ts:26:38
     const [firstDinero, ...otherDineros] = normalizeFn(dineroObjects);
     const { amount: comparatorAmount } = firstDinero.toJSON();
 
-    return otherDineros.every((d) => {
-      const { amount: subjectAmount } = d.toJSON();
-
-      return equalFn(subjectAmount, comparatorAmount);
-    });
+    return otherDineros.every((d) => {});
   };
 }
killedBy: add properties is commutative: add(a, b) equals add(b, a)
statusReason: Property failed after 1 tests
{ seed: 1411308397, path: "0:0:0", endOnFailure: true }
Counterexample: [0,0]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
src/core/api/haveSameAmount.ts:26:12
     const [firstDinero, ...otherDineros] = normalizeFn(dineroObjects);
     const { amount: comparatorAmount } = firstDinero.toJSON();
 
-    return otherDineros.every((d) => {
-      const { amount: subjectAmount } = d.toJSON();
-
-      return equalFn(subjectAmount, comparatorAmount);
-    });
+    return otherDineros.some(d => {
+  const {
+    amount: subjectAmount
+  } = d.toJSON();
+  return equalFn(subjectAmount, comparatorAmount);
+});
   };
 }
killedBy: haveSameAmount with more than two objects returns false when only the last amount differs
statusReason: expected true to be false // Object.is equality
