[Killed] BlockStatement
src/core/api/haveSameCurrency.ts:6:3
 
 export function haveSameCurrency<TAmount>(
   dineroObjects: ReadonlyArray<Dinero<TAmount>>
-) {
-  const [firstDinero, ...otherDineros] = dineroObjects;
-  const computeBaseFn = computeBase(firstDinero.calculator);
-
-  const { currency: comparator } = firstDinero.toJSON();
-  const equalFn = equal(firstDinero.calculator);
-  const comparatorBase = computeBaseFn(comparator.base);
-
-  return otherDineros.every((d) => {
-    const { currency: subject } = d.toJSON();
-    const subjectBase = computeBaseFn(subject.base);
-
-    return (
-      subject.code === comparator.code &&
-      equalFn(subjectBase, comparatorBase) &&
-      equalFn(subject.exponent, comparator.exponent)
-    );
-  });
-}
+) {}
 
killedBy: subtract number subtracts positive Dinero objects
statusReason: [Dinero.js] Objects must have the same currency.

[Killed] BlockStatement
src/core/api/haveSameCurrency.ts:14:36
   const equalFn = equal(firstDinero.calculator);
   const comparatorBase = computeBaseFn(comparator.base);
 
-  return otherDineros.every((d) => {
-    const { currency: subject } = d.toJSON();
-    const subjectBase = computeBaseFn(subject.base);
-
-    return (
-      subject.code === comparator.code &&
-      equalFn(subjectBase, comparatorBase) &&
-      equalFn(subject.exponent, comparator.exponent)
-    );
-  });
+  return otherDineros.every((d) => {});
 }
 
killedBy: add number decimal currencies adds up positive Dinero objects
statusReason: [Dinero.js] Objects must have the same currency.

[Killed] MethodExpression
src/core/api/haveSameCurrency.ts:14:10
   const equalFn = equal(firstDinero.calculator);
   const comparatorBase = computeBaseFn(comparator.base);
 
-  return otherDineros.every((d) => {
-    const { currency: subject } = d.toJSON();
-    const subjectBase = computeBaseFn(subject.base);
-
-    return (
-      subject.code === comparator.code &&
-      equalFn(subjectBase, comparatorBase) &&
-      equalFn(subject.exponent, comparator.exponent)
-    );
-  });
+  return otherDineros.some(d => {
+  const {
+    currency: subject
+  } = d.toJSON();
+  const subjectBase = computeBaseFn(subject.base);
+  return subject.code === comparator.code && equalFn(subjectBase, comparatorBase) && equalFn(subject.exponent, comparator.exponent);
+});
 }
 
killedBy: haveSameCurrency with more than two objects returns false when only the last currency differs
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/core/api/haveSameCurrency.ts:19:7
     const subjectBase = computeBaseFn(subject.base);
 
     return (
-      subject.code === comparator.code &&
-      equalFn(subjectBase, comparatorBase) &&
+      subject.code === comparator.code || equalFn(subjectBase, comparatorBase) &&
       equalFn(subject.exponent, comparator.exponent)
     );
killedBy: add number decimal currencies throws when using different currencies
statusReason: snapshot function didn't throw

[Killed] EqualityOperator
src/core/api/haveSameCurrency.ts:19:7
     const subjectBase = computeBaseFn(subject.base);
 
     return (
-      subject.code === comparator.code &&
+      subject.code !== comparator.code &&
       equalFn(subjectBase, comparatorBase) &&
       equalFn(subject.exponent, comparator.exponent)
killedBy: add number decimal currencies adds up positive Dinero objects
statusReason: [Dinero.js] Objects must have the same currency.
