[Killed] BlockStatement
src/core/api/isNegative.ts:8:76
   dineroObject: Dinero<TAmount>,
 ];
 
-export function isNegative<TAmount>(calculator: DineroCalculator<TAmount>) {
-  const lessThanFn = lessThan(calculator);
-
-  return function _isNegative(...[dineroObject]: IsNegativeParams<TAmount>) {
-    const { amount } = dineroObject.toJSON();
-
-    return lessThanFn(amount, calculator.zero());
-  };
-}
+export function isNegative<TAmount>(calculator: DineroCalculator<TAmount>) {}
 
killedBy: isNegative number returns true when amount is less than 0
statusReason: isNegativeFn is not a function

[Killed] BlockStatement
src/core/api/isNegative.ts:11:77
 export function isNegative<TAmount>(calculator: DineroCalculator<TAmount>) {
   const lessThanFn = lessThan(calculator);
 
-  return function _isNegative(...[dineroObject]: IsNegativeParams<TAmount>) {
-    const { amount } = dineroObject.toJSON();
-
-    return lessThanFn(amount, calculator.zero());
-  };
+  return function _isNegative(...[dineroObject]: IsNegativeParams<TAmount>) {};
 }
 
killedBy: isNegative number returns true when amount is less than 0
statusReason: expected undefined to be true // Object.is equality
