[Killed] BlockStatement
src/core/api/isPositive.ts:8:76
   dineroObject: Dinero<TAmount>,
 ];
 
-export function isPositive<TAmount>(calculator: DineroCalculator<TAmount>) {
-  const greaterThanFn = greaterThan(calculator);
-
-  return function _isPositive(...[dineroObject]: IsPositiveParams<TAmount>) {
-    const { amount } = dineroObject.toJSON();
-
-    return greaterThanFn(amount, calculator.zero());
-  };
-}
+export function isPositive<TAmount>(calculator: DineroCalculator<TAmount>) {}
 
killedBy: isPositive number returns false when amount is less than 0
statusReason: isPositiveFn is not a function

[Killed] BlockStatement
src/core/api/isPositive.ts:11:77
 export function isPositive<TAmount>(calculator: DineroCalculator<TAmount>) {
   const greaterThanFn = greaterThan(calculator);
 
-  return function _isPositive(...[dineroObject]: IsPositiveParams<TAmount>) {
-    const { amount } = dineroObject.toJSON();
-
-    return greaterThanFn(amount, calculator.zero());
-  };
+  return function _isPositive(...[dineroObject]: IsPositiveParams<TAmount>) {};
 }
 
killedBy: isPositive number returns false when amount is less than 0
statusReason: expected undefined to be false // Object.is equality
