[Killed] BlockStatement
src/core/api/isZero.ts:6:72
 
 export type IsZeroParams<TAmount> = readonly [dineroObject: Dinero<TAmount>];
 
-export function isZero<TAmount>(calculator: DineroCalculator<TAmount>) {
-  const equalFn = equal(calculator);
-
-  return function _isZero(...[dineroObject]: IsZeroParams<TAmount>) {
-    const { amount } = dineroObject.toJSON();
-
-    return equalFn(amount, calculator.zero());
-  };
-}
+export function isZero<TAmount>(calculator: DineroCalculator<TAmount>) {}
 
killedBy: isZero number returns true when amount is equal to 0
statusReason: isZeroFn is not a function

[Killed] BlockStatement
src/core/api/isZero.ts:9:69
 export function isZero<TAmount>(calculator: DineroCalculator<TAmount>) {
   const equalFn = equal(calculator);
 
-  return function _isZero(...[dineroObject]: IsZeroParams<TAmount>) {
-    const { amount } = dineroObject.toJSON();
-
-    return equalFn(amount, calculator.zero());
-  };
+  return function _isZero(...[dineroObject]: IsZeroParams<TAmount>) {};
 }
 
killedBy: isZero number returns true when amount is equal to 0
statusReason: expected undefined to be true // Object.is equality
