[Killed] BlockStatement
src/core/api/lessThan.ts:17:73
   comparator: Dinero<TAmount, NoInfer<TCurrency>>,
 ];
 
-function unsafeLessThan<TAmount>(calculator: DineroCalculator<TAmount>) {
-  const lessThanFn = lt(calculator);
-
-  return function lessThan<TCurrency extends string>(
-    ...[dineroObject, comparator]: LessThanParams<TAmount, TCurrency>
-  ) {
-    const dineroObjects = [dineroObject, comparator];
-
-    const [subjectAmount, comparatorAmount] = dineroObjects.map((d) => {
-      const { amount } = d.toJSON();
-
-      return amount;
-    });
-
-    return lessThanFn(subjectAmount, comparatorAmount);
-  };
-}
+function unsafeLessThan<TAmount>(calculator: DineroCalculator<TAmount>) {}
 
 export function safeLessThan<TAmount>(calculator: DineroCalculator<TAmount>) {
killedBy: lessThan number returns true when the first amount is less than the other
statusReason: lessThanFn is not a function

[Killed] BlockStatement
src/core/api/lessThan.ts:22:5
 
   return function lessThan<TCurrency extends string>(
     ...[dineroObject, comparator]: LessThanParams<TAmount, TCurrency>
-  ) {
-    const dineroObjects = [dineroObject, comparator];
-
-    const [subjectAmount, comparatorAmount] = dineroObjects.map((d) => {
-      const { amount } = d.toJSON();
-
-      return amount;
-    });
-
-    return lessThanFn(subjectAmount, comparatorAmount);
-  };
+  ) {};
 }
 
killedBy: lessThan number returns true when the first amount is less than the other
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/core/api/lessThan.ts:35:78
   };
 }
 
-export function safeLessThan<TAmount>(calculator: DineroCalculator<TAmount>) {
-  const normalizeFn = normalizeScale(calculator);
-  const lessThanFn = unsafeLessThan(calculator);
-
-  return function lessThan<TCurrency extends string>(
-    ...[dineroObject, comparator]: LessThanParams<TAmount, TCurrency>
-  ) {
-    const condition = haveSameCurrency([dineroObject, comparator]);
-    assert(condition, UNEQUAL_CURRENCIES_MESSAGE);
-
-    const [subjectAmount, comparatorAmount] = normalizeFn([
-      dineroObject,
-      comparator,
-    ]);
-
-    return lessThanFn(subjectAmount, comparatorAmount);
-  };
-}
+export function safeLessThan<TAmount>(calculator: DineroCalculator<TAmount>) {}
 
killedBy: lessThan number returns true when the first amount is less than the other
statusReason: lessThanFn is not a function

[Killed] BlockStatement
src/core/api/lessThan.ts:41:5
 
   return function lessThan<TCurrency extends string>(
     ...[dineroObject, comparator]: LessThanParams<TAmount, TCurrency>
-  ) {
-    const condition = haveSameCurrency([dineroObject, comparator]);
-    assert(condition, UNEQUAL_CURRENCIES_MESSAGE);
-
-    const [subjectAmount, comparatorAmount] = normalizeFn([
-      dineroObject,
-      comparator,
-    ]);
-
-    return lessThanFn(subjectAmount, comparatorAmount);
-  };
+  ) {};
 }
 
killedBy: lessThan number returns true when the first amount is less than the other
statusReason: expected undefined to be true // Object.is equality
