[Killed] BlockStatement
src/core/api/lessThanOrEqual.ts:17:80
   comparator: Dinero<TAmount, NoInfer<TCurrency>>,
 ];
 
-function unsafeLessThanOrEqual<TAmount>(calculator: DineroCalculator<TAmount>) {
-  const lessThanOrEqualFn = lte(calculator);
-
-  return function lessThanOrEqual<TCurrency extends string>(
-    ...[dineroObject, comparator]: LessThanOrEqualParams<TAmount, TCurrency>
-  ) {
-    const dineroObjects = [dineroObject, comparator];
-
-    const [subjectAmount, comparatorAmount] = dineroObjects.map((d) => {
-      const { amount } = d.toJSON();
-
-      return amount;
-    });
-
-    return lessThanOrEqualFn(subjectAmount, comparatorAmount);
-  };
-}
+function unsafeLessThanOrEqual<TAmount>(calculator: DineroCalculator<TAmount>) {}
 
 export function safeLessThanOrEqual<TAmount>(
killedBy: lessThanOrEqual number returns true when the first amount is less than the other
statusReason: lessThanOrEqualFn is not a function

[Killed] BlockStatement
src/core/api/lessThanOrEqual.ts:22:5
 
   return function lessThanOrEqual<TCurrency extends string>(
     ...[dineroObject, comparator]: LessThanOrEqualParams<TAmount, TCurrency>
-  ) {
-    const dineroObjects = [dineroObject, comparator];
-
-    const [subjectAmount, comparatorAmount] = dineroObjects.map((d) => {
-      const { amount } = d.toJSON();
-
-      return amount;
-    });
-
-    return lessThanOrEqualFn(subjectAmount, comparatorAmount);
-  };
+  ) {};
 }
 
killedBy: compare properties is transitive: if a <= b and b <= c, then a <= c
statusReason: Property failed after 1 tests
{ seed: -1645387471, path: "0:0:0:0", endOnFailure: true }
Counterexample: [0,0,0]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/core/api/lessThanOrEqual.ts:37:3
 
 export function safeLessThanOrEqual<TAmount>(
   calculator: DineroCalculator<TAmount>
-) {
-  const normalizeFn = normalizeScale(calculator);
-  const lessThanOrEqualFn = unsafeLessThanOrEqual(calculator);
-
-  return function lessThanOrEqual<TCurrency extends string>(
-    ...[dineroObject, comparator]: LessThanOrEqualParams<TAmount, TCurrency>
-  ) {
-    const condition = haveSameCurrency([dineroObject, comparator]);
-    assert(condition, UNEQUAL_CURRENCIES_MESSAGE);
-
-    const [subjectAmount, comparatorAmount] = normalizeFn([
-      dineroObject,
-      comparator,
-    ]);
-
-    return lessThanOrEqualFn(subjectAmount, comparatorAmount);
-  };
-}
+) {}
 
killedBy: compare properties is transitive: if a <= b and b <= c, then a <= c
statusReason: Property failed after 1 tests
{ seed: -1585039034, path: "0:0:0:0", endOnFailure: true }
Counterexample: [0,0,0]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/core/api/lessThanOrEqual.ts:43:5
 
   return function lessThanOrEqual<TCurrency extends string>(
     ...[dineroObject, comparator]: LessThanOrEqualParams<TAmount, TCurrency>
-  ) {
-    const condition = haveSameCurrency([dineroObject, comparator]);
-    assert(condition, UNEQUAL_CURRENCIES_MESSAGE);
-
-    const [subjectAmount, comparatorAmount] = normalizeFn([
-      dineroObject,
-      comparator,
-    ]);
-
-    return lessThanOrEqualFn(subjectAmount, comparatorAmount);
-  };
+  ) {};
 }
 
killedBy: lessThanOrEqual number returns true when the first amount is less than the other
statusReason: expected undefined to be true // Object.is equality
