[Killed] BlockStatement
src/core/api/maximum.ts:19:72
   ],
 ];
 
-function unsafeMaximum<TAmount>(calculator: DineroCalculator<TAmount>) {
-  const maxFn = max(calculator);
-
-  return function maximum<TCurrency extends string>(
-    dineroObjects: ReadonlyArray<Dinero<TAmount, TCurrency>>
-  ) {
-    const [firstDinero] = dineroObjects;
-    const { currency, scale } = firstDinero.toJSON();
-
-    const amount = maxFn(
-      dineroObjects.map((subject) => {
-        const { amount: subjectAmount } = subject.toJSON();
-
-        return subjectAmount;
-      })
-    );
-
-    return firstDinero.create({
-      amount,
-      currency,
-      scale,
-    });
-  };
-}
+function unsafeMaximum<TAmount>(calculator: DineroCalculator<TAmount>) {}
 
 export function safeMaximum<TAmount>(calculator: DineroCalculator<TAmount>) {
killedBy: maximum number returns the greatest from a set of Dinero objects
statusReason: maxFn is not a function

[Killed] BlockStatement
src/core/api/maximum.ts:24:5
 
   return function maximum<TCurrency extends string>(
     dineroObjects: ReadonlyArray<Dinero<TAmount, TCurrency>>
-  ) {
-    const [firstDinero] = dineroObjects;
-    const { currency, scale } = firstDinero.toJSON();
-
-    const amount = maxFn(
-      dineroObjects.map((subject) => {
-        const { amount: subjectAmount } = subject.toJSON();
-
-        return subjectAmount;
-      })
-    );
-
-    return firstDinero.create({
-      amount,
-      currency,
-      scale,
-    });
-  };
+  ) {};
 }
 
killedBy: maximum number returns the greatest from a set of Dinero objects
statusReason: Cannot read properties of undefined (reading 'toJSON')

[Killed] BlockStatement
src/core/api/maximum.ts:29:38
     const { currency, scale } = firstDinero.toJSON();
 
     const amount = maxFn(
-      dineroObjects.map((subject) => {
-        const { amount: subjectAmount } = subject.toJSON();
-
-        return subjectAmount;
-      })
+      dineroObjects.map((subject) => {})
     );
 
killedBy: maximum number returns the greatest from a set of Dinero objects
statusReason: [Dinero.js] Amount is invalid.

[Killed] ObjectLiteral
src/core/api/maximum.ts:36:31
       })
     );
 
-    return firstDinero.create({
-      amount,
-      currency,
-      scale,
-    });
+    return firstDinero.create({});
   };
 }
killedBy: maximum number returns the greatest from a set of Dinero objects
statusReason: Cannot read properties of undefined (reading 'code')

[Killed] BlockStatement
src/core/api/maximum.ts:44:77
   };
 }
 
-export function safeMaximum<TAmount>(calculator: DineroCalculator<TAmount>) {
-  const normalizeFn = normalizeScale(calculator);
-  const maxFn = unsafeMaximum(calculator);
-
-  return function maximum<TCurrency extends string>(
-    ...[dineroObjects]: MaximumParams<TAmount, TCurrency>
-  ) {
-    const condition = haveSameCurrency(dineroObjects);
-    assert(condition, UNEQUAL_CURRENCIES_MESSAGE);
-
-    const normalizedDineroObjects = normalizeFn([...dineroObjects]);
-
-    return maxFn(normalizedDineroObjects);
-  };
-}
+export function safeMaximum<TAmount>(calculator: DineroCalculator<TAmount>) {}
 
killedBy: maximum number returns the greatest from a set of Dinero objects
statusReason: maximumFn is not a function

[Killed] BlockStatement
src/core/api/maximum.ts:50:5
 
   return function maximum<TCurrency extends string>(
     ...[dineroObjects]: MaximumParams<TAmount, TCurrency>
-  ) {
-    const condition = haveSameCurrency(dineroObjects);
-    assert(condition, UNEQUAL_CURRENCIES_MESSAGE);
-
-    const normalizedDineroObjects = normalizeFn([...dineroObjects]);
-
-    return maxFn(normalizedDineroObjects);
-  };
+  ) {};
 }
 
killedBy: maximum number returns the greatest from a set of Dinero objects
statusReason: Cannot read properties of undefined (reading 'toJSON')

[Killed] CallExpression
src/core/api/maximum.ts:52:5
     ...[dineroObjects]: MaximumParams<TAmount, TCurrency>
   ) {
     const condition = haveSameCurrency(dineroObjects);
-    assert(condition, UNEQUAL_CURRENCIES_MESSAGE);
+    ;
 
     const normalizedDineroObjects = normalizeFn([...dineroObjects]);
killedBy: maximum number throws when using different currencies
statusReason: snapshot function didn't throw
