[Killed] BlockStatement
src/core/api/minimum.ts:19:72
   ],
 ];
 
-function unsafeMinimum<TAmount>(calculator: DineroCalculator<TAmount>) {
-  const minFn = min(calculator);
-
-  return function minimum<TCurrency extends string>(
-    dineroObjects: ReadonlyArray<Dinero<TAmount, TCurrency>>
-  ) {
-    const [firstDinero] = dineroObjects;
-    const { currency, scale } = firstDinero.toJSON();
-
-    const amount = minFn(
-      dineroObjects.map((subject) => {
-        const { amount: subjectAmount } = subject.toJSON();
-
-        return subjectAmount;
-      })
-    );
-
-    return firstDinero.create({
-      amount,
-      currency,
-      scale,
-    });
-  };
-}
+function unsafeMinimum<TAmount>(calculator: DineroCalculator<TAmount>) {}
 
 export function safeMinimum<TAmount>(calculator: DineroCalculator<TAmount>) {
killedBy: minimum number returns the lower from a set of Dinero objects
statusReason: minFn is not a function

[Killed] BlockStatement
src/core/api/minimum.ts:24:5
 
   return function minimum<TCurrency extends string>(
     dineroObjects: ReadonlyArray<Dinero<TAmount, TCurrency>>
-  ) {
-    const [firstDinero] = dineroObjects;
-    const { currency, scale } = firstDinero.toJSON();
-
-    const amount = minFn(
-      dineroObjects.map((subject) => {
-        const { amount: subjectAmount } = subject.toJSON();
-
-        return subjectAmount;
-      })
-    );
-
-    return firstDinero.create({
-      amount,
-      currency,
-      scale,
-    });
-  };
+  ) {};
 }
 
killedBy: minimum number returns the lower from a set of Dinero objects
statusReason: Cannot read properties of undefined (reading 'toJSON')

[Killed] BlockStatement
src/core/api/minimum.ts:29:38
     const { currency, scale } = firstDinero.toJSON();
 
     const amount = minFn(
-      dineroObjects.map((subject) => {
-        const { amount: subjectAmount } = subject.toJSON();
-
-        return subjectAmount;
-      })
+      dineroObjects.map((subject) => {})
     );
 
killedBy: minimum number returns the lower from a set of Dinero objects
statusReason: [Dinero.js] Amount is invalid.

[Killed] BlockStatement
src/core/api/minimum.ts:44:77
   };
 }
 
-export function safeMinimum<TAmount>(calculator: DineroCalculator<TAmount>) {
-  const normalizeFn = normalizeScale(calculator);
-  const minFn = unsafeMinimum(calculator);
-
-  return function minimum<TCurrency extends string>(
-    ...[dineroObjects]: MinimumParams<TAmount, TCurrency>
-  ) {
-    const condition = haveSameCurrency(dineroObjects);
-    assert(condition, UNEQUAL_CURRENCIES_MESSAGE);
-
-    const normalizedDineroObjects = normalizeFn([...dineroObjects]);
-
-    return minFn(normalizedDineroObjects);
-  };
-}
+export function safeMinimum<TAmount>(calculator: DineroCalculator<TAmount>) {}
 
killedBy: minimum number returns the lower from a set of Dinero objects
statusReason: minimumFn is not a function

[Killed] BlockStatement
src/core/api/minimum.ts:50:5
 
   return function minimum<TCurrency extends string>(
     ...[dineroObjects]: MinimumParams<TAmount, TCurrency>
-  ) {
-    const condition = haveSameCurrency(dineroObjects);
-    assert(condition, UNEQUAL_CURRENCIES_MESSAGE);
-
-    const normalizedDineroObjects = normalizeFn([...dineroObjects]);
-
-    return minFn(normalizedDineroObjects);
-  };
+  ) {};
 }
 
killedBy: minimum number returns the lower from a set of Dinero objects
statusReason: Cannot read properties of undefined (reading 'toJSON')

[Killed] ArrayDeclaration
src/core/api/minimum.ts:54:49
     const condition = haveSameCurrency(dineroObjects);
     assert(condition, UNEQUAL_CURRENCIES_MESSAGE);
 
-    const normalizedDineroObjects = normalizeFn([...dineroObjects]);
+    const normalizedDineroObjects = normalizeFn([]);
 
     return minFn(normalizedDineroObjects);
killedBy: minimum number returns the lower from a set of Dinero objects
statusReason: Cannot read properties of undefined (reading 'toJSON')
