[Killed] BlockStatement
src/core/api/multiply.ts:14:74
   multiplier: DineroScaledAmount<TAmount> | TAmount,
 ];
 
-export function multiply<TAmount>(calculator: DineroCalculator<TAmount>) {
-  const convertScaleFn = transformScale(calculator);
-  const zero = calculator.zero();
-
-  return function multiplyFn<TCurrency extends string>(
-    ...[multiplicand, multiplier]: MultiplyParams<TAmount, TCurrency>
-  ) {
-    const { amount, currency, scale } = multiplicand.toJSON();
-    const { amount: multiplierAmount, scale: multiplierScale } =
-      getAmountAndScale(multiplier, zero);
-
-    const newScale = calculator.add(scale, multiplierScale);
-
-    return convertScaleFn(
-      multiplicand.create({
-        amount: calculator.multiply(amount, multiplierAmount),
-        currency,
-        scale: newScale,
-      }),
-      newScale
-    );
-  };
-}
+export function multiply<TAmount>(calculator: DineroCalculator<TAmount>) {}
 
killedBy: multiply number multiplies positive Dinero objects
statusReason: multiplyFn is not a function

[Killed] BlockStatement
src/core/api/multiply.ts:20:5
 
   return function multiplyFn<TCurrency extends string>(
     ...[multiplicand, multiplier]: MultiplyParams<TAmount, TCurrency>
-  ) {
-    const { amount, currency, scale } = multiplicand.toJSON();
-    const { amount: multiplierAmount, scale: multiplierScale } =
-      getAmountAndScale(multiplier, zero);
-
-    const newScale = calculator.add(scale, multiplierScale);
-
-    return convertScaleFn(
-      multiplicand.create({
-        amount: calculator.multiply(amount, multiplierAmount),
-        currency,
-        scale: newScale,
-      }),
-      newScale
-    );
-  };
+  ) {};
 }
 
killedBy: multiply number multiplies positive Dinero objects
statusReason: Cannot read properties of undefined (reading 'toJSON')
