[Killed] BlockStatement
src/core/api/normalizeScale.ts:16:80
   ],
 ];
 
-export function normalizeScale<TAmount>(calculator: DineroCalculator<TAmount>) {
-  const maximumFn = maximum(calculator);
-  const convertScaleFn = transformScale(calculator);
-  const equalFn = equal(calculator);
-
-  return function _normalizeScale<TCurrency extends string>(
-    ...[dineroObjects]: NormalizeScaleParams<TAmount, TCurrency>
-  ) {
-    const highestScale = dineroObjects.reduce((highest, current) => {
-      const { scale } = current.toJSON();
-
-      return maximumFn([highest, scale]);
-    }, calculator.zero());
-
-    return dineroObjects.map((d) => {
-      const { scale } = d.toJSON();
-
-      return !equalFn(scale, highestScale)
-        ? convertScaleFn(d, highestScale)
-        : d;
-    });
-  };
-}
+export function normalizeScale<TAmount>(calculator: DineroCalculator<TAmount>) {}
 
killedBy: minimum number returns the lower from a set of Dinero objects
statusReason: normalizeFn is not a function

[Killed] BlockStatement
src/core/api/normalizeScale.ts:23:5
 
   return function _normalizeScale<TCurrency extends string>(
     ...[dineroObjects]: NormalizeScaleParams<TAmount, TCurrency>
-  ) {
-    const highestScale = dineroObjects.reduce((highest, current) => {
-      const { scale } = current.toJSON();
-
-      return maximumFn([highest, scale]);
-    }, calculator.zero());
-
-    return dineroObjects.map((d) => {
-      const { scale } = d.toJSON();
-
-      return !equalFn(scale, highestScale)
-        ? convertScaleFn(d, highestScale)
-        : d;
-    });
-  };
+  ) {};
 }
 
killedBy: minimum number returns the lower from a set of Dinero objects
statusReason: dineroObjects is not iterable

[Killed] BlockStatement
src/core/api/normalizeScale.ts:24:69
   return function _normalizeScale<TCurrency extends string>(
     ...[dineroObjects]: NormalizeScaleParams<TAmount, TCurrency>
   ) {
-    const highestScale = dineroObjects.reduce((highest, current) => {
-      const { scale } = current.toJSON();
-
-      return maximumFn([highest, scale]);
-    }, calculator.zero());
+    const highestScale = dineroObjects.reduce((highest, current) => {}, calculator.zero());
 
     return dineroObjects.map((d) => {
killedBy: lessThan number normalizes the result to the highest scale
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/api/normalizeScale.ts:30:37
       return maximumFn([highest, scale]);
     }, calculator.zero());
 
-    return dineroObjects.map((d) => {
-      const { scale } = d.toJSON();
-
-      return !equalFn(scale, highestScale)
-        ? convertScaleFn(d, highestScale)
-        : d;
-    });
+    return dineroObjects.map((d) => {});
   };
 }
killedBy: maximum number returns the greatest from a set of Dinero objects
statusReason: Cannot read properties of undefined (reading 'toJSON')

[Killed] BooleanLiteral
src/core/api/normalizeScale.ts:33:14
     return dineroObjects.map((d) => {
       const { scale } = d.toJSON();
 
-      return !equalFn(scale, highestScale)
+      return equalFn(scale, highestScale)
         ? convertScaleFn(d, highestScale)
         : d;
killedBy: minimum number returns the greatest from a set of Dinero objects after normalization
statusReason: expected { amount: 500, …(2) } to deeply equal { amount: 1000, …(2) }
