[Killed] BlockStatement
src/core/api/subtract.ts:16:73
   subtrahend: Dinero<TAmount, NoInfer<TCurrency>>,
 ];
 
-function unsafeSubtract<TAmount>(calculator: DineroCalculator<TAmount>) {
-  return function subtract<TCurrency extends string>(
-    ...[minuend, subtrahend]: SubtractParams<TAmount, TCurrency>
-  ) {
-    const { amount: minuendAmount, currency, scale } = minuend.toJSON();
-    const { amount: subtrahendAmount } = subtrahend.toJSON();
-
-    const amount = calculator.subtract(minuendAmount, subtrahendAmount);
-
-    return minuend.create({
-      amount,
-      currency,
-      scale,
-    });
-  };
-}
+function unsafeSubtract<TAmount>(calculator: DineroCalculator<TAmount>) {}
 
 export function safeSubtract<TAmount>(calculator: DineroCalculator<TAmount>) {
killedBy: add properties is the inverse of subtract: subtract(add(a, b), b) equals a
statusReason: Property failed after 1 tests
{ seed: 1114031834, path: "0:0:0", endOnFailure: true }
Counterexample: [0,0]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/core/api/subtract.ts:19:5
 function unsafeSubtract<TAmount>(calculator: DineroCalculator<TAmount>) {
   return function subtract<TCurrency extends string>(
     ...[minuend, subtrahend]: SubtractParams<TAmount, TCurrency>
-  ) {
-    const { amount: minuendAmount, currency, scale } = minuend.toJSON();
-    const { amount: subtrahendAmount } = subtrahend.toJSON();
-
-    const amount = calculator.subtract(minuendAmount, subtrahendAmount);
-
-    return minuend.create({
-      amount,
-      currency,
-      scale,
-    });
-  };
+  ) {};
 }
 
killedBy: subtract number subtracts positive Dinero objects
statusReason: Cannot read properties of undefined (reading 'toJSON')

[Killed] ObjectLiteral
src/core/api/subtract.ts:25:27
 
     const amount = calculator.subtract(minuendAmount, subtrahendAmount);
 
-    return minuend.create({
-      amount,
-      currency,
-      scale,
-    });
+    return minuend.create({});
   };
 }
killedBy: add properties is the inverse of subtract: subtract(add(a, b), b) equals a
statusReason: Property failed after 1 tests
{ seed: 1911091730, path: "0:0:0", endOnFailure: true }
Counterexample: [0,0]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/core/api/subtract.ts:33:78
   };
 }
 
-export function safeSubtract<TAmount>(calculator: DineroCalculator<TAmount>) {
-  const normalizeFn = normalizeScale(calculator);
-  const subtractFn = unsafeSubtract(calculator);
-
-  return function subtract<TCurrency extends string>(
-    ...[minuend, subtrahend]: SubtractParams<TAmount, TCurrency>
-  ) {
-    const condition = haveSameCurrency([minuend, subtrahend]);
-    assert(condition, UNEQUAL_CURRENCIES_MESSAGE);
-
-    const [newMinuend, newSubtrahend] = normalizeFn([minuend, subtrahend]);
-
-    return subtractFn(newMinuend, newSubtrahend);
-  };
-}
+export function safeSubtract<TAmount>(calculator: DineroCalculator<TAmount>) {}
 
killedBy: add properties is the inverse of subtract: subtract(add(a, b), b) equals a
statusReason: Property failed after 1 tests
{ seed: -1587943142, path: "0:0:0", endOnFailure: true }
Counterexample: [0,0]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/core/api/subtract.ts:39:5
 
   return function subtract<TCurrency extends string>(
     ...[minuend, subtrahend]: SubtractParams<TAmount, TCurrency>
-  ) {
-    const condition = haveSameCurrency([minuend, subtrahend]);
-    assert(condition, UNEQUAL_CURRENCIES_MESSAGE);
-
-    const [newMinuend, newSubtrahend] = normalizeFn([minuend, subtrahend]);
-
-    return subtractFn(newMinuend, newSubtrahend);
-  };
+  ) {};
 }
 
killedBy: add properties is the inverse of subtract: subtract(add(a, b), b) equals a
statusReason: Property failed after 1 tests
{ seed: 1725960038, path: "0:0:0", endOnFailure: true }
Counterexample: [0,0]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] CallExpression
src/core/api/subtract.ts:41:5
     ...[minuend, subtrahend]: SubtractParams<TAmount, TCurrency>
   ) {
     const condition = haveSameCurrency([minuend, subtrahend]);
-    assert(condition, UNEQUAL_CURRENCIES_MESSAGE);
+    ;
 
     const [newMinuend, newSubtrahend] = normalizeFn([minuend, subtrahend]);
killedBy: subtract number throws when using different currencies
statusReason: snapshot function didn't throw
