[Killed] BlockStatement
src/core/api/toDecimal.ts:31:5
 
   return function toDecimalFn<TCurrency extends string>(
     ...[dineroObject, transformer]: ToDecimalParams<TAmount, TOutput, TCurrency>
-  ) {
-    const { currency, scale } = dineroObject.toJSON();
-
-    const base = computeBaseFn(currency.base);
-    const zero = calculator.zero();
-    const ten = new Array(10).fill(null).reduce(calculator.increment, zero);
-
-    const isMultiBase = isArray(currency.base);
-    const isBaseTen = equalFn(calculator.modulo(base, ten), zero);
-    const isDecimal = !isMultiBase && isBaseTen;
-
-    assert(isDecimal, NON_DECIMAL_CURRENCY_MESSAGE);
-
-    const units = toUnitsFn(dineroObject);
-
-    const getDecimalFn = getDecimal(calculator, dineroObject.formatter);
-    const value = getDecimalFn(units, scale);
-
-    if (!transformer) {
-      return value;
-    }
-
-    return transformer({ value, currency });
-  };
+  ) {};
 }
 
killedBy: toDecimal number decimal currencies returns the amount in decimal format
statusReason: expected undefined to be '10.50' // Object.is equality

[Killed] LogicalOperator
src/core/api/toDecimal.ts:40:23
 
     const isMultiBase = isArray(currency.base);
     const isBaseTen = equalFn(calculator.modulo(base, ten), zero);
-    const isDecimal = !isMultiBase && isBaseTen;
+    const isDecimal = !isMultiBase || isBaseTen;
 
     assert(isDecimal, NON_DECIMAL_CURRENCY_MESSAGE);
killedBy: toDecimal number non-decimal currencies throws when passing a Dinero object using a non-decimal currency
statusReason: snapshot function didn't throw

[Killed] ConditionalExpression
src/core/api/toDecimal.ts:40:23
 
     const isMultiBase = isArray(currency.base);
     const isBaseTen = equalFn(calculator.modulo(base, ten), zero);
-    const isDecimal = !isMultiBase && isBaseTen;
+    const isDecimal = false;
 
     assert(isDecimal, NON_DECIMAL_CURRENCY_MESSAGE);
killedBy: toDecimal number decimal currencies returns the amount in decimal format
statusReason: [Dinero.js] Currency is not decimal.

[Killed] CallExpression
src/core/api/toDecimal.ts:42:5
     const isBaseTen = equalFn(calculator.modulo(base, ten), zero);
     const isDecimal = !isMultiBase && isBaseTen;
 
-    assert(isDecimal, NON_DECIMAL_CURRENCY_MESSAGE);
+    ;
 
     const units = toUnitsFn(dineroObject);
killedBy: toDecimal number non-decimal currencies throws when passing a Dinero object using a non-decimal currency
statusReason: snapshot function didn't throw

[Killed] BlockStatement
src/core/api/toDecimal.ts:49:23
     const getDecimalFn = getDecimal(calculator, dineroObject.formatter);
     const value = getDecimalFn(units, scale);
 
-    if (!transformer) {
-      return value;
-    }
+    if (!transformer) {}
 
     return transformer({ value, currency });
killedBy: toDecimal number decimal currencies returns the amount in decimal format
statusReason: transformer is not a function

[Killed] BooleanLiteral
src/core/api/toDecimal.ts:49:9
     const getDecimalFn = getDecimal(calculator, dineroObject.formatter);
     const value = getDecimalFn(units, scale);
 
-    if (!transformer) {
+    if (transformer) {
       return value;
     }
killedBy: toDecimal number decimal currencies returns the amount in decimal format
statusReason: transformer is not a function

[Killed] BlockStatement
src/core/api/toDecimal.ts:60:3
 function getDecimal<TAmount>(
   calculator: DineroCalculator<TAmount>,
   formatter: DineroFormatter<TAmount>
-) {
-  const absoluteFn = absolute(calculator);
-  const equalFn = equal(calculator);
-  const lessThanFn = lessThan(calculator);
-  const zero = calculator.zero();
-
-  return (units: readonly TAmount[], scale: TAmount) => {
-    const whole = formatter.toString(units[0]);
-    const fractional = formatter.toString(absoluteFn(units[1]));
-
-    const scaleNumber = formatter.toNumber(scale);
-    const fractionalString =
-      scaleNumber > 0 ? `.${fractional.padStart(scaleNumber, '0')}` : '';
-    const decimal = `${whole}${fractionalString}`;
-
-    const leadsWithZero = equalFn(units[0], zero);
-    const isNegative = lessThanFn(units[1], zero);
-
-    // A leading negative zero is a special case because the `toString`
-    // formatter won't preserve its negative sign (since 0 === -0).
-    return leadsWithZero && isNegative ? `-${decimal}` : decimal;
-  };
-}
+) {}
 
killedBy: toDecimal number decimal currencies returns the amount in decimal format
statusReason: getDecimalFn is not a function

[Killed] BlockStatement
src/core/api/toDecimal.ts:66:57
   const lessThanFn = lessThan(calculator);
   const zero = calculator.zero();
 
-  return (units: readonly TAmount[], scale: TAmount) => {
-    const whole = formatter.toString(units[0]);
-    const fractional = formatter.toString(absoluteFn(units[1]));
-
-    const scaleNumber = formatter.toNumber(scale);
-    const fractionalString =
-      scaleNumber > 0 ? `.${fractional.padStart(scaleNumber, '0')}` : '';
-    const decimal = `${whole}${fractionalString}`;
-
-    const leadsWithZero = equalFn(units[0], zero);
-    const isNegative = lessThanFn(units[1], zero);
-
-    // A leading negative zero is a special case because the `toString`
-    // formatter won't preserve its negative sign (since 0 === -0).
-    return leadsWithZero && isNegative ? `-${decimal}` : decimal;
-  };
+  return (units: readonly TAmount[], scale: TAmount) => {};
 }
 
killedBy: toDecimal number decimal currencies returns the amount in decimal format
statusReason: expected undefined to be '10.50' // Object.is equality

[Killed] EqualityOperator
src/core/api/toDecimal.ts:72:7
 
     const scaleNumber = formatter.toNumber(scale);
     const fractionalString =
-      scaleNumber > 0 ? `.${fractional.padStart(scaleNumber, '0')}` : '';
+      scaleNumber >= 0 ? `.${fractional.padStart(scaleNumber, '0')}` : '';
     const decimal = `${whole}${fractionalString}`;
 
killedBy: toDecimal number decimal currencies returns whole numbers when scale is zero
statusReason: expected '100.0' to be '100' // Object.is equality

[Killed] ConditionalExpression
src/core/api/toDecimal.ts:72:7
 
     const scaleNumber = formatter.toNumber(scale);
     const fractionalString =
-      scaleNumber > 0 ? `.${fractional.padStart(scaleNumber, '0')}` : '';
+      true ? `.${fractional.padStart(scaleNumber, '0')}` : '';
     const decimal = `${whole}${fractionalString}`;
 
killedBy: toDecimal number decimal currencies returns whole numbers when scale is zero
statusReason: expected '100.0' to be '100' // Object.is equality

[Killed] StringLiteral
src/core/api/toDecimal.ts:73:21
     const scaleNumber = formatter.toNumber(scale);
     const fractionalString =
       scaleNumber > 0 ? `.${fractional.padStart(scaleNumber, '0')}` : '';
-    const decimal = `${whole}${fractionalString}`;
+    const decimal = ``;
 
     const leadsWithZero = equalFn(units[0], zero);
killedBy: toDecimal number decimal currencies returns the amount in decimal format
statusReason: expected '' to be '10.50' // Object.is equality

[Killed] ConditionalExpression
src/core/api/toDecimal.ts:80:12
 
     // A leading negative zero is a special case because the `toString`
     // formatter won't preserve its negative sign (since 0 === -0).
-    return leadsWithZero && isNegative ? `-${decimal}` : decimal;
+    return false ? `-${decimal}` : decimal;
   };
 }
killedBy: toDecimal number decimal currencies returns the negative amount with a leading zero in decimal format
statusReason: expected '0.01' to be '-0.01' // Object.is equality

[Killed] LogicalOperator
src/core/api/toDecimal.ts:80:12
 
     // A leading negative zero is a special case because the `toString`
     // formatter won't preserve its negative sign (since 0 === -0).
-    return leadsWithZero && isNegative ? `-${decimal}` : decimal;
+    return leadsWithZero || isNegative ? `-${decimal}` : decimal;
   };
 }
killedBy: toDecimal number decimal currencies returns the negative amount in decimal format
statusReason: expected '--10.50' to be '-10.50' // Object.is equality
