[Killed] BlockStatement
src/core/api/toUnits.ts:25:5
 
   return function toUnitsFn<TCurrency extends string>(
     ...[dineroObject, transformer]: ToUnitsParams<TAmount, TOutput, TCurrency>
-  ) {
-    const { amount, currency, scale } = dineroObject.toJSON();
-    const { power, integerDivide, modulo } = calculator;
-
-    const bases = isArray(currency.base) ? currency.base : [currency.base];
-    const divisors = getDivisorsFn(bases.map((base) => power(base, scale)));
-    const value = divisors.reduce<readonly TAmount[]>(
-      (amounts, divisor, index) => {
-        const amountLeft = amounts[index];
-
-        const quotient = integerDivide(amountLeft, divisor);
-        const remainder = modulo(amountLeft, divisor);
-
-        return [...amounts.filter((_, i) => i !== index), quotient, remainder];
-      },
-      [amount]
-    );
-
-    if (!transformer) {
-      return value;
-    }
-
-    return transformer({ value, currency });
-  };
+  ) {};
 }
 
killedBy: toDecimal number decimal currencies returns the amount in decimal format
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ArrayDeclaration
src/core/api/toUnits.ts:29:60
     const { amount, currency, scale } = dineroObject.toJSON();
     const { power, integerDivide, modulo } = calculator;
 
-    const bases = isArray(currency.base) ? currency.base : [currency.base];
+    const bases = isArray(currency.base) ? currency.base : [];
     const divisors = getDivisorsFn(bases.map((base) => power(base, scale)));
     const value = divisors.reduce<readonly TAmount[]>(
killedBy: toDecimal number decimal currencies returns the amount in decimal format
statusReason: expected '1050.00' to be '10.50' // Object.is equality

[Killed] ArrowFunction
src/core/api/toUnits.ts:30:46
     const { power, integerDivide, modulo } = calculator;
 
     const bases = isArray(currency.base) ? currency.base : [currency.base];
-    const divisors = getDivisorsFn(bases.map((base) => power(base, scale)));
+    const divisors = getDivisorsFn(bases.map(() => undefined));
     const value = divisors.reduce<readonly TAmount[]>(
       (amounts, divisor, index) => {
killedBy: toDecimal number decimal currencies returns the amount in decimal format
statusReason: expected 'NaN.00' to be '10.50' // Object.is equality

[Killed] BlockStatement
src/core/api/toUnits.ts:32:36
     const bases = isArray(currency.base) ? currency.base : [currency.base];
     const divisors = getDivisorsFn(bases.map((base) => power(base, scale)));
     const value = divisors.reduce<readonly TAmount[]>(
-      (amounts, divisor, index) => {
-        const amountLeft = amounts[index];
-
-        const quotient = integerDivide(amountLeft, divisor);
-        const remainder = modulo(amountLeft, divisor);
-
-        return [...amounts.filter((_, i) => i !== index), quotient, remainder];
-      },
+      (amounts, divisor, index) => {},
       [amount]
     );
killedBy: toDecimal number decimal currencies returns the amount in decimal format
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
src/core/api/toUnits.ts:38:45
         const quotient = integerDivide(amountLeft, divisor);
         const remainder = modulo(amountLeft, divisor);
 
-        return [...amounts.filter((_, i) => i !== index), quotient, remainder];
+        return [...amounts.filter((_, i) => false), quotient, remainder];
       },
       [amount]
killedBy: toUnits number non-decimal currencies handles currencies with multiple subdivisions
statusReason: expected [ 2, 3 ] to deeply equal [ 1, 2, 3 ]

[Killed] MethodExpression
src/core/api/toUnits.ts:38:20
         const quotient = integerDivide(amountLeft, divisor);
         const remainder = modulo(amountLeft, divisor);
 
-        return [...amounts.filter((_, i) => i !== index), quotient, remainder];
+        return [...amounts, quotient, remainder];
       },
       [amount]
killedBy: toDecimal number decimal currencies returns the amount in decimal format
statusReason: expected '1050.10' to be '10.50' // Object.is equality

[Killed] ConditionalExpression
src/core/api/toUnits.ts:43:9
       [amount]
     );
 
-    if (!transformer) {
+    if (true) {
       return value;
     }
killedBy: toUnits number decimal currencies uses a custom transformer
statusReason: expected [ 10, 50 ] to be '10.50 USD' // Object.is equality

[Killed] ConditionalExpression
src/core/api/toUnits.ts:43:9
       [amount]
     );
 
-    if (!transformer) {
+    if (false) {
       return value;
     }
killedBy: toUnits number decimal currencies returns the amount in currency units
statusReason: transformer is not a function
