[Killed] BlockStatement
src/core/api/toSnapshot.ts:5:3
 
 export function toSnapshot<TAmount, TCurrency extends string>(
   dineroObject: Dinero<TAmount, TCurrency>
-) {
-  return dineroObject.toJSON();
-}
+) {}
 
killedBy: transformScale number decimal currencies returns a new Dinero object with a new scale and a converted amount
statusReason: expected undefined to match object { amount: 50000, scale: 4 }
