[Killed] BlockStatement
src/core/api/transformScale.ts:23:5
       TAmount,
       TCurrency
     >
-  ) {
-    const { amount, currency, scale } = dineroObject.toJSON();
-
-    const isLarger = greaterThanFn(newScale, scale);
-    const operation = isLarger ? calculator.multiply : divide;
-    const [a, b] = isLarger ? [newScale, scale] : [scale, newScale];
-    const base = computeBaseFn(currency.base);
-
-    const factor = calculator.power(base, calculator.subtract(a, b));
-
-    return dineroObject.create({
-      amount: operation(amount, factor, calculator),
-      currency,
-      scale: newScale,
-    });
-  };
+  ) {};
 }
 
killedBy: subtract number normalizes the result to the highest scale
statusReason: Cannot read properties of undefined (reading 'toJSON')

[Killed] ObjectLiteral
src/core/api/transformScale.ts:33:32
 
     const factor = calculator.power(base, calculator.subtract(a, b));
 
-    return dineroObject.create({
-      amount: operation(amount, factor, calculator),
-      currency,
-      scale: newScale,
-    });
+    return dineroObject.create({});
   };
 }
killedBy: minimum number returns the greatest from a set of Dinero objects after normalization
statusReason: Cannot read properties of undefined (reading 'code')
