[Killed] BlockStatement
src/core/api/trimScale.ts:11:75
   TCurrency extends string = string,
 > = readonly [dineroObject: Dinero<TAmount, TCurrency>];
 
-export function trimScale<TAmount>(calculator: DineroCalculator<TAmount>) {
-  const countTrailingZerosFn = countTrailingZeros(calculator);
-  const equalFn = equal(calculator);
-  const maximumFn = maximum(calculator);
-  const transformScaleFn = transformScale(calculator);
-  const computeBaseFn = computeBase(calculator);
-
-  return function trimScaleFn<TCurrency extends string>(
-    ...[dineroObject]: TrimScaleParams<TAmount, TCurrency>
-  ) {
-    const { amount, currency, scale } = dineroObject.toJSON();
-    const base = computeBaseFn(currency.base);
-
-    const trailingZerosLength = countTrailingZerosFn(amount, base);
-    const difference = calculator.subtract(scale, trailingZerosLength);
-    const newScale = maximumFn([difference, currency.exponent]);
-
-    if (equalFn(newScale, scale)) {
-      return dineroObject;
-    }
-
-    return transformScaleFn(dineroObject, newScale);
-  };
-}
+export function trimScale<TAmount>(calculator: DineroCalculator<TAmount>) {}
 
killedBy: trimScale number trims a Dinero object down to its currency exponent's scale
statusReason: trimScaleFn is not a function

[Killed] BlockStatement
src/core/api/trimScale.ts:20:5
 
   return function trimScaleFn<TCurrency extends string>(
     ...[dineroObject]: TrimScaleParams<TAmount, TCurrency>
-  ) {
-    const { amount, currency, scale } = dineroObject.toJSON();
-    const base = computeBaseFn(currency.base);
-
-    const trailingZerosLength = countTrailingZerosFn(amount, base);
-    const difference = calculator.subtract(scale, trailingZerosLength);
-    const newScale = maximumFn([difference, currency.exponent]);
-
-    if (equalFn(newScale, scale)) {
-      return dineroObject;
-    }
-
-    return transformScaleFn(dineroObject, newScale);
-  };
+  ) {};
 }
 
killedBy: trimScale number trims a Dinero object down to its currency exponent's scale
statusReason: Cannot read properties of undefined (reading 'toJSON')

[Killed] ConditionalExpression
src/core/api/trimScale.ts:28:9
     const difference = calculator.subtract(scale, trailingZerosLength);
     const newScale = maximumFn([difference, currency.exponent]);
 
-    if (equalFn(newScale, scale)) {
+    if (true) {
       return dineroObject;
     }
killedBy: trimScale number trims a Dinero object down to its currency exponent's scale
statusReason: expected { amount: 500000, …(2) } to match object { amount: 500, scale: 2 }
(4 matching properties omitted from actual)

[Survived] ConditionalExpression
src/core/api/trimScale.ts:28:9
     const difference = calculator.subtract(scale, trailingZerosLength);
     const newScale = maximumFn([difference, currency.exponent]);
 
-    if (equalFn(newScale, scale)) {
+    if (false) {
       return dineroObject;
     }
