[Killed] BlockStatement
src/core/divide/down.ts:15:76
  *
  * @returns The rounded amount.
  */
-export const down: DineroDivideOperation = (amount, factor, calculator) => {
-  const greaterThanFn = greaterThan(calculator);
-  const equalFn = equal(calculator);
-
-  const zero = calculator.zero();
-  const isPositive = greaterThanFn(amount, zero);
-  const quotient = calculator.integerDivide(amount, factor);
-  const remainder = calculator.modulo(amount, factor);
-  const isInteger = equalFn(remainder, zero);
-
-  if (isPositive || isInteger) {
-    return quotient;
-  }
-
-  return calculator.decrement(quotient);
-};
+export const down: DineroDivideOperation = (amount, factor, calculator) => {};
 
killedBy: trimScale number trims a Dinero object down to its currency exponent's scale
statusReason: [Dinero.js] Amount is invalid.

[Killed] ConditionalExpression
src/core/divide/down.ts:25:7
   const remainder = calculator.modulo(amount, factor);
   const isInteger = equalFn(remainder, zero);
 
-  if (isPositive || isInteger) {
+  if (false) {
     return quotient;
   }
killedBy: allocate number decimal currencies allocates to percentages
statusReason: expected { amount: 501, …(2) } to deeply equal { amount: 502, …(2) }

[Killed] BlockStatement
src/core/divide/down.ts:25:32
   const remainder = calculator.modulo(amount, factor);
   const isInteger = equalFn(remainder, zero);
 
-  if (isPositive || isInteger) {
-    return quotient;
-  }
+  if (isPositive || isInteger) {}
 
   return calculator.decrement(quotient);
killedBy: trimScale number trims a Dinero object down to its currency exponent's scale
statusReason: expected { amount: 499, …(2) } to match object { amount: 500, scale: 2 }
(4 matching properties omitted from actual)
