[Killed] BlockStatement
src/core/divide/halfAwayFromZero.ts:20:6
   amount,
   factor,
   calculator
-) => {
-  const signFn = sign(calculator);
-  const isHalfFn = isHalf(calculator);
-  const absoluteFn = absolute(calculator);
-
-  if (!isHalfFn(amount, factor)) {
-    return halfUp(amount, factor, calculator);
-  }
-
-  return calculator.multiply(
-    signFn(amount),
-    up(absoluteFn(amount), factor, calculator)
-  );
-};
+) => {};
 
killedBy: transformScale number decimal currencies uses the provided `halfAwayFromZero` divide function
statusReason: [Dinero.js] Amount is invalid.

[Killed] BooleanLiteral
src/core/divide/halfAwayFromZero.ts:25:7
   const isHalfFn = isHalf(calculator);
   const absoluteFn = absolute(calculator);
 
-  if (!isHalfFn(amount, factor)) {
+  if (isHalfFn(amount, factor)) {
     return halfUp(amount, factor, calculator);
   }
killedBy: halfAwayFromZero decimal factors rounds to the nearest integer away from zero with a negative half quotient
statusReason: expected -2 to be -3 // Object.is equality

[Killed] ConditionalExpression
src/core/divide/halfAwayFromZero.ts:25:7
   const isHalfFn = isHalf(calculator);
   const absoluteFn = absolute(calculator);
 
-  if (!isHalfFn(amount, factor)) {
+  if (true) {
     return halfUp(amount, factor, calculator);
   }
killedBy: halfAwayFromZero decimal factors rounds to the nearest integer away from zero with a negative half quotient
statusReason: expected -2 to be -3 // Object.is equality
