[Killed] BlockStatement
src/core/divide/halfDown.ts:21:80
  *
  * @returns The rounded amount.
  */
-export const halfDown: DineroDivideOperation = (amount, factor, calculator) => {
-  const isHalfFn = isHalf(calculator);
-
-  if (isHalfFn(amount, factor)) {
-    return down(amount, factor, calculator);
-  }
-
-  return halfUp(amount, factor, calculator);
-};
+export const halfDown: DineroDivideOperation = (amount, factor, calculator) => {};
 
killedBy: transformScale number decimal currencies uses the provided `halfDown` divide function
statusReason: [Dinero.js] Amount is invalid.

[Killed] ConditionalExpression
src/core/divide/halfDown.ts:24:7
 export const halfDown: DineroDivideOperation = (amount, factor, calculator) => {
   const isHalfFn = isHalf(calculator);
 
-  if (isHalfFn(amount, factor)) {
+  if (false) {
     return down(amount, factor, calculator);
   }
killedBy: transformScale number decimal currencies uses the provided `halfDown` divide function
statusReason: expected { amount: 1046, …(2) } to match object { amount: 1045, scale: 2 }
(4 matching properties omitted from actual)

[Killed] BlockStatement
src/core/divide/halfDown.ts:24:33
 export const halfDown: DineroDivideOperation = (amount, factor, calculator) => {
   const isHalfFn = isHalf(calculator);
 
-  if (isHalfFn(amount, factor)) {
-    return down(amount, factor, calculator);
-  }
+  if (isHalfFn(amount, factor)) {}
 
   return halfUp(amount, factor, calculator);
killedBy: halfDown decimal factors rounds down with a positive half quotient
statusReason: expected 2 to be 1 // Object.is equality
