[Killed] BlockStatement
src/core/divide/halfEven.ts:16:80
  *
  * @returns The rounded amount.
  */
-export const halfEven: DineroDivideOperation = (amount, factor, calculator) => {
-  const isEvenFn = isEven(calculator);
-  const isHalfFn = isHalf(calculator);
-
-  const rounded = halfUp(amount, factor, calculator);
-
-  if (!isHalfFn(amount, factor)) {
-    return rounded;
-  }
-
-  return isEvenFn(rounded) ? rounded : calculator.decrement(rounded);
-};
+export const halfEven: DineroDivideOperation = (amount, factor, calculator) => {};
 
killedBy: transformScale number decimal currencies uses the provided `halfEven` divide function
statusReason: [Dinero.js] Amount is invalid.

[Killed] ConditionalExpression
src/core/divide/halfEven.ts:22:7
 
   const rounded = halfUp(amount, factor, calculator);
 
-  if (!isHalfFn(amount, factor)) {
+  if (false) {
     return rounded;
   }
killedBy: halfEven decimal factors rounds up with any positive float quotient above half
statusReason: Property failed after 1 tests
{ seed: 2082966971, path: "0", endOnFailure: true }
Counterexample: [6]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
