[Killed] BlockStatement
src/core/divide/halfOdd.ts:16:79
  *
  * @returns The rounded amount.
  */
-export const halfOdd: DineroDivideOperation = (amount, factor, calculator) => {
-  const isEvenFn = isEven(calculator);
-  const isHalfFn = isHalf(calculator);
-
-  const rounded = halfUp(amount, factor, calculator);
-
-  if (!isHalfFn(amount, factor)) {
-    return rounded;
-  }
-
-  return isEvenFn(rounded) ? calculator.decrement(rounded) : rounded;
-};
+export const halfOdd: DineroDivideOperation = (amount, factor, calculator) => {};
 
killedBy: transformScale number decimal currencies uses the provided `halfOdd` divide function
statusReason: [Dinero.js] Amount is invalid.
