[Killed] BlockStatement
src/core/divide/halfTowardsZero.ts:20:6
   amount,
   factor,
   calculator
-) => {
-  const signFn = sign(calculator);
-  const isHalfFn = isHalf(calculator);
-  const absoluteFn = absolute(calculator);
-
-  if (!isHalfFn(amount, factor)) {
-    return halfUp(amount, factor, calculator);
-  }
-
-  return calculator.multiply(
-    signFn(amount),
-    down(absoluteFn(amount), factor, calculator)
-  );
-};
+) => {};
 
killedBy: halfTowardsZero decimal factors does not round with a positive integer quotient
statusReason: expected undefined to be 2 // Object.is equality
