[Killed] BlockStatement
src/core/divide/halfUp.ts:21:78
  *
  * @returns The rounded amount.
  */
-export const halfUp: DineroDivideOperation = (amount, factor, calculator) => {
-  const greaterThanFn = greaterThan(calculator);
-  const isHalfFn = isHalf(calculator);
-  const absoluteFn = absolute(calculator);
-
-  const zero = calculator.zero();
-  const remainder = absoluteFn(calculator.modulo(amount, factor));
-  const difference = calculator.subtract(factor, remainder);
-  const isLessThanHalf = greaterThanFn(difference, remainder);
-  const isPositive = greaterThanFn(amount, zero);
-
-  if (
-    isHalfFn(amount, factor) ||
-    (isPositive && !isLessThanHalf) ||
-    (!isPositive && isLessThanHalf)
-  ) {
-    return up(amount, factor, calculator);
-  }
-
-  return down(amount, factor, calculator);
-};
+export const halfUp: DineroDivideOperation = (amount, factor, calculator) => {};
 
killedBy: transformScale number decimal currencies uses the provided `halfOdd` divide function
statusReason: [Dinero.js] Amount is invalid.

[Killed] LogicalOperator
src/core/divide/halfUp.ts:33:5
   const isPositive = greaterThanFn(amount, zero);
 
   if (
-    isHalfFn(amount, factor) ||
-    (isPositive && !isLessThanHalf) ||
-    (!isPositive && isLessThanHalf)
+    (isHalfFn(amount, factor) || isPositive && !isLessThanHalf) && !isPositive && isLessThanHalf
   ) {
     return up(amount, factor, calculator);
killedBy: halfAwayFromZero decimal factors rounds up with any positive float quotient above half
statusReason: Property failed after 1 tests
{ seed: 286879249, path: "0", endOnFailure: true }
Counterexample: [6]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
src/core/divide/halfUp.ts:33:5
   const isPositive = greaterThanFn(amount, zero);
 
   if (
-    isHalfFn(amount, factor) ||
-    (isPositive && !isLessThanHalf) ||
+    isHalfFn(amount, factor) && isPositive && !isLessThanHalf ||
     (!isPositive && isLessThanHalf)
   ) {
killedBy: halfDown decimal factors rounds up with any positive float quotient above half
statusReason: Property failed after 1 tests
{ seed: -1873111315, path: "0:0", endOnFailure: true }
Counterexample: [6]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
src/core/divide/halfUp.ts:34:6
 
   if (
     isHalfFn(amount, factor) ||
-    (isPositive && !isLessThanHalf) ||
+    (isPositive || !isLessThanHalf) ||
     (!isPositive && isLessThanHalf)
   ) {
killedBy: halfTowardsZero decimal factors rounds down with any negative quotient above half
statusReason: Property failed after 1 tests
{ seed: 1702596389, path: "0:0", endOnFailure: true }
Counterexample: [-6]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/core/divide/halfUp.ts:34:6
 
   if (
     isHalfFn(amount, factor) ||
-    (isPositive && !isLessThanHalf) ||
+    (false) ||
     (!isPositive && isLessThanHalf)
   ) {
killedBy: transformScale number decimal currencies uses the provided `halfDown` divide function
statusReason: expected { amount: 1045, …(2) } to match object { amount: 1046, scale: 2 }
(4 matching properties omitted from actual)

[Killed] ConditionalExpression
src/core/divide/halfUp.ts:35:6
   if (
     isHalfFn(amount, factor) ||
     (isPositive && !isLessThanHalf) ||
-    (!isPositive && isLessThanHalf)
+    (false)
   ) {
     return up(amount, factor, calculator);
killedBy: halfDown decimal factors rounds up with any negative quotient below half
statusReason: Property failed after 1 tests
{ seed: -330709069, path: "0:0", endOnFailure: true }
Counterexample: [-1]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
src/core/divide/halfUp.ts:35:6
   if (
     isHalfFn(amount, factor) ||
     (isPositive && !isLessThanHalf) ||
-    (!isPositive && isLessThanHalf)
+    (isPositive && isLessThanHalf)
   ) {
     return up(amount, factor, calculator);
killedBy: halfEven decimal factors rounds down with any positive float quotient below half
statusReason: Property failed after 1 tests
{ seed: -484239254, path: "0", endOnFailure: true }
Counterexample: [1]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/core/divide/halfUp.ts:36:5
     isHalfFn(amount, factor) ||
     (isPositive && !isLessThanHalf) ||
     (!isPositive && isLessThanHalf)
-  ) {
-    return up(amount, factor, calculator);
-  }
+  ) {}
 
   return down(amount, factor, calculator);
killedBy: halfTowardsZero decimal factors rounds up with any positive float quotient above half
statusReason: Property failed after 1 tests
{ seed: 1383459563, path: "0:0", endOnFailure: true }
Counterexample: [6]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
