[Killed] BlockStatement
src/core/divide/up.ts:15:74
  *
  * @returns The rounded amount.
  */
-export const up: DineroDivideOperation = (amount, factor, calculator) => {
-  const greaterThanFn = greaterThan(calculator);
-  const equalFn = equal(calculator);
-
-  const zero = calculator.zero();
-  const isPositive = greaterThanFn(amount, zero);
-  const quotient = calculator.integerDivide(amount, factor);
-  const remainder = calculator.modulo(amount, factor);
-  const isInteger = equalFn(remainder, zero);
-
-  if (!isInteger && isPositive) {
-    return calculator.increment(quotient);
-  }
-
-  return quotient;
-};
+export const up: DineroDivideOperation = (amount, factor, calculator) => {};
 
killedBy: halfDown decimal factors does not round with a negative integer quotient
statusReason: expected undefined to be -2 // Object.is equality

[Killed] BooleanLiteral
src/core/divide/up.ts:25:7
   const remainder = calculator.modulo(amount, factor);
   const isInteger = equalFn(remainder, zero);
 
-  if (!isInteger && isPositive) {
+  if (isInteger && isPositive) {
     return calculator.increment(quotient);
   }
killedBy: transformScale number decimal currencies uses the provided `up` divide function
statusReason: expected { amount: 1045, …(2) } to match object { amount: 1046, scale: 2 }
(4 matching properties omitted from actual)

[Killed] ConditionalExpression
src/core/divide/up.ts:25:7
   const remainder = calculator.modulo(amount, factor);
   const isInteger = equalFn(remainder, zero);
 
-  if (!isInteger && isPositive) {
+  if (false) {
     return calculator.increment(quotient);
   }
killedBy: halfEven decimal factors rounds to nearest even integer with a positive half quotient rounding to an even integer
statusReason: expected +0 to be 2 // Object.is equality
