[Killed] BlockStatement
src/core/utils/absolute.ts:6:74
 import { equal } from './equal';
 import { lessThan } from './lessThan';
 
-export function absolute<TAmount>(calculator: DineroCalculator<TAmount>) {
-  const equalFn = equal(calculator);
-  const lessThanFn = lessThan(calculator);
-  const zero = calculator.zero();
-
-  return (input: TAmount) => {
-    if (equalFn(input, zero)) {
-      return zero;
-    }
-
-    if (lessThanFn(input, zero)) {
-      const minusOne = calculator.decrement(zero);
-
-      return calculator.multiply(minusOne, input);
-    }
-
-    return input;
-  };
-}
+export function absolute<TAmount>(calculator: DineroCalculator<TAmount>) {}
 
killedBy: halfEven decimal factors does not round with a positive integer quotient
statusReason: absoluteFn is not a function

[Killed] BlockStatement
src/core/utils/absolute.ts:11:30
   const lessThanFn = lessThan(calculator);
   const zero = calculator.zero();
 
-  return (input: TAmount) => {
-    if (equalFn(input, zero)) {
-      return zero;
-    }
-
-    if (lessThanFn(input, zero)) {
-      const minusOne = calculator.decrement(zero);
-
-      return calculator.multiply(minusOne, input);
-    }
-
-    return input;
-  };
+  return (input: TAmount) => {};
 }
 
killedBy: halfDown decimal factors rounds up with any positive float quotient above half
statusReason: Property failed after 1 tests
{ seed: 1427236045, path: "0:0", endOnFailure: true }
Counterexample: [6]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/core/utils/absolute.ts:12:9
   const zero = calculator.zero();
 
   return (input: TAmount) => {
-    if (equalFn(input, zero)) {
+    if (false) {
       return zero;
     }
killedBy: absolute returns the negation of the value with negative zero
statusReason: expected -0 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/core/utils/absolute.ts:12:9
   const zero = calculator.zero();
 
   return (input: TAmount) => {
-    if (equalFn(input, zero)) {
+    if (true) {
       return zero;
     }
killedBy: halfDown decimal factors rounds down with a negative half quotient
statusReason: expected -1 to be -2 // Object.is equality

[Killed] ConditionalExpression
src/core/utils/absolute.ts:16:9
       return zero;
     }
 
-    if (lessThanFn(input, zero)) {
+    if (false) {
       const minusOne = calculator.decrement(zero);
 
killedBy: halfEven decimal factors rounds down with any negative quotient above half
statusReason: Property failed after 1 tests
{ seed: 1881153257, path: "0", endOnFailure: true }
Counterexample: [-6]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/core/utils/absolute.ts:16:9
       return zero;
     }
 
-    if (lessThanFn(input, zero)) {
+    if (true) {
       const minusOne = calculator.decrement(zero);
 
killedBy: halfEven decimal factors rounds to nearest even integer with a positive half quotient rounding to an even integer
statusReason: expected 1 to be 2 // Object.is equality
