[Killed] BlockStatement
src/core/utils/compare.ts:12:77
  *
  * @returns The compare function.
  */
-export function compare<TAmount>(calculator: ComparisonCalculator<TAmount>) {
-  return (subject: TAmount, comparator: TAmount) => {
-    return calculator.compare(subject, comparator);
-  };
-}
+export function compare<TAmount>(calculator: ComparisonCalculator<TAmount>) {}
 
killedBy: compare number decimal currencies returns -1 when the first amount is less than the other
statusReason: compareFn is not a function

[Killed] BlockStatement
src/core/utils/compare.ts:13:53
  * @returns The compare function.
  */
 export function compare<TAmount>(calculator: ComparisonCalculator<TAmount>) {
-  return (subject: TAmount, comparator: TAmount) => {
-    return calculator.compare(subject, comparator);
-  };
+  return (subject: TAmount, comparator: TAmount) => {};
 }
 
killedBy: compare number decimal currencies returns -1 when the first amount is less than the other
statusReason: expected undefined to be -1 // Object.is equality
