[Killed] BlockStatement
src/core/utils/computeBase.ts:5:77
 
 import { isArray } from './isArray';
 
-export function computeBase<TAmount>(calculator: DineroCalculator<TAmount>) {
-  return (base: TAmount | readonly TAmount[]) => {
-    if (isArray(base)) {
-      return base.reduce((acc, curr) => calculator.multiply(acc, curr));
-    }
-
-    return base;
-  };
-}
+export function computeBase<TAmount>(calculator: DineroCalculator<TAmount>) {}
 
killedBy: lessThanOrEqual number returns true when the first amount is less than the other
statusReason: computeBaseFn is not a function

[Killed] BlockStatement
src/core/utils/computeBase.ts:6:50
 import { isArray } from './isArray';
 
 export function computeBase<TAmount>(calculator: DineroCalculator<TAmount>) {
-  return (base: TAmount | readonly TAmount[]) => {
-    if (isArray(base)) {
-      return base.reduce((acc, curr) => calculator.multiply(acc, curr));
-    }
-
-    return base;
-  };
+  return (base: TAmount | readonly TAmount[]) => {};
 }
 
killedBy: allocate number decimal currencies converts the allocated amounts to the safest scale
statusReason: [Dinero.js] Amount is invalid.

[Killed] BlockStatement
src/core/utils/computeBase.ts:7:24
 
 export function computeBase<TAmount>(calculator: DineroCalculator<TAmount>) {
   return (base: TAmount | readonly TAmount[]) => {
-    if (isArray(base)) {
-      return base.reduce((acc, curr) => calculator.multiply(acc, curr));
-    }
+    if (isArray(base)) {}
 
     return base;
killedBy: hasSubUnits number non-decimal currencies returns true when there are sub-units based on a multi-base
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/utils/computeBase.ts:7:9
 
 export function computeBase<TAmount>(calculator: DineroCalculator<TAmount>) {
   return (base: TAmount | readonly TAmount[]) => {
-    if (isArray(base)) {
+    if (true) {
       return base.reduce((acc, curr) => calculator.multiply(acc, curr));
     }
killedBy: trimScale number trims a Dinero object down to its currency exponent's scale
statusReason: base.reduce is not a function

[Killed] ArrowFunction
src/core/utils/computeBase.ts:8:26
 export function computeBase<TAmount>(calculator: DineroCalculator<TAmount>) {
   return (base: TAmount | readonly TAmount[]) => {
     if (isArray(base)) {
-      return base.reduce((acc, curr) => calculator.multiply(acc, curr));
+      return base.reduce(() => undefined);
     }
 
killedBy: toDecimal bigint non-decimal currencies throws when passing a Dinero object using a multi-base currency which compiles to a multiple of 10
statusReason: Snapshot `toDecimal > bigint > non-decimal currencies > throws when passing a Dinero object using a multi-base currency which compiles to a multiple of 10 1` mismatched
