[Killed] BlockStatement
src/core/utils/countTrailingZeros.ts:9:3
 
 export function countTrailingZeros<TAmount>(
   calculator: CountTrailingZerosCalculator<TAmount>
-) {
-  const equalFn = equal(calculator);
-
-  return (input: TAmount, base: TAmount) => {
-    const zero = calculator.zero();
-
-    if (equalFn(zero, input)) {
-      return calculator.zero();
-    }
-
-    let i = zero;
-    let temp = input;
-
-    while (equalFn(calculator.modulo(temp, base), zero)) {
-      temp = calculator.integerDivide(temp, base);
-      i = calculator.increment(i);
-    }
-
-    return i;
-  };
-}
+) {}
 
killedBy: trimScale number trims a Dinero object down to its currency exponent's scale
statusReason: countTrailingZerosFn is not a function

[Killed] BlockStatement
src/core/utils/countTrailingZeros.ts:12:45
 ) {
   const equalFn = equal(calculator);
 
-  return (input: TAmount, base: TAmount) => {
-    const zero = calculator.zero();
-
-    if (equalFn(zero, input)) {
-      return calculator.zero();
-    }
-
-    let i = zero;
-    let temp = input;
-
-    while (equalFn(calculator.modulo(temp, base), zero)) {
-      temp = calculator.integerDivide(temp, base);
-      i = calculator.increment(i);
-    }
-
-    return i;
-  };
+  return (input: TAmount, base: TAmount) => {};
 }
 
killedBy: trimScale number trims a Dinero object down to its currency exponent's scale
statusReason: expected { amount: 500000, …(2) } to match object { amount: 500, scale: 2 }
(4 matching properties omitted from actual)

[Killed] ConditionalExpression
src/core/utils/countTrailingZeros.ts:15:9
   return (input: TAmount, base: TAmount) => {
     const zero = calculator.zero();
 
-    if (equalFn(zero, input)) {
+    if (true) {
       return calculator.zero();
     }
killedBy: trimScale number trims a Dinero object down to its currency exponent's scale
statusReason: expected { amount: 500000, …(2) } to match object { amount: 500, scale: 2 }
(4 matching properties omitted from actual)

[Timeout] BlockStatement
src/core/utils/countTrailingZeros.ts:15:31
   return (input: TAmount, base: TAmount) => {
     const zero = calculator.zero();
 
-    if (equalFn(zero, input)) {
-      return calculator.zero();
-    }
+    if (equalFn(zero, input)) {}
 
     let i = zero;

[Killed] ConditionalExpression
src/core/utils/countTrailingZeros.ts:22:12
     let i = zero;
     let temp = input;
 
-    while (equalFn(calculator.modulo(temp, base), zero)) {
+    while (false) {
       temp = calculator.integerDivide(temp, base);
       i = calculator.increment(i);
killedBy: trimScale number trims a Dinero object down to its currency exponent's scale
statusReason: expected { amount: 500000, …(2) } to match object { amount: 500, scale: 2 }
(4 matching properties omitted from actual)

[Timeout] BlockStatement
src/core/utils/countTrailingZeros.ts:22:58
     let i = zero;
     let temp = input;
 
-    while (equalFn(calculator.modulo(temp, base), zero)) {
-      temp = calculator.integerDivide(temp, base);
-      i = calculator.increment(i);
-    }
+    while (equalFn(calculator.modulo(temp, base), zero)) {}
 
     return i;
