[Killed] ArrowFunction
src/core/utils/distribute.ts:27:33
     const zero = calculator.zero();
     const one = calculator.increment(zero);
 
-    const total = ratios.reduce((a, b) => calculator.add(a, b), zero);
+    const total = ratios.reduce(() => undefined, zero);
 
     if (equalFn(total, zero)) {
killedBy: allocate number decimal currencies allocates to percentages
statusReason: expected { Object (amount, currency, ...) } to deeply equal { amount: 502, …(2) }

[Killed] BlockStatement
src/core/utils/distribute.ts:29:31
 
     const total = ratios.reduce((a, b) => calculator.add(a, b), zero);
 
-    if (equalFn(total, zero)) {
-      return ratios;
-    }
+    if (equalFn(total, zero)) {}
 
     let remainder = value;
killedBy: distribute distributes to zero ratios
statusReason: expected [ +0, +0, undefined: NaN ] to deeply equal [ +0, +0 ]

[Killed] ConditionalExpression
src/core/utils/distribute.ts:29:9
 
     const total = ratios.reduce((a, b) => calculator.add(a, b), zero);
 
-    if (equalFn(total, zero)) {
+    if (true) {
       return ratios;
     }
killedBy: allocate number decimal currencies allocates to percentages
statusReason: expected { Object (amount, currency, ...) } to deeply equal { amount: 502, …(2) }

[Killed] BlockStatement
src/core/utils/distribute.ts:35:42
 
     let remainder = value;
 
-    const shares = ratios.map((ratio) => {
-      const share =
-        calculator.integerDivide(calculator.multiply(value, ratio), total) ||
-        zero;
-
-      remainder = calculator.subtract(remainder, share);
-
-      return share;
-    });
+    const shares = ratios.map((ratio) => {});
 
     const isPositive = greaterThanOrEqualFn(value, zero);
killedBy: allocate number decimal currencies allocates to percentages
statusReason: [Dinero.js] Amount is invalid.

[Killed] LogicalOperator
src/core/utils/distribute.ts:37:9
 
     const shares = ratios.map((ratio) => {
       const share =
-        calculator.integerDivide(calculator.multiply(value, ratio), total) ||
-        zero;
+        calculator.integerDivide(calculator.multiply(value, ratio), total) && zero;
 
       remainder = calculator.subtract(remainder, share);
killedBy: distribute distributes to ratios
statusReason: expected [ 50, 50 ] to deeply equal [ 25, 75 ]

[Killed] ConditionalExpression
src/core/utils/distribute.ts:37:9
 
     const shares = ratios.map((ratio) => {
       const share =
-        calculator.integerDivide(calculator.multiply(value, ratio), total) ||
-        zero;
+        false;
 
       remainder = calculator.subtract(remainder, share);
killedBy: distribute distributes to ratios
statusReason: expected [ 50, 50 ] to deeply equal [ 25, 75 ]

[Killed] MethodExpression
src/core/utils/distribute.ts:51:27
 
     // Create indices sorted by descending ratio for remainder distribution
     // Indices with larger ratios receive remainder first
-    const sortedIndices = ratios
-      .map((ratio, index) => ({ ratio, index }))
-      .filter(({ ratio }) => !equalFn(ratio, zero))
-      .sort((a, b) => (greaterThanFn(a.ratio, b.ratio) ? -1 : 1))
+    const sortedIndices = ratios.map((ratio, index) => ({
+  ratio,
+  index
+})).filter(({
+  ratio
+}) => !equalFn(ratio, zero))
       .map(({ index }) => index);
 
killedBy: allocate number non-decimal currencies allocates to ratios
statusReason: expected { amount: 2, currency: { …(3) }, …(1) } to deeply equal { amount: 1, currency: { …(3) }, …(1) }

[Survived] MethodExpression
src/core/utils/distribute.ts:51:27
 
     // Create indices sorted by descending ratio for remainder distribution
     // Indices with larger ratios receive remainder first
-    const sortedIndices = ratios
-      .map((ratio, index) => ({ ratio, index }))
-      .filter(({ ratio }) => !equalFn(ratio, zero))
+    const sortedIndices = ratios.map((ratio, index) => ({
+  ratio,
+  index
+}))
       .sort((a, b) => (greaterThanFn(a.ratio, b.ratio) ? -1 : 1))
       .map(({ index }) => index);

[Killed] ArrowFunction
src/core/utils/distribute.ts:52:12
     // Create indices sorted by descending ratio for remainder distribution
     // Indices with larger ratios receive remainder first
     const sortedIndices = ratios
-      .map((ratio, index) => ({ ratio, index }))
+      .map(() => undefined)
       .filter(({ ratio }) => !equalFn(ratio, zero))
       .sort((a, b) => (greaterThanFn(a.ratio, b.ratio) ? -1 : 1))
killedBy: allocate number decimal currencies allocates to percentages
statusReason: Cannot destructure property 'ratio' of 'undefined' as it is undefined.

[Killed] BooleanLiteral
src/core/utils/distribute.ts:53:30
     // Indices with larger ratios receive remainder first
     const sortedIndices = ratios
       .map((ratio, index) => ({ ratio, index }))
-      .filter(({ ratio }) => !equalFn(ratio, zero))
+      .filter(({ ratio }) => equalFn(ratio, zero))
       .sort((a, b) => (greaterThanFn(a.ratio, b.ratio) ? -1 : 1))
       .map(({ index }) => index);
killedBy: distribute distributes to percentages
statusReason: expected [ 501, 501, undefined: NaN ] to deeply equal [ 502, 501 ]

[Killed] ArrowFunction
src/core/utils/distribute.ts:53:15
     // Indices with larger ratios receive remainder first
     const sortedIndices = ratios
       .map((ratio, index) => ({ ratio, index }))
-      .filter(({ ratio }) => !equalFn(ratio, zero))
+      .filter(() => undefined)
       .sort((a, b) => (greaterThanFn(a.ratio, b.ratio) ? -1 : 1))
       .map(({ index }) => index);
killedBy: allocate number decimal currencies allocates to percentages
statusReason: expected { amount: 501, …(2) } to deeply equal { amount: 502, …(2) }

[Killed] UnaryOperator
src/core/utils/distribute.ts:54:58
     const sortedIndices = ratios
       .map((ratio, index) => ({ ratio, index }))
       .filter(({ ratio }) => !equalFn(ratio, zero))
-      .sort((a, b) => (greaterThanFn(a.ratio, b.ratio) ? -1 : 1))
+      .sort((a, b) => (greaterThanFn(a.ratio, b.ratio) ? +1 : 1))
       .map(({ index }) => index);
 
killedBy: distribute distributes remainder to largest ratio first
statusReason: expected [ 2, 1, 1, 1 ] to deeply equal [ 1, 2, 1, 1 ]

[Killed] ArrowFunction
src/core/utils/distribute.ts:54:13
     const sortedIndices = ratios
       .map((ratio, index) => ({ ratio, index }))
       .filter(({ ratio }) => !equalFn(ratio, zero))
-      .sort((a, b) => (greaterThanFn(a.ratio, b.ratio) ? -1 : 1))
+      .sort(() => undefined)
       .map(({ index }) => index);
 
killedBy: allocate number non-decimal currencies allocates to ratios
statusReason: expected { amount: 2, currency: { …(3) }, …(1) } to deeply equal { amount: 1, currency: { …(3) }, …(1) }

[Killed] ArrowFunction
src/core/utils/distribute.ts:55:12
       .map((ratio, index) => ({ ratio, index }))
       .filter(({ ratio }) => !equalFn(ratio, zero))
       .sort((a, b) => (greaterThanFn(a.ratio, b.ratio) ? -1 : 1))
-      .map(({ index }) => index);
+      .map(() => undefined);
 
     let i = 0;
killedBy: distribute distributes to percentages
statusReason: expected [ 501, 501, undefined: NaN ] to deeply equal [ 502, 501 ]

[Killed] ConditionalExpression
src/core/utils/distribute.ts:59:12
 
     let i = 0;
 
-    while (compare(remainder, zero)) {
+    while (false) {
       const index = sortedIndices[i % sortedIndices.length];
       shares[index] = calculator.add(shares[index], amount);
killedBy: allocate number decimal currencies allocates to percentages
statusReason: expected { amount: 501, …(2) } to deeply equal { amount: 502, …(2) }

[Timeout] BlockStatement
src/core/utils/distribute.ts:59:38
 
     let i = 0;
 
-    while (compare(remainder, zero)) {
-      const index = sortedIndices[i % sortedIndices.length];
-      shares[index] = calculator.add(shares[index], amount);
-
-      const newRemainder = calculator.subtract(remainder, amount);
-
-      // Guard against infinite loop due to floating-point precision loss.
-      // When using the number calculator with amounts larger than
-      // Number.MAX_SAFE_INTEGER, subtraction may have no effect.
-      if (equalFn(newRemainder, remainder)) {
-        break;
-      }
-
-      remainder = newRemainder;
-      i++;
-    }
+    while (compare(remainder, zero)) {}
 
     return shares;

[Killed] ArithmeticOperator
src/core/utils/distribute.ts:60:35
     let i = 0;
 
     while (compare(remainder, zero)) {
-      const index = sortedIndices[i % sortedIndices.length];
+      const index = sortedIndices[i * sortedIndices.length];
       shares[index] = calculator.add(shares[index], amount);
 
killedBy: allocate properties preserves the total: sum of shares equals the original amount
statusReason: Property failed after 2 tests
{ seed: -2143780352, path: "1:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:2:1:3:2:3:7:2:2:2:5:11:2:3:2:2:6:6:4:2", endOnFailure: true }
Counterexample: [2,[1,55,55]]
Shrunk 35 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/core/utils/distribute.ts:68:11
       // Guard against infinite loop due to floating-point precision loss.
       // When using the number calculator with amounts larger than
       // Number.MAX_SAFE_INTEGER, subtraction may have no effect.
-      if (equalFn(newRemainder, remainder)) {
+      if (true) {
         break;
       }
killedBy: distribute properties preserves the total: sum of shares equals the input
statusReason: Property failed after 2 tests
{ seed: 1739903626, path: "1:3:0:0:1:0:0:3:0:1:0:1:0:1:3:0:0:0:3:0:5:0:0:0:2:0:0:3:0:0:0:2:0:3:0:0:0:2:3:0:0:0:5:2:3:0:4", endOnFailure: true }
Counterexample: [-3,[1,1,2]]
Shrunk 46 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Timeout] ConditionalExpression
src/core/utils/distribute.ts:68:11
       // Guard against infinite loop due to floating-point precision loss.
       // When using the number calculator with amounts larger than
       // Number.MAX_SAFE_INTEGER, subtraction may have no effect.
-      if (equalFn(newRemainder, remainder)) {
+      if (false) {
         break;
       }

[Killed] UpdateOperator
src/core/utils/distribute.ts:73:7
       }
 
       remainder = newRemainder;
-      i++;
+      i--;
     }
 
killedBy: allocate properties preserves the total: sum of shares equals the original amount
statusReason: Property failed after 1 tests
{ seed: -1289810586, path: "0:1:1:0:0:1:0:1:0:0:1:1:0:3:0:2:0:1:0:2:0:0:0:0:0:3:4:4:3:0:0:1:0:0:0:0:0:1:0:0:0:0", endOnFailure: true }
Counterexample: [-125,[1,8,2]]
Shrunk 41 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
