[Killed] BlockStatement
src/core/utils/equal.ts:13:70
  *
  * @returns The equal function.
  */
-export function equal<TAmount>(calculator: EqualCalculator<TAmount>) {
-  return (subject: TAmount, comparator: TAmount) => {
-    return (
-      calculator.compare(subject, comparator) === DineroComparisonOperator.EQ
-    );
-  };
-}
+export function equal<TAmount>(calculator: EqualCalculator<TAmount>) {}
 
killedBy: compare number decimal currencies returns -1 when the first amount is less than the other
statusReason: equalFn is not a function

[Killed] BlockStatement
src/core/utils/equal.ts:14:53
  * @returns The equal function.
  */
 export function equal<TAmount>(calculator: EqualCalculator<TAmount>) {
-  return (subject: TAmount, comparator: TAmount) => {
-    return (
-      calculator.compare(subject, comparator) === DineroComparisonOperator.EQ
-    );
-  };
+  return (subject: TAmount, comparator: TAmount) => {};
 }
 
killedBy: allocate number decimal currencies ignores zero ratios
statusReason: [Dinero.js] Ratios are invalid.

[Killed] ConditionalExpression
src/core/utils/equal.ts:16:7
 export function equal<TAmount>(calculator: EqualCalculator<TAmount>) {
   return (subject: TAmount, comparator: TAmount) => {
     return (
-      calculator.compare(subject, comparator) === DineroComparisonOperator.EQ
+      false
     );
   };
killedBy: add number decimal currencies adds up positive Dinero objects
statusReason: [Dinero.js] Objects must have the same currency.

[Killed] ConditionalExpression
src/core/utils/equal.ts:16:7
 export function equal<TAmount>(calculator: EqualCalculator<TAmount>) {
   return (subject: TAmount, comparator: TAmount) => {
     return (
-      calculator.compare(subject, comparator) === DineroComparisonOperator.EQ
+      true
     );
   };
killedBy: distribute when the remainder loses precision returns three shares that still add up to the amount
statusReason: expected 3 to be 1e+33 // Object.is equality
