[Killed] BlockStatement
src/core/utils/getAmountAndScale.ts:8:3
 export function getAmountAndScale<TAmount>(
   value: DineroScaledAmount<TAmount> | TAmount,
   zero: TAmount
-) {
-  if (isScaledAmount(value)) {
-    return { amount: value.amount, scale: value?.scale ?? zero };
-  }
-
-  return { amount: value, scale: zero };
-}
+) {}
 
killedBy: allocate number decimal currencies allocates to percentages
statusReason: Cannot destructure property 'scale' of 'undefined' as it is undefined.

[Killed] BlockStatement
src/core/utils/getAmountAndScale.ts:9:30
   value: DineroScaledAmount<TAmount> | TAmount,
   zero: TAmount
 ) {
-  if (isScaledAmount(value)) {
-    return { amount: value.amount, scale: value?.scale ?? zero };
-  }
+  if (isScaledAmount(value)) {}
 
   return { amount: value, scale: zero };
killedBy: multiply number converts the multiplied amount to the safest scale
statusReason: [Dinero.js] Amount is invalid.

[Killed] ConditionalExpression
src/core/utils/getAmountAndScale.ts:9:7
   value: DineroScaledAmount<TAmount> | TAmount,
   zero: TAmount
 ) {
-  if (isScaledAmount(value)) {
+  if (false) {
     return { amount: value.amount, scale: value?.scale ?? zero };
   }
killedBy: allocate number decimal currencies converts the allocated amounts to the safest scale
statusReason: [Dinero.js] Ratios are invalid.

[Killed] LogicalOperator
src/core/utils/getAmountAndScale.ts:10:43
   zero: TAmount
 ) {
   if (isScaledAmount(value)) {
-    return { amount: value.amount, scale: value?.scale ?? zero };
+    return { amount: value.amount, scale: value?.scale && zero };
   }
 
killedBy: multiply number converts the multiplied amount to the safest scale
statusReason: expected { amount: 802401, …(2) } to deeply equal { amount: 802401, scale: 5, …(1) }

[Survived] OptionalChaining
src/core/utils/getAmountAndScale.ts:10:43
   zero: TAmount
 ) {
   if (isScaledAmount(value)) {
-    return { amount: value.amount, scale: value?.scale ?? zero };
+    return { amount: value.amount, scale: value.scale ?? zero };
   }
 
