[Killed] BlockStatement
src/core/utils/getDivisors.ts:3:77
 import type { DineroCalculator } from '../types';
 
-export function getDivisors<TAmount>(calculator: DineroCalculator<TAmount>) {
-  const { multiply } = calculator;
-
-  return (bases: readonly TAmount[]) => {
-    return bases.reduce<readonly TAmount[]>((divisors, _, i) => {
-      const divisor = bases.slice(i).reduce((acc, curr) => multiply(acc, curr));
-
-      return [...divisors, divisor];
-    }, []);
-  };
-}
+export function getDivisors<TAmount>(calculator: DineroCalculator<TAmount>) {}
 
killedBy: toDecimal number decimal currencies returns the amount in decimal format
statusReason: getDivisorsFn is not a function

[Killed] BlockStatement
src/core/utils/getDivisors.ts:6:41
 export function getDivisors<TAmount>(calculator: DineroCalculator<TAmount>) {
   const { multiply } = calculator;
 
-  return (bases: readonly TAmount[]) => {
-    return bases.reduce<readonly TAmount[]>((divisors, _, i) => {
-      const divisor = bases.slice(i).reduce((acc, curr) => multiply(acc, curr));
-
-      return [...divisors, divisor];
-    }, []);
-  };
+  return (bases: readonly TAmount[]) => {};
 }
 
killedBy: toUnits number decimal currencies returns the amount in currency units
statusReason: Cannot read properties of undefined (reading 'reduce')

[Killed] BlockStatement
src/core/utils/getDivisors.ts:7:65
   const { multiply } = calculator;
 
   return (bases: readonly TAmount[]) => {
-    return bases.reduce<readonly TAmount[]>((divisors, _, i) => {
-      const divisor = bases.slice(i).reduce((acc, curr) => multiply(acc, curr));
-
-      return [...divisors, divisor];
-    }, []);
+    return bases.reduce<readonly TAmount[]>((divisors, _, i) => {}, []);
   };
 }
killedBy: toUnits number decimal currencies returns the amount in currency units
statusReason: Cannot read properties of undefined (reading 'reduce')

[Killed] ArrowFunction
src/core/utils/getDivisors.ts:8:45
 
   return (bases: readonly TAmount[]) => {
     return bases.reduce<readonly TAmount[]>((divisors, _, i) => {
-      const divisor = bases.slice(i).reduce((acc, curr) => multiply(acc, curr));
+      const divisor = bases.slice(i).reduce(() => undefined);
 
       return [...divisors, divisor];
killedBy: toUnits number non-decimal currencies handles currencies with multiple subdivisions
statusReason: expected [ NaN, NaN, NaN ] to deeply equal [ 1, 2, 3 ]

[Killed] MethodExpression
src/core/utils/getDivisors.ts:8:23
 
   return (bases: readonly TAmount[]) => {
     return bases.reduce<readonly TAmount[]>((divisors, _, i) => {
-      const divisor = bases.slice(i).reduce((acc, curr) => multiply(acc, curr));
+      const divisor = bases.reduce((acc, curr) => multiply(acc, curr));
 
       return [...divisors, divisor];
killedBy: toUnits number non-decimal currencies handles currencies with multiple subdivisions
statusReason: expected [ 1, +0, 27 ] to deeply equal [ 1, 2, 3 ]

[Killed] ArrayDeclaration
src/core/utils/getDivisors.ts:11:8
       const divisor = bases.slice(i).reduce((acc, curr) => multiply(acc, curr));
 
       return [...divisors, divisor];
-    }, []);
+    }, ["Stryker was here"]);
   };
 }
killedBy: toUnits number decimal currencies returns the amount in currency units
statusReason: expected [ NaN, NaN, NaN ] to deeply equal [ 10, 50 ]
