[Killed] BlockStatement
src/core/utils/greaterThan.ts:15:3
  */
 export function greaterThan<TAmount>(
   calculator: GreaterThanCalculator<TAmount>
-) {
-  return (subject: TAmount, comparator: TAmount) => {
-    return (
-      calculator.compare(subject, comparator) === DineroComparisonOperator.GT
-    );
-  };
-}
+) {}
 
killedBy: allocate number decimal currencies allocates to percentages
statusReason: greaterThan(...) is not a function

[Killed] BlockStatement
src/core/utils/greaterThan.ts:16:53
 export function greaterThan<TAmount>(
   calculator: GreaterThanCalculator<TAmount>
 ) {
-  return (subject: TAmount, comparator: TAmount) => {
-    return (
-      calculator.compare(subject, comparator) === DineroComparisonOperator.GT
-    );
-  };
+  return (subject: TAmount, comparator: TAmount) => {};
 }
 
killedBy: halfEven decimal factors rounds to nearest even integer with a positive half quotient rounding to an even integer
statusReason: expected +0 to be 2 // Object.is equality

[Killed] EqualityOperator
src/core/utils/greaterThan.ts:18:7
 ) {
   return (subject: TAmount, comparator: TAmount) => {
     return (
-      calculator.compare(subject, comparator) === DineroComparisonOperator.GT
+      calculator.compare(subject, comparator) !== DineroComparisonOperator.GT
     );
   };
killedBy: add number decimal currencies normalizes the result to the highest scale
statusReason: expected { amount: 5999, …(2) } to deeply equal { amount: 6000, …(2) }

[Killed] ConditionalExpression
src/core/utils/greaterThan.ts:18:7
 ) {
   return (subject: TAmount, comparator: TAmount) => {
     return (
-      calculator.compare(subject, comparator) === DineroComparisonOperator.GT
+      true
     );
   };
killedBy: trimScale bigint trims a Dinero object down to its currency exponent's scale
statusReason: undefined must be positive
