[Killed] BlockStatement
src/core/utils/greaterThanOrEqual.ts:17:3
  */
 export function greaterThanOrEqual<TAmount>(
   calculator: GreaterThanOrEqualCalculator<TAmount>
-) {
-  return (subject: TAmount, comparator: TAmount) => {
-    return (
-      greaterThan(calculator)(subject, comparator) ||
-      equal(calculator)(subject, comparator)
-    );
-  };
-}
+) {}
 
killedBy: allocate number decimal currencies allocates to percentages
statusReason: greaterThanOrEqualFn is not a function

[Killed] BlockStatement
src/core/utils/greaterThanOrEqual.ts:18:53
 export function greaterThanOrEqual<TAmount>(
   calculator: GreaterThanOrEqualCalculator<TAmount>
 ) {
-  return (subject: TAmount, comparator: TAmount) => {
-    return (
-      greaterThan(calculator)(subject, comparator) ||
-      equal(calculator)(subject, comparator)
-    );
-  };
+  return (subject: TAmount, comparator: TAmount) => {};
 }
 
killedBy: greaterThanOrEqual number returns false when the first amount is less than the other
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
src/core/utils/greaterThanOrEqual.ts:20:7
 ) {
   return (subject: TAmount, comparator: TAmount) => {
     return (
-      greaterThan(calculator)(subject, comparator) ||
-      equal(calculator)(subject, comparator)
+      false
     );
   };
killedBy: greaterThanOrEqual number returns true when amounts are equal
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/core/utils/greaterThanOrEqual.ts:20:7
 ) {
   return (subject: TAmount, comparator: TAmount) => {
     return (
-      greaterThan(calculator)(subject, comparator) ||
-      equal(calculator)(subject, comparator)
+      greaterThan(calculator)(subject, comparator) && equal(calculator)(subject, comparator)
     );
   };
killedBy: distribute distributes to percentages
statusReason: expected [ 501, 501 ] to deeply equal [ 502, 501 ]
