[Killed] BlockStatement
src/core/utils/isEven.ts:5:72
 
 import { equal } from '.';
 
-export function isEven<TAmount>(calculator: DineroCalculator<TAmount>) {
-  const equalFn = equal(calculator);
-  const zero = calculator.zero();
-  const two = calculator.increment(calculator.increment(zero));
-
-  return (input: TAmount) => {
-    return equalFn(calculator.modulo(input, two), zero);
-  };
-}
+export function isEven<TAmount>(calculator: DineroCalculator<TAmount>) {}
 
killedBy: halfEven decimal factors rounds to nearest even integer with a positive half quotient rounding to an even integer
statusReason: isEvenFn is not a function

[Killed] BlockStatement
src/core/utils/isEven.ts:10:30
   const zero = calculator.zero();
   const two = calculator.increment(calculator.increment(zero));
 
-  return (input: TAmount) => {
-    return equalFn(calculator.modulo(input, two), zero);
-  };
+  return (input: TAmount) => {};
 }
 
killedBy: halfEven decimal factors rounds to nearest even integer with a positive half quotient rounding to an even integer
statusReason: expected 1 to be 2 // Object.is equality
