[Killed] BlockStatement
src/core/utils/isArray.ts:3:35
 export function isArray<TType>(
   maybeArray: TType | readonly TType[]
-): maybeArray is readonly TType[] {
-  return Array.isArray(maybeArray);
-}
+): maybeArray is readonly TType[] {}
 
killedBy: toUnits number non-decimal currencies handles currencies with multiple subdivisions
statusReason: expected [ NaN, NaN ] to deeply equal [ 1, 2, 3 ]
