[Killed] BlockStatement
src/core/utils/isHalf.ts:5:72
 
 import { equal, absolute } from '.';
 
-export function isHalf<TAmount>(calculator: DineroCalculator<TAmount>) {
-  const equalFn = equal(calculator);
-  const absoluteFn = absolute(calculator);
-
-  return (input: TAmount, total: TAmount) => {
-    const remainder = absoluteFn(calculator.modulo(input, total));
-    const difference = calculator.subtract(total, remainder);
-
-    return equalFn(difference, remainder);
-  };
-}
+export function isHalf<TAmount>(calculator: DineroCalculator<TAmount>) {}
 
killedBy: compare properties is antisymmetric: compare(a, b) equals -compare(b, a)
statusReason: Property failed after 100 tests
{ seed: 722575430, path: "99", endOnFailure: true }
Counterexample: [-8,-8]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/core/utils/isHalf.ts:9:46
   const equalFn = equal(calculator);
   const absoluteFn = absolute(calculator);
 
-  return (input: TAmount, total: TAmount) => {
-    const remainder = absoluteFn(calculator.modulo(input, total));
-    const difference = calculator.subtract(total, remainder);
-
-    return equalFn(difference, remainder);
-  };
+  return (input: TAmount, total: TAmount) => {};
 }
 
killedBy: halfEven decimal factors rounds to nearest even integer with a positive half quotient rounding to an odd integer
statusReason: expected 3 to be 2 // Object.is equality
