[Killed] BlockStatement
src/core/utils/isScaledAmount.ts:5:42
 
 export function isScaledAmount<TAmount>(
   amount: DineroRate<TAmount>
-): amount is DineroScaledAmount<TAmount> {
-  return (amount as DineroScaledAmount<TAmount>)?.hasOwnProperty('amount');
-}
+): amount is DineroScaledAmount<TAmount> {}
 
killedBy: multiply number converts the multiplied amount to the safest scale
statusReason: [Dinero.js] Amount is invalid.

[Survived] OptionalChaining
src/core/utils/isScaledAmount.ts:6:10
 export function isScaledAmount<TAmount>(
   amount: DineroRate<TAmount>
 ): amount is DineroScaledAmount<TAmount> {
-  return (amount as DineroScaledAmount<TAmount>)?.hasOwnProperty('amount');
+  return (amount as DineroScaledAmount<TAmount>).hasOwnProperty('amount');
 }
 
