[Killed] BlockStatement
src/core/utils/lessThan.ts:13:76
  *
  * @returns The lessThan function.
  */
-export function lessThan<TAmount>(calculator: LessThanCalculator<TAmount>) {
-  return (subject: TAmount, comparator: TAmount) => {
-    return (
-      calculator.compare(subject, comparator) === DineroComparisonOperator.LT
-    );
-  };
-}
+export function lessThan<TAmount>(calculator: LessThanCalculator<TAmount>) {}
 
killedBy: compare number decimal currencies returns -1 when the first amount is less than the other
statusReason: lessThanFn is not a function

[Killed] BlockStatement
src/core/utils/lessThan.ts:14:53
  * @returns The lessThan function.
  */
 export function lessThan<TAmount>(calculator: LessThanCalculator<TAmount>) {
-  return (subject: TAmount, comparator: TAmount) => {
-    return (
-      calculator.compare(subject, comparator) === DineroComparisonOperator.LT
-    );
-  };
+  return (subject: TAmount, comparator: TAmount) => {};
 }
 
killedBy: halfEven decimal factors rounds down with any negative quotient above half
statusReason: Property failed after 1 tests
{ seed: -174426194, path: "0:0", endOnFailure: true }
Counterexample: [-6]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/core/utils/lessThan.ts:16:7
 export function lessThan<TAmount>(calculator: LessThanCalculator<TAmount>) {
   return (subject: TAmount, comparator: TAmount) => {
     return (
-      calculator.compare(subject, comparator) === DineroComparisonOperator.LT
+      calculator.compare(subject, comparator) !== DineroComparisonOperator.LT
     );
   };
killedBy: halfEven decimal factors rounds to nearest even integer with a positive half quotient rounding to an even integer
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/core/utils/lessThan.ts:16:7
 export function lessThan<TAmount>(calculator: LessThanCalculator<TAmount>) {
   return (subject: TAmount, comparator: TAmount) => {
     return (
-      calculator.compare(subject, comparator) === DineroComparisonOperator.LT
+      true
     );
   };
killedBy: halfEven decimal factors rounds to nearest even integer with a positive half quotient rounding to an even integer
statusReason: expected 1 to be 2 // Object.is equality
