[Killed] BlockStatement
src/core/utils/lessThanOrEqual.ts:17:3
  */
 export function lessThanOrEqual<TAmount>(
   calculator: LessThanOrEqualCalculator<TAmount>
-) {
-  return (subject: TAmount, comparator: TAmount) => {
-    return (
-      lessThan(calculator)(subject, comparator) ||
-      equal(calculator)(subject, comparator)
-    );
-  };
-}
+) {}
 
killedBy: compare properties is transitive: if a <= b and b <= c, then a <= c
statusReason: Property failed after 1 tests
{ seed: -69813296, path: "0:0:0:0", endOnFailure: true }
Counterexample: [0,0,0]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/core/utils/lessThanOrEqual.ts:18:53
 export function lessThanOrEqual<TAmount>(
   calculator: LessThanOrEqualCalculator<TAmount>
 ) {
-  return (subject: TAmount, comparator: TAmount) => {
-    return (
-      lessThan(calculator)(subject, comparator) ||
-      equal(calculator)(subject, comparator)
-    );
-  };
+  return (subject: TAmount, comparator: TAmount) => {};
 }
 
killedBy: compare properties is transitive: if a <= b and b <= c, then a <= c
statusReason: Property failed after 1 tests
{ seed: 1073244078, path: "0:0:0:0", endOnFailure: true }
Counterexample: [0,0,0]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/core/utils/lessThanOrEqual.ts:20:7
 ) {
   return (subject: TAmount, comparator: TAmount) => {
     return (
-      lessThan(calculator)(subject, comparator) ||
-      equal(calculator)(subject, comparator)
+      false
     );
   };
killedBy: compare properties is transitive: if a <= b and b <= c, then a <= c
statusReason: Property failed after 1 tests
{ seed: -367388950, path: "0:0:0:0", endOnFailure: true }
Counterexample: [0,0,0]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/core/utils/lessThanOrEqual.ts:20:7
 ) {
   return (subject: TAmount, comparator: TAmount) => {
     return (
-      lessThan(calculator)(subject, comparator) ||
-      equal(calculator)(subject, comparator)
+      true
     );
   };
killedBy: lessThanOrEqual number returns false when the first amount is greater than the other
statusReason: expected true to be false // Object.is equality
