[Killed] BlockStatement
src/core/utils/maximum.ts:14:74
  *
  * @returns The maximum function.
  */
-export function maximum<TAmount>(calculator: MaximumCalculator<TAmount>) {
-  const lessThanFn = lessThan(calculator);
-
-  return (values: readonly TAmount[]) => {
-    return values.reduce((acc, curr) => {
-      return lessThanFn(acc, curr) ? curr : acc;
-    });
-  };
-}
+export function maximum<TAmount>(calculator: MaximumCalculator<TAmount>) {}
 
killedBy: compare number decimal currencies returns -1 when the first amount is less than the other
statusReason: maximumFn is not a function

[Killed] BlockStatement
src/core/utils/maximum.ts:17:42
 export function maximum<TAmount>(calculator: MaximumCalculator<TAmount>) {
   const lessThanFn = lessThan(calculator);
 
-  return (values: readonly TAmount[]) => {
-    return values.reduce((acc, curr) => {
-      return lessThanFn(acc, curr) ? curr : acc;
-    });
-  };
+  return (values: readonly TAmount[]) => {};
 }
 
killedBy: compare number decimal currencies normalizes the result to the highest scale
statusReason: expected 1 to be -1 // Object.is equality

[Killed] BlockStatement
src/core/utils/maximum.ts:18:41
   const lessThanFn = lessThan(calculator);
 
   return (values: readonly TAmount[]) => {
-    return values.reduce((acc, curr) => {
-      return lessThanFn(acc, curr) ? curr : acc;
-    });
+    return values.reduce((acc, curr) => {});
   };
 }
killedBy: lessThanOrEqual number normalizes the result to the highest scale
statusReason: expected false to be true // Object.is equality
