[Killed] BlockStatement
src/core/utils/minimum.ts:14:74
  *
  * @returns The minimum function.
  */
-export function minimum<TAmount>(calculator: MinimumCalculator<TAmount>) {
-  const greaterThanFn = greaterThan(calculator);
-
-  return (values: readonly TAmount[]) => {
-    return values.reduce((acc, curr) => {
-      return greaterThanFn(acc, curr) ? curr : acc;
-    });
-  };
-}
+export function minimum<TAmount>(calculator: MinimumCalculator<TAmount>) {}
 
killedBy: minimum number returns the lower from a set of Dinero objects
statusReason: minFn is not a function

[Killed] BlockStatement
src/core/utils/minimum.ts:17:42
 export function minimum<TAmount>(calculator: MinimumCalculator<TAmount>) {
   const greaterThanFn = greaterThan(calculator);
 
-  return (values: readonly TAmount[]) => {
-    return values.reduce((acc, curr) => {
-      return greaterThanFn(acc, curr) ? curr : acc;
-    });
-  };
+  return (values: readonly TAmount[]) => {};
 }
 
killedBy: minimum number returns the lower from a set of Dinero objects
statusReason: [Dinero.js] Amount is invalid.

[Killed] BlockStatement
src/core/utils/minimum.ts:18:41
   const greaterThanFn = greaterThan(calculator);
 
   return (values: readonly TAmount[]) => {
-    return values.reduce((acc, curr) => {
-      return greaterThanFn(acc, curr) ? curr : acc;
-    });
+    return values.reduce((acc, curr) => {});
   };
 }
killedBy: minimum number returns the lower from a set of Dinero objects
statusReason: [Dinero.js] Amount is invalid.
