[Killed] BlockStatement
src/core/utils/sign.ts:6:70
 import { equal } from './equal';
 import { lessThan } from './lessThan';
 
-export function sign<TAmount>(calculator: DineroCalculator<TAmount>) {
-  const equalFn = equal(calculator);
-  const lessThanFn = lessThan(calculator);
-  const zero = calculator.zero();
-
-  return (input: TAmount) => {
-    if (equalFn(input, zero)) {
-      return zero;
-    }
-
-    const one = calculator.increment(zero);
-    const minusOne = calculator.decrement(zero);
-
-    return lessThanFn(input, zero) ? minusOne : one;
-  };
-}
+export function sign<TAmount>(calculator: DineroCalculator<TAmount>) {}
 
killedBy: transformScale number decimal currencies uses the provided `halfTowardsZero` divide function
statusReason: signFn is not a function

[Killed] BlockStatement
src/core/utils/sign.ts:11:30
   const lessThanFn = lessThan(calculator);
   const zero = calculator.zero();
 
-  return (input: TAmount) => {
-    if (equalFn(input, zero)) {
-      return zero;
-    }
-
-    const one = calculator.increment(zero);
-    const minusOne = calculator.decrement(zero);
-
-    return lessThanFn(input, zero) ? minusOne : one;
-  };
+  return (input: TAmount) => {};
 }
 
killedBy: halfAwayFromZero decimal factors rounds to the nearest integer away from zero with a positive half quotient
statusReason: expected NaN to be 2 // Object.is equality

[Killed] BlockStatement
src/core/utils/sign.ts:12:31
   const zero = calculator.zero();
 
   return (input: TAmount) => {
-    if (equalFn(input, zero)) {
-      return zero;
-    }
+    if (equalFn(input, zero)) {}
 
     const one = calculator.increment(zero);
killedBy: sign returns 0 with positive zero
statusReason: expected 1 to be +0 // Object.is equality
