[Killed] Block removal mutation
src/Stateless/GuardCondition.cs:24:13
             }
 
             internal GuardCondition(Func<object[], bool> guard, Reflection.InvocationInfo description)
-            {
-                Guard = guard ?? throw new ArgumentNullException(nameof(guard));
-                _methodDescription = description ?? throw new ArgumentNullException(nameof(description));
-            }
+            {}
 
             internal Func<object[], bool> Guard { get; }
killedBy: Stateless.Tests.DynamicAsyncTriggerBehaviourAsyncFixture.PermitDynamicIf_With_TriggerParameter_Throws_When_GuardCondition_Not_Met_Async; Stateless.Tests.DynamicAsyncTriggerBehaviourAsyncFixture.PermitDynamicIf_With_3_TriggerParameters_Permits_Transition_When_GuardCondition_Met_Async; Stateless.Tests.DynamicAsyncTriggerBehaviourAsyncFixture.PermitDynamicIf_Permits_Reentry_When_GuardCondition_Met_Async
