[Killed] Block removal mutation
src/Stateless/ReentryTriggerBehaviour.cs:9:47
         {
             readonly TState _destination;
 
-            internal TState Destination { get { return _destination; } }
+            internal TState Destination { get {} }
 
             // transitionGuard can be null if there is no guard function on the transition
killedBy: Stateless.Tests.AsyncActionsFixture.IfSelfTransitionPermited_ActionsFire_InSubstate_async; Stateless.Tests.DotGraphFixture.Reentrant_Transition_Shows_Entry_Action_When_Action_Is_Configured_With_OnEntryFrom; Stateless.Tests.DotGraphFixture.TransitionWithIgnoreAndEntry

[Killed] Block removal mutation
src/Stateless/ReentryTriggerBehaviour.cs:14:13
             // transitionGuard can be null if there is no guard function on the transition
             public ReentryTriggerBehaviour(TTrigger trigger, TState destination, TransitionGuard transitionGuard)
                 : base(trigger, transitionGuard)
-            {
-                _destination = destination;
-            }
+            {}
         }
     }
killedBy: Stateless.Tests.AsyncActionsFixture.IfSelfTransitionPermited_ActionsFire_InSubstate_async; Stateless.Tests.DotGraphFixture.Reentrant_Transition_Shows_Entry_Action_When_Action_Is_Configured_With_OnEntryFrom; Stateless.Tests.DotGraphFixture.TransitionWithIgnoreAndEntry
