[Killed] Block removal mutation
src/Stateless/StateRepresentation.cs:26:13
             public TState InitialTransitionTarget { get; private set; } = default;
 
             public StateRepresentation(TState state, bool retainSynchronizationContext = false)
-            {
-                _state = state;
-                _retainSynchronizationContext = retainSynchronizationContext;
-            }
+            {}
 
             internal ICollection<StateRepresentation> GetSubstates()
killedBy: Stateless.Tests.DotGraphFixture.SpacedUmlWithSubstate; Stateless.Tests.DotGraphFixture.Initial_State_Not_Changed_After_Trigger_Fired; Stateless.Tests.DotGraphFixture.TransitionWithIgnore

[Killed] Block removal mutation
src/Stateless/StateRepresentation.cs:32:13
             }
 
             internal ICollection<StateRepresentation> GetSubstates()
-            {
-                return _substates;
-            }
+            {}
 
             public bool CanHandle(TTrigger trigger, params object[] args)
killedBy: Stateless.Tests.ReflectionFixture.TwoSimpleTransitions_Binding; Stateless.Tests.ReflectionFixture.ReflectionMethodNames; Stateless.Tests.ReflectionFixture.TransitionGuardNames

[Killed] Block removal mutation
src/Stateless/StateRepresentation.cs:37:13
             }
 
             public bool CanHandle(TTrigger trigger, params object[] args)
-            {
-                return TryFindHandler(trigger, args, out TriggerBehaviourResult _);
-            }
+            {}
 
             public bool CanHandle(TTrigger trigger, object[] args, out ICollection<string> unmetGuards)
killedBy: Stateless.Tests.StateRepresentationFixture.WhenTransitionExistsInSupersate_TriggerCanBeFired; Stateless.Tests.StateRepresentationFixture.WhenTransitionExistSuperstateMetGuardConditions_CanBeFired; Stateless.Tests.StateRepresentationFixture.WhenTransitionDoesNotExist_TriggerCanBeFired

[Killed] Block removal mutation
src/Stateless/StateRepresentation.cs:42:13
             }
 
             public bool CanHandle(TTrigger trigger, object[] args, out ICollection<string> unmetGuards)
-            {
-                bool handlerFound = TryFindHandler(trigger, args, out TriggerBehaviourResult result);
-                unmetGuards = result?.UnmetGuardConditions;
-                return handlerFound;
-            }
+            {}
 
             public bool TryFindHandler(TTrigger trigger, object[] args, out TriggerBehaviourResult handler)
killedBy: Stateless.Tests.StateMachineFixture.CanFire_When_Transition_Is_Contidional_And_Has_Three_Trigger_Parameters_And_A_Guard_Condition_Is_Met_Returns_Empty_Collection; Stateless.Tests.StateMachineFixture.CanFire_When_Transition_Is_Contidional_And_Has_One_Trigger_Parameter_And_No_Guard_Conditions_Are_Met_Returns_Guard_Conditions; Stateless.Tests.StateMachineFixture.CanFire_GetEmptyUnmetGuardDescriptionsIfGuardPasses

[Killed] Logical mutation
src/Stateless/StateRepresentation.cs:52:37
             {
                 TriggerBehaviourResult superStateHandler = null;
 
-                bool handlerFound = TryFindLocalHandler(trigger, args, out TriggerBehaviourResult localHandler) ||
-                                    (Superstate != null && Superstate.TryFindHandler(trigger, args, out superStateHandler));
+                bool handlerFound = TryFindLocalHandler(trigger, args, out TriggerBehaviourResult localHandler) &&
+                                    (Superstate != null && Superstate.TryFindHandler(trigger, args, out superStateHandler));
 
                 // If no handler for super state, replace by local handler (see issue #398)
killedBy: Stateless.Tests.AsyncActionsFixture.SuperStateShouldNotExitOnSubStateTransition_WhenUsingSyncTriggers; Stateless.Tests.AsyncActionsFixture.OnEntryFromAsync_WhenEnteringByAnotherTriggerSynchronously_DoesNotThrow; Stateless.Tests.AsyncFiringModesFixture.ImmediateFiringOnEntryEndsUpInCorrectState

[Killed] Equality mutation
src/Stateless/StateRepresentation.cs:53:38
                 TriggerBehaviourResult superStateHandler = null;
 
                 bool handlerFound = TryFindLocalHandler(trigger, args, out TriggerBehaviourResult localHandler) ||
-                                    (Superstate != null && Superstate.TryFindHandler(trigger, args, out superStateHandler));
+                                    (Superstate == null && Superstate.TryFindHandler(trigger, args, out superStateHandler));
 
                 // If no handler for super state, replace by local handler (see issue #398)
killedBy: Stateless.Tests.AsyncActionsFixture.WhenSyncFireOnUnhandledTriggerAsyncAction; Stateless.Tests.AsyncActionsFixture.WhenSyncFireOnUnhandledTriggerAsyncTask; Stateless.Tests.TransitionTests.GivenMultiLayerSubstates_AndGuardConditionIsClosed_OpenTransitionOnClosestAncestorIsUsed

[Killed] Logical mutation
src/Stateless/StateRepresentation.cs:53:38
                 TriggerBehaviourResult superStateHandler = null;
 
                 bool handlerFound = TryFindLocalHandler(trigger, args, out TriggerBehaviourResult localHandler) ||
-                                    (Superstate != null && Superstate.TryFindHandler(trigger, args, out superStateHandler));
+                                    (Superstate != null || Superstate.TryFindHandler(trigger, args, out superStateHandler));
 
                 // If no handler for super state, replace by local handler (see issue #398)
killedBy: Stateless.Tests.AsyncActionsFixture.WhenSyncFireOnUnhandledTriggerAsyncAction; Stateless.Tests.AsyncActionsFixture.WhenSyncFireOnUnhandledTriggerAsyncTask; Stateless.Tests.TransitionTests.GivenMultiLayerSubstates_AndGuardConditionIsClosed_OpenTransitionOnClosestAncestorIsUsed

[Killed] Null coalescing mutation (remove left)
src/Stateless/StateRepresentation.cs:56:27
                                     (Superstate != null && Superstate.TryFindHandler(trigger, args, out superStateHandler));
 
                 // If no handler for super state, replace by local handler (see issue #398)
-                handler = superStateHandler ?? localHandler;
+                handler = localHandler;
 
                 return handlerFound;
killedBy: Stateless.Tests.TransitionTests.GivenMultiLayerSubstates_AndGuardConditionIsClosed_OpenTransitionOnClosestAncestorIsUsed; Stateless.Tests.IgnoredTriggerBehaviourFixture.IgnoreIfFalseTriggerMustNotBeIgnored

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/Stateless/StateRepresentation.cs:64:21
             private bool TryFindLocalHandler(TTrigger trigger, object[] args, out TriggerBehaviourResult handlerResult)
             {
                 // Get list of candidate trigger handlers
-                if (!TriggerBehaviours.TryGetValue(trigger, out ICollection<TriggerBehaviour> possible))
+                if (TriggerBehaviours.TryGetValue(trigger, out ICollection<TriggerBehaviour> possible))
                 {
                     handlerResult = null;
killedBy: Stateless.Tests.AsyncActionsFixture.SuperStateShouldNotExitOnSubStateTransition_WhenUsingSyncTriggers; Stateless.Tests.AsyncActionsFixture.WhenSyncFireOnUnhandledTriggerAsyncAction; Stateless.Tests.AsyncActionsFixture.WhenSyncFireOnUnhandledTriggerAsyncTask

[Killed] Boolean mutation
src/Stateless/StateRepresentation.cs:67:28
                 if (!TriggerBehaviours.TryGetValue(trigger, out ICollection<TriggerBehaviour> possible))
                 {
                     handlerResult = null;
-                    return false;
+                    return true;
                 }
                
killedBy: Stateless.Tests.AsyncActionsFixture.WhenSyncFireOnUnhandledTriggerAsyncAction; Stateless.Tests.AsyncActionsFixture.WhenSyncFireOnUnhandledTriggerAsyncTask; Stateless.Tests.StateMachineFixture.CanFire_GetNullUnmetGuardDescriptionsIfInvalidTrigger

[Killed] Null coalescing mutation (remove left)
src/Stateless/StateRepresentation.cs:76:33
                     .ToArray();
 
                 // Find a handler for the trigger
-                handlerResult = TryFindLocalHandlerResult(trigger, actual)
-                    ?? TryFindLocalHandlerResultWithUnmetGuardConditions(actual);
+                handlerResult = TryFindLocalHandlerResultWithUnmetGuardConditions(actual);
 
                 if (handlerResult == null)
killedBy: Stateless.Tests.AsyncActionsFixture.SuperStateShouldNotExitOnSubStateTransition_WhenUsingSyncTriggers; Stateless.Tests.AsyncActionsFixture.OnEntryFromAsync_WhenEnteringByAnotherTriggerSynchronously_DoesNotThrow; Stateless.Tests.AsyncFiringModesFixture.ImmediateFiringOnEntryEndsUpInCorrectState

[Killed] Equality mutation
src/Stateless/StateRepresentation.cs:79:21
                 handlerResult = TryFindLocalHandlerResult(trigger, actual)
                     ?? TryFindLocalHandlerResultWithUnmetGuardConditions(actual);
 
-                if (handlerResult == null)
+                if (handlerResult != null)
                     return false;
 
killedBy: Stateless.Tests.AsyncActionsFixture.SuperStateShouldNotExitOnSubStateTransition_WhenUsingSyncTriggers; Stateless.Tests.AsyncActionsFixture.OnEntryFromAsync_WhenEnteringByAnotherTriggerSynchronously_DoesNotThrow; Stateless.Tests.AsyncFiringModesFixture.ImmediateFiringOnEntryEndsUpInCorrectState

[NoCoverage] Boolean mutation
src/Stateless/StateRepresentation.cs:80:28
                     ?? TryFindLocalHandlerResultWithUnmetGuardConditions(actual);
 
                 if (handlerResult == null)
-                    return false;
+                    return true;
 
                 return !handlerResult.UnmetGuardConditions.Any();

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/Stateless/StateRepresentation.cs:82:24
                 if (handlerResult == null)
                     return false;
 
-                return !handlerResult.UnmetGuardConditions.Any();
+                return handlerResult.UnmetGuardConditions.Any();
             }
 
killedBy: Stateless.Tests.AsyncActionsFixture.SuperStateShouldNotExitOnSubStateTransition_WhenUsingSyncTriggers; Stateless.Tests.AsyncActionsFixture.OnEntryFromAsync_WhenEnteringByAnotherTriggerSynchronously_DoesNotThrow; Stateless.Tests.AsyncFiringModesFixture.ImmediateFiringOnEntryEndsUpInCorrectState

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/Stateless/StateRepresentation.cs:88:33
             private TriggerBehaviourResult TryFindLocalHandlerResult(TTrigger trigger, IEnumerable<TriggerBehaviourResult> results)
             {
                 var actual = results
-                    .Where(r => !r.UnmetGuardConditions.Any())
+                    .Where(r => r.UnmetGuardConditions.Any())
                     .ToList();
 
killedBy: Stateless.Tests.DynamicAsyncTriggerBehaviourAsyncFixture.PermitDynamic_With_TriggerParameter_Selects_Expected_State_Async; Stateless.Tests.DynamicAsyncTriggerBehaviourAsyncFixture.PermitDynamicIf_With_3_TriggerParameters_Permits_Transition_When_GuardCondition_Met_Async; Stateless.Tests.DynamicAsyncTriggerBehaviourAsyncFixture.PermitDynamicIf_Permits_Reentry_When_GuardCondition_Met_Async

[Killed] Negate expression
src/Stateless/StateRepresentation.cs:91:21
                     .Where(r => !r.UnmetGuardConditions.Any())
                     .ToList();
 
-                if (actual.Count <= 1)
+                if (!(actual.Count <= 1))
                     return actual.FirstOrDefault();
 
killedBy: Stateless.Tests.DynamicAsyncTriggerBehaviourAsyncFixture.PermitDynamic_With_TriggerParameter_Selects_Expected_State_Async; Stateless.Tests.DynamicAsyncTriggerBehaviourAsyncFixture.PermitDynamicIf_With_3_TriggerParameters_Permits_Transition_When_GuardCondition_Met_Async; Stateless.Tests.DynamicAsyncTriggerBehaviourAsyncFixture.PermitDynamicIf_Permits_Reentry_When_GuardCondition_Met_Async

[Killed] Equality mutation
src/Stateless/StateRepresentation.cs:91:21
                     .Where(r => !r.UnmetGuardConditions.Any())
                     .ToList();
 
-                if (actual.Count <= 1)
+                if (actual.Count < 1)
                     return actual.FirstOrDefault();
 
killedBy: Stateless.Tests.DynamicAsyncTriggerBehaviourAsyncFixture.PermitDynamic_With_TriggerParameter_Selects_Expected_State_Async; Stateless.Tests.DynamicAsyncTriggerBehaviourAsyncFixture.PermitDynamicIf_With_3_TriggerParameters_Permits_Transition_When_GuardCondition_Met_Async; Stateless.Tests.DynamicAsyncTriggerBehaviourAsyncFixture.PermitDynamicIf_Permits_Reentry_When_GuardCondition_Met_Async

[Killed] Linq method mutation (FirstOrDefault() to First())
src/Stateless/StateRepresentation.cs:92:28
                     .ToList();
 
                 if (actual.Count <= 1)
-                    return actual.FirstOrDefault();
+                    return actual.First();
 
                 var message = string.Format(StateRepresentationResources.MultipleTransitionsPermitted, trigger, _state);
killedBy: Stateless.Tests.AsyncTransitionTests.GivenMultiLayerSubstates_AndGuardConditionIsClosed_OpenTransitionOnClosestAncestorIsUsedAsync; Stateless.Tests.AsyncTransitionTests.GivenMultiLayerSubstates_AndGuardConditionIsClosed_OpenTransitionOnClosestAncestorIsUsedAsync; Stateless.Tests.AsyncTransitionTests.GivenMultiLayerSubstates_AndGuardConditionIsClosed_OpenTransitionOnClosestAncestorIsUsedAsync

[Killed] Statement mutation
src/Stateless/StateRepresentation.cs:95:17
                     return actual.FirstOrDefault();
 
                 var message = string.Format(StateRepresentationResources.MultipleTransitionsPermitted, trigger, _state);
-                throw new InvalidOperationException(message);
+                ;
             }
 
killedBy: Stateless.Tests.MutationGapsFixture.MultipleNonExclusiveGuards_ReportsMultipleTransitions_NotUnhandledTrigger

[Survived] Linq method mutation (FirstOrDefault() to First())
src/Stateless/StateRepresentation.cs:100:30
 
             private static TriggerBehaviourResult TryFindLocalHandlerResultWithUnmetGuardConditions(IEnumerable<TriggerBehaviourResult> results)
             {
-                var result = results.FirstOrDefault(r => r.UnmetGuardConditions.Any());
+                var result = results.First(r => r.UnmetGuardConditions.Any());
 
                 if (result != null)

[Killed] Equality mutation
src/Stateless/StateRepresentation.cs:102:21
             {
                 var result = results.FirstOrDefault(r => r.UnmetGuardConditions.Any());
 
-                if (result != null)
+                if (result == null)
                 {
                     var unmetConditions = results.Where(r => r.UnmetGuardConditions.Any())
killedBy: Stateless.Tests.StateMachineFixture.CanFire_When_Transition_Is_Contidional_And_Has_One_Trigger_Parameter_And_No_Guard_Conditions_Are_Met_Returns_Guard_Conditions; Stateless.Tests.StateMachineFixture.CanFire_When_Transition_Is_Contidional_And_Has_Three_Trigger_Parameters_And_No_Guard_Conditions_Are_Met_Returns_Guard_Conditions; Stateless.Tests.StateMachineFixture.CanFire_When_Transition_Is_Contidional_And_Has_Two_Trigger_Parameters_And_No_Guard_Conditions_Are_Met_Returns_Guard_Conditions

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/Stateless/StateRepresentation.cs:110:29
                     // Add other unmet conditions to first result
                     foreach (var condition in unmetConditions)
                     {
-                        if (!result.UnmetGuardConditions.Contains(condition))
+                        if (result.UnmetGuardConditions.Contains(condition))
                         {
                             result.UnmetGuardConditions.Add(condition);
killedBy: Stateless.Tests.AsyncTransitionTests.GivenMultiLayerSubstates_AndGuardConditionIsClosed_OpenTransitionOnClosestAncestorIsUsedAsync; Stateless.Tests.AsyncTransitionTests.GivenMultiLayerSubstates_AndGuardConditionIsClosed_OpenTransitionOnClosestAncestorIsUsedAsync; Stateless.Tests.AsyncTransitionTests.GivenMultiLayerSubstates_AndGuardConditionIsClosed_OpenTransitionOnClosestAncestorIsUsedAsync

[Killed] Statement mutation
src/Stateless/StateRepresentation.cs:112:29
                     {
                         if (!result.UnmetGuardConditions.Contains(condition))
                         {
-                            result.UnmetGuardConditions.Add(condition);
+                            ;
                         }
                     }
killedBy: Stateless.Tests.StateRepresentationFixture.AddAllGuardDescriptionsWhenMultipleGuardsFailForSameTrigger; Stateless.Tests.StateMachineFixture.CanFire_When_Transition_Is_Contidional_And_Has_One_Trigger_Parameter_And_No_Guard_Conditions_Are_Met_Returns_Guard_Conditions; Stateless.Tests.StateMachineFixture.CanFire_When_Transition_Is_Contidional_And_Has_Three_Trigger_Parameters_And_No_Guard_Conditions_Are_Met_Returns_Guard_Conditions

[Killed] Statement mutation
src/Stateless/StateRepresentation.cs:122:17
 
             public void AddActivateAction(Action action, Reflection.InvocationInfo activateActionDescription)
             {
-                ActivateActions.Add(new ActivateActionBehaviour.Sync(_state, action, activateActionDescription));
+                ;
             }
 
killedBy: Stateless.Tests.ReflectionFixture.ReflectionMethodNames; Stateless.Tests.ActiveStatesFixture.WhenTransitioning; Stateless.Tests.ActiveStatesFixture.WhenActivate

[Killed] Statement mutation
src/Stateless/StateRepresentation.cs:127:17
 
             public void AddDeactivateAction(Action action, Reflection.InvocationInfo deactivateActionDescription)
             {
-                DeactivateActions.Add(new DeactivateActionBehaviour.Sync(_state, action, deactivateActionDescription));
+                ;
             }
 
killedBy: Stateless.Tests.ReflectionFixture.ReflectionMethodNames

[Killed] Statement mutation
src/Stateless/StateRepresentation.cs:132:17
 
             public void AddEntryAction(TTrigger trigger, Action<Transition, object[]> action, Reflection.InvocationInfo entryActionDescription)
             {
-                EntryActions.Add(new EntryActionBehavior.SyncFrom<TTrigger>(trigger, action, entryActionDescription));
+                ;
             }
 
killedBy: Stateless.Tests.ReflectionFixture.ReflectionMethodNames; Stateless.Tests.DynamicTriggerBehaviourAsyncFixture.PermitDynamic_Permits_Reentry_Async; Stateless.Tests.DynamicTriggerBehaviourAsyncFixture.PermitDynamicIf_Permits_Reentry_When_GuardCondition_Met_Async

[Killed] Statement mutation
src/Stateless/StateRepresentation.cs:137:17
 
             public void AddEntryAction(Action<Transition, object[]> action, Reflection.InvocationInfo entryActionDescription)
             {
-                EntryActions.Add(new EntryActionBehavior.Sync(action, entryActionDescription));
+                ;
             }
 
killedBy: Stateless.Tests.DynamicAsyncTriggerBehaviourAsyncFixture.PermitDynamicIf_Permits_Reentry_When_GuardCondition_Met_Async; Stateless.Tests.DynamicAsyncTriggerBehaviourAsyncFixture.PermitDynamic_Permits_Reentry_Async; Stateless.Tests.AsyncFiringModesFixture.ImmediateEntryAProcessedBeforeEnterB

[Killed] Statement mutation
src/Stateless/StateRepresentation.cs:142:17
 
             public void AddExitAction(Action<Transition> action, Reflection.InvocationInfo exitActionDescription)
             {
-                ExitActions.Add(new ExitActionBehavior.Sync(action, exitActionDescription));
+                ;
             }
 
killedBy: Stateless.Tests.DynamicAsyncTriggerBehaviourAsyncFixture.PermitDynamicIf_Permits_Reentry_When_GuardCondition_Met_Async; Stateless.Tests.DynamicAsyncTriggerBehaviourAsyncFixture.PermitDynamic_Permits_Reentry_Async; Stateless.Tests.AsyncFiringModesFixture.ImmediateEntryAProcessedBeforeEnterB

[Killed] Equality mutation
src/Stateless/StateRepresentation.cs:147:21
 
             public void Activate()
             {
-                if (_superstate != null)
+                if (_superstate == null)
                     _superstate.Activate();
 
killedBy: Stateless.Tests.AsyncActionsFixture.WhenSyncDeactivateAsyncOnDeactivateAction; Stateless.Tests.AsyncActionsFixture.WhenSyncActivateAsyncOnActivateAction; Stateless.Tests.ActiveStatesFixture.WhenTransitioning

[Killed] Statement mutation
src/Stateless/StateRepresentation.cs:148:21
             public void Activate()
             {
                 if (_superstate != null)
-                    _superstate.Activate();
+                    ;
 
                 ExecuteActivationActions();
killedBy: Stateless.Tests.ActiveStatesFixture.WhenActivate; Stateless.Tests.ActiveStatesFixture.WhenTransitioningWithinSameSuperstate; Stateless.Tests.ActiveStatesFixture.WhenActivateIsIdempotent

[Killed] Statement mutation
src/Stateless/StateRepresentation.cs:150:17
                 if (_superstate != null)
                     _superstate.Activate();
 
-                ExecuteActivationActions();
+                ;
             }
 
killedBy: Stateless.Tests.AsyncActionsFixture.WhenSyncActivateAsyncOnActivateAction

[Killed] Statement mutation
src/Stateless/StateRepresentation.cs:155:17
 
             public void Deactivate()
             {
-                ExecuteDeactivationActions();
+                ;
 
                 if (_superstate != null)
killedBy: Stateless.Tests.AsyncActionsFixture.WhenSyncDeactivateAsyncOnDeactivateAction; Stateless.Tests.ActiveStatesFixture.WhenDeactivate

[Killed] Equality mutation
src/Stateless/StateRepresentation.cs:157:21
             {
                 ExecuteDeactivationActions();
 
-                if (_superstate != null)
+                if (_superstate == null)
                     _superstate.Deactivate();
             }
killedBy: Stateless.Tests.ActiveStatesFixture.WhenDeactivate

[Killed] Statement mutation
src/Stateless/StateRepresentation.cs:158:21
                 ExecuteDeactivationActions();
 
                 if (_superstate != null)
-                    _superstate.Deactivate();
+                    ;
             }
 
killedBy: Stateless.Tests.ActiveStatesFixture.WhenDeactivate

[Killed] Statement mutation
src/Stateless/StateRepresentation.cs:164:21
             void ExecuteActivationActions()
             {
                 foreach (var action in ActivateActions)
-                    action.Execute();
+                    ;
             }
 
killedBy: Stateless.Tests.AsyncActionsFixture.WhenSyncActivateAsyncOnActivateAction; Stateless.Tests.ActiveStatesFixture.WhenTransitioning; Stateless.Tests.ActiveStatesFixture.WhenActivate

[Killed] Statement mutation
src/Stateless/StateRepresentation.cs:170:21
             void ExecuteDeactivationActions()
             {
                 foreach (var action in DeactivateActions)
-                    action.Execute();
+                    ;
             }
 
killedBy: Stateless.Tests.AsyncActionsFixture.WhenSyncDeactivateAsyncOnDeactivateAction; Stateless.Tests.ActiveStatesFixture.WhenDeactivate

[Killed] Negate expression
src/Stateless/StateRepresentation.cs:175:21
 
             public void Enter(Transition transition, params object[] entryArgs)
             {
-                if (transition.IsReentry)
+                if (!(transition.IsReentry))
                 {
                     ExecuteEntryActions(transition, entryArgs);
killedBy: Stateless.Tests.StateMachineFixture.IfSelfTransitionPermited_ActionsFire; Stateless.Tests.StateMachineFixture.IgnoreVsPermitReentryFrom

[Killed] Statement mutation
src/Stateless/StateRepresentation.cs:177:21
             {
                 if (transition.IsReentry)
                 {
-                    ExecuteEntryActions(transition, entryArgs);
+                    ;
                 }
                 else if (!Includes(transition.Source))
killedBy: Stateless.Tests.DynamicTriggerBehaviourFixture.PermitDynamic_Permits_Reentry; Stateless.Tests.DynamicTriggerBehaviourFixture.PermitDynamicIf_Permits_Reentry_When_GuardCondition_Met; Stateless.Tests.InitialTransitionFixture.Transition_with_reentry_Test

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/Stateless/StateRepresentation.cs:179:26
                 {
                     ExecuteEntryActions(transition, entryArgs);
                 }
-                else if (!Includes(transition.Source))
+                else if (Includes(transition.Source))
                 {
                     if (_superstate != null && !(transition is InitialTransition))
killedBy: Stateless.Tests.AsyncActionsFixture.SuperStateShouldNotExitOnSubStateTransition_WhenUsingSyncTriggers; Stateless.Tests.AsyncActionsFixture.WhenSyncFireAsyncEntryAction; Stateless.Tests.AsyncActionsFixture.OnEntryFromAsync_WhenTriggeredSynchronously_Throws

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/Stateless/StateRepresentation.cs:181:48
                 }
                 else if (!Includes(transition.Source))
                 {
-                    if (_superstate != null && !(transition is InitialTransition))
+                    if (_superstate != null && (transition is InitialTransition))
                         _superstate.Enter(transition, entryArgs);
 
killedBy: Stateless.Tests.AsyncActionsFixture.SuperStateShouldNotExitOnSubStateTransition_WhenUsingSyncTriggers

[Killed] Logical mutation
src/Stateless/StateRepresentation.cs:181:25
                 }
                 else if (!Includes(transition.Source))
                 {
-                    if (_superstate != null && !(transition is InitialTransition))
+                    if (_superstate != null || !(transition is InitialTransition))
                         _superstate.Enter(transition, entryArgs);
 
killedBy: Stateless.Tests.AsyncActionsFixture.WhenSyncFireAsyncOnTransitionCompletedAction; Stateless.Tests.AsyncActionsFixture.SuperStateShouldNotExitOnSubStateTransition_WhenUsingSyncTriggers; Stateless.Tests.AsyncActionsFixture.WhenSyncFireAsyncEntryAction

[Killed] Statement mutation
src/Stateless/StateRepresentation.cs:182:25
                 else if (!Includes(transition.Source))
                 {
                     if (_superstate != null && !(transition is InitialTransition))
-                        _superstate.Enter(transition, entryArgs);
+                        ;
 
                     ExecuteEntryActions(transition, entryArgs);
killedBy: Stateless.Tests.StateRepresentationFixture.WhenEnteringSubstate_SuperstateEntryActionsExecuteBeforeSubstate; Stateless.Tests.StateRepresentationFixture.WhenEnteringSubstate_SuperEntryActionsExecuted

[Killed] Statement mutation
src/Stateless/StateRepresentation.cs:184:21
                     if (_superstate != null && !(transition is InitialTransition))
                         _superstate.Enter(transition, entryArgs);
 
-                    ExecuteEntryActions(transition, entryArgs);
+                    ;
                 }
             }
killedBy: Stateless.Tests.AsyncActionsFixture.SuperStateShouldNotExitOnSubStateTransition_WhenUsingSyncTriggers; Stateless.Tests.AsyncActionsFixture.WhenSyncFireAsyncEntryAction; Stateless.Tests.AsyncActionsFixture.OnEntryFromAsync_WhenTriggeredSynchronously_Throws

[Killed] Statement mutation
src/Stateless/StateRepresentation.cs:192:21
             {
                 if (transition.IsReentry)
                 {
-                    ExecuteExitActions(transition);
+                    ;
                 }
                 else if (!Includes(transition.Destination))
killedBy: Stateless.Tests.DynamicTriggerBehaviourFixture.PermitDynamic_Permits_Reentry; Stateless.Tests.DynamicTriggerBehaviourFixture.PermitDynamicIf_Permits_Reentry_When_GuardCondition_Met; Stateless.Tests.InitialTransitionFixture.Transition_with_reentry_Test

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/Stateless/StateRepresentation.cs:194:26
                 {
                     ExecuteExitActions(transition);
                 }
-                else if (!Includes(transition.Destination))
+                else if (Includes(transition.Destination))
                 {
                     ExecuteExitActions(transition);
killedBy: Stateless.Tests.AsyncActionsFixture.WhenSyncFireAsyncExitAction; Stateless.Tests.AsyncActionsFixture.SuperStateShouldNotExitOnSubStateTransition_WhenUsingSyncTriggers; Stateless.Tests.AsyncFiringModesFixture.ImmediateFiringOnEntryEndsUpInCorrectState

[Killed] Equality mutation
src/Stateless/StateRepresentation.cs:199:25
                     ExecuteExitActions(transition);
 
                     // Must check if there is a superstate, and if we are leaving that superstate
-                    if (_superstate != null)
+                    if (_superstate == null)
                     {
                         // Check if destination is within the state list
killedBy: Stateless.Tests.AsyncActionsFixture.WhenSyncFireAsyncOnTransitionCompletedAction; Stateless.Tests.AsyncActionsFixture.SuperStateShouldNotExitOnSubStateTransition_WhenUsingSyncTriggers; Stateless.Tests.AsyncActionsFixture.WhenSyncFireAsyncOnTransitionedAction

[Survived] Negate expression
src/Stateless/StateRepresentation.cs:202:29
                     if (_superstate != null)
                     {
                         // Check if destination is within the state list
-                        if (IsIncludedIn(transition.Destination))
+                        if (!(IsIncludedIn(transition.Destination)))
                         {
                             // Destination state is within the list, exit first superstate only if it is NOT the the first
