[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/Stateless/StateRepresentation.cs:205:33
                         if (IsIncludedIn(transition.Destination))
                         {
                             // Destination state is within the list, exit first superstate only if it is NOT the the first
-                            if (!_superstate.UnderlyingState.Equals(transition.Destination))
+                            if (_superstate.UnderlyingState.Equals(transition.Destination))
                             {
                                 return _superstate.Exit(transition);
killedBy: Stateless.Tests.MutationGapsFixture.TransitionFromNestedSubstateToGrandparent_ExitsIntermediateParentOnly

[Killed] Block removal mutation
src/Stateless/StateRepresentation.cs:206:29
                         {
                             // Destination state is within the list, exit first superstate only if it is NOT the the first
                             if (!_superstate.UnderlyingState.Equals(transition.Destination))
-                            {
-                                return _superstate.Exit(transition);
-                            }
+                            {}
                         }
                         else
killedBy: Stateless.Tests.MutationGapsFixture.TransitionFromNestedSubstateToGrandparent_ExitsIntermediateParentOnly

[Killed] Block removal mutation
src/Stateless/StateRepresentation.cs:211:25
                             }
                         }
                         else
-                        {
-                            // Exit the superstate as well
-                            return _superstate.Exit(transition);
-                        }
+                        {}
                     }
                 }
killedBy: Stateless.Tests.StateRepresentationFixture.WhenExitingSubstate_SubstateEntryActionsExecuteBeforeSuperstate; Stateless.Tests.StateRepresentationFixture.WhenLeavingSubstate_SuperExitActionsExecuted

[Killed] Statement mutation
src/Stateless/StateRepresentation.cs:223:21
             void ExecuteEntryActions(Transition transition, object[] entryArgs)
             {
                 foreach (var action in EntryActions)
-                    action.Execute(transition, entryArgs);
+                    ;
             }
 
killedBy: Stateless.Tests.AsyncActionsFixture.SuperStateShouldNotExitOnSubStateTransition_WhenUsingSyncTriggers; Stateless.Tests.AsyncActionsFixture.WhenSyncFireAsyncEntryAction; Stateless.Tests.AsyncActionsFixture.OnEntryFromAsync_WhenTriggeredSynchronously_Throws

[Killed] Statement mutation
src/Stateless/StateRepresentation.cs:229:21
             void ExecuteExitActions(Transition transition)
             {
                 foreach (var action in ExitActions)
-                    action.Execute(transition);
+                    ;
             }
             internal void InternalAction(Transition transition, object[] args)
killedBy: Stateless.Tests.AsyncFiringModesFixture.ImmediateFiringOnEntryEndsUpInCorrectState

[Killed] Equality mutation
src/Stateless/StateRepresentation.cs:237:24
 
                 // Look for actions in superstate(s) recursively until we hit the topmost superstate, or we actually find some trigger handlers.
                 StateRepresentation aStateRep = this;
-                while (aStateRep != null)
+                while (aStateRep == null)
                 {
                     if (aStateRep.TryFindLocalHandler(transition.Trigger, args, out TriggerBehaviourResult result))
killedBy: Stateless.Tests.AsyncActionsFixture.WhenSyncFireInternalAsyncAction; Stateless.Tests.InternalTransitionFixture.StayInSameSubStateTransitionInSubstate_Transition; Stateless.Tests.InternalTransitionFixture.StayInSameStateTwoStates_Transition

[Killed] Negate expression
src/Stateless/StateRepresentation.cs:239:25
                 StateRepresentation aStateRep = this;
                 while (aStateRep != null)
                 {
-                    if (aStateRep.TryFindLocalHandler(transition.Trigger, args, out TriggerBehaviourResult result))
+                    if (!(aStateRep.TryFindLocalHandler(transition.Trigger, args, out TriggerBehaviourResult result)))
                     {
                         // Trigger handler found in this state
killedBy: Stateless.Tests.AsyncActionsFixture.WhenSyncFireInternalAsyncAction; Stateless.Tests.TransitionTests.InternalTransitionIf_ShouldExecuteOnlyFirstMatchingAction

[Killed] Negate expression
src/Stateless/StateRepresentation.cs:242:29
                     if (aStateRep.TryFindLocalHandler(transition.Trigger, args, out TriggerBehaviourResult result))
                     {
                         // Trigger handler found in this state
-                        if (result.Handler is InternalTriggerBehaviour.Async)
+                        if (!(result.Handler is InternalTriggerBehaviour.Async))
                             throw new InvalidOperationException("Running Async internal actions in synchronous mode is not allowed");
 
killedBy: Stateless.Tests.AsyncActionsFixture.WhenSyncFireInternalAsyncAction; Stateless.Tests.InternalTransitionFixture.StayInSameSubStateTransitionInSubstate_Transition; Stateless.Tests.InternalTransitionFixture.StayInSameStateTwoStates_Transition

[Killed] Statement mutation
src/Stateless/StateRepresentation.cs:243:29
                     {
                         // Trigger handler found in this state
                         if (result.Handler is InternalTriggerBehaviour.Async)
-                            throw new InvalidOperationException("Running Async internal actions in synchronous mode is not allowed");
+                            ;
 
                         internalTransition = result.Handler as InternalTriggerBehaviour.Sync;
killedBy: Stateless.Tests.AsyncActionsFixture.WhenSyncFireInternalAsyncAction

[Killed] Statement mutation
src/Stateless/StateRepresentation.cs:246:25
                             throw new InvalidOperationException("Running Async internal actions in synchronous mode is not allowed");
 
                         internalTransition = result.Handler as InternalTriggerBehaviour.Sync;
-                        break;
+                        ;
                     }
                     // Try to look for trigger handlers in superstate (if it exists)
killedBy: Stateless.Tests.InternalTransitionFixture.InternalTriggerHandledOnlyOnceInSub

[Killed] Equality mutation
src/Stateless/StateRepresentation.cs:253:21
                 }
 
                 // Execute internal transition event handler
-                if (internalTransition == null) throw new ArgumentNullException("The configuration is incorrect, no action assigned to this internal transition.");
+                if (internalTransition != null) throw new ArgumentNullException("The configuration is incorrect, no action assigned to this internal transition.");
                 internalTransition.InternalAction(transition, args);
             }
killedBy: Stateless.Tests.InternalTransitionFixture.StayInSameSubStateTransitionInSubstate_Transition; Stateless.Tests.InternalTransitionFixture.StayInSameStateTwoStates_Transition; Stateless.Tests.InternalTransitionFixture.InternalTriggerHandledOnlyOnceInSuper

[NoCoverage] Statement mutation
src/Stateless/StateRepresentation.cs:253:49
                 }
 
                 // Execute internal transition event handler
-                if (internalTransition == null) throw new ArgumentNullException("The configuration is incorrect, no action assigned to this internal transition.");
+                if (internalTransition == null) ;
                 internalTransition.InternalAction(transition, args);
             }

[Killed] Statement mutation
src/Stateless/StateRepresentation.cs:254:17
 
                 // Execute internal transition event handler
                 if (internalTransition == null) throw new ArgumentNullException("The configuration is incorrect, no action assigned to this internal transition.");
-                internalTransition.InternalAction(transition, args);
+                ;
             }
             public void AddTriggerBehaviour(TriggerBehaviour triggerBehaviour)
killedBy: Stateless.Tests.InternalTransitionFixture.InternalTriggerHandledOnlyOnceInSuper; Stateless.Tests.InternalTransitionFixture.InternalTriggerHandledOnlyOnceInSub; Stateless.Tests.InternalTransitionFixture.OnlyOneHandlerExecuted

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/Stateless/StateRepresentation.cs:258:21
             }
             public void AddTriggerBehaviour(TriggerBehaviour triggerBehaviour)
             {
-                if (!TriggerBehaviours.TryGetValue(triggerBehaviour.Trigger, out ICollection<TriggerBehaviour> allowed))
+                if (TriggerBehaviours.TryGetValue(triggerBehaviour.Trigger, out ICollection<TriggerBehaviour> allowed))
                 {
                     allowed = new List<TriggerBehaviour>();
killedBy: Stateless.Tests.DotGraphFixture.SpacedUmlWithSubstate; Stateless.Tests.DotGraphFixture.Initial_State_Not_Changed_After_Trigger_Fired; Stateless.Tests.DotGraphFixture.DestinationStateIsCalculatedBasedOnTriggerParameters

[Killed] Statement mutation
src/Stateless/StateRepresentation.cs:261:21
                 if (!TriggerBehaviours.TryGetValue(triggerBehaviour.Trigger, out ICollection<TriggerBehaviour> allowed))
                 {
                     allowed = new List<TriggerBehaviour>();
-                    TriggerBehaviours.Add(triggerBehaviour.Trigger, allowed);
+                    ;
                 }
                 allowed.Add(triggerBehaviour);
killedBy: Stateless.Tests.DotGraphFixture.SpacedUmlWithSubstate; Stateless.Tests.DotGraphFixture.Initial_State_Not_Changed_After_Trigger_Fired; Stateless.Tests.DotGraphFixture.DestinationStateIsCalculatedBasedOnTriggerParameters

[Killed] Statement mutation
src/Stateless/StateRepresentation.cs:263:17
                     allowed = new List<TriggerBehaviour>();
                     TriggerBehaviours.Add(triggerBehaviour.Trigger, allowed);
                 }
-                allowed.Add(triggerBehaviour);
+                ;
             }
 
killedBy: Stateless.Tests.DotGraphFixture.SpacedUmlWithSubstate; Stateless.Tests.DotGraphFixture.Initial_State_Not_Changed_After_Trigger_Fired; Stateless.Tests.DotGraphFixture.DestinationStateIsCalculatedBasedOnTriggerParameters

[Killed] Block removal mutation
src/Stateless/StateRepresentation.cs:269:17
             public StateRepresentation Superstate
             {
                 get
-                {
-                    return _superstate;
-                }
+                {}
                 set
                 {
killedBy: Stateless.Tests.AsyncActionsFixture.WhenInSubstate_TriggerSuperStateTwiceToSameSubstate_DoesNotReenterSubstate_Async; Stateless.Tests.AsyncActionsFixture.IfSelfTransitionPermited_ActionsFire_InSubstate_async; Stateless.Tests.AsyncActionsFixture.IfSelfTransitionPermittedAsync_ActionsFire_InSubstate_async

[Killed] Block removal mutation
src/Stateless/StateRepresentation.cs:273:17
                     return _superstate;
                 }
                 set
-                {
-                    _superstate = value;
-                }
+                {}
             }
 
killedBy: Stateless.Tests.AsyncActionsFixture.WhenInSubstate_TriggerSuperStateTwiceToSameSubstate_DoesNotReenterSubstate_Async; Stateless.Tests.AsyncActionsFixture.IfSelfTransitionPermited_ActionsFire_InSubstate_async; Stateless.Tests.AsyncActionsFixture.IfSelfTransitionPermittedAsync_ActionsFire_InSubstate_async

[Killed] Block removal mutation
src/Stateless/StateRepresentation.cs:281:17
             public TState UnderlyingState
             {
                 get
-                {
-                    return _state;
-                }
+                {}
             }
 
killedBy: Stateless.Tests.DotGraphFixture.SpacedUmlWithSubstate; Stateless.Tests.DotGraphFixture.Initial_State_Not_Changed_After_Trigger_Fired; Stateless.Tests.DotGraphFixture.TransitionWithIgnore

[Killed] Statement mutation
src/Stateless/StateRepresentation.cs:288:17
 
             public void AddSubstate(StateRepresentation substate)
             {
-                _substates.Add(substate);
+                ;
             }
 
killedBy: Stateless.Tests.AsyncActionsFixture.TransitionToSuperstateDoesNotExitSuperstate; Stateless.Tests.AsyncActionsFixture.SuperStateShouldNotExitOnSubStateTransition_WhenUsingSyncTriggers; Stateless.Tests.AsyncActionsFixture.VerifyNotEnterSuperstateWhenDoingInitialTransition

[Killed] Logical mutation
src/Stateless/StateRepresentation.cs:298:24
             /// <returns>True if included</returns>
             public bool Includes(TState state)
             {
-                return _state.Equals(state) || _substates.Any(s => s.Includes(state));
+                return _state.Equals(state) && _substates.Any(s => s.Includes(state));
             }
 
killedBy: Stateless.Tests.AsyncActionsFixture.TransitionToSuperstateDoesNotExitSuperstate; Stateless.Tests.AsyncActionsFixture.SuperStateShouldNotExitOnSubStateTransition_WhenUsingSyncTriggers

[Killed] Linq method mutation (Any() to All())
src/Stateless/StateRepresentation.cs:298:48
             /// <returns>True if included</returns>
             public bool Includes(TState state)
             {
-                return _state.Equals(state) || _substates.Any(s => s.Includes(state));
+                return _state.Equals(state) || _substates.All(s => s.Includes(state));
             }
 
killedBy: Stateless.Tests.AsyncFiringModesFixture.ImmediateEntryAProcessedBeforeEnterB; Stateless.Tests.AsyncFiringModesFixture.EntersSubStateofSubstateAsyncOnEntryCountAndOrder; Stateless.Tests.AsyncFiringModesFixture.ImmediateModeTransitionsAreInCorrectOrderWithAsyncDriving

[Killed] Logical mutation
src/Stateless/StateRepresentation.cs:309:21
             public bool IsIncludedIn(TState state)
             {
                 return
-                    _state.Equals(state) ||
-                    (_superstate != null && _superstate.IsIncludedIn(state));
+                    _state.Equals(state) &&
+                    (_superstate != null && _superstate.IsIncludedIn(state));
             }
             
killedBy: Stateless.Tests.StateMachineFixture.SubstateIsIncludedInCurrentState

[Killed] Equality mutation
src/Stateless/StateRepresentation.cs:310:22
             {
                 return
                     _state.Equals(state) ||
-                    (_superstate != null && _superstate.IsIncludedIn(state));
+                    (_superstate == null && _superstate.IsIncludedIn(state));
             }
             
killedBy: Stateless.Tests.StateMachineFixture.SubstateIsIncludedInCurrentState

[Killed] Logical mutation
src/Stateless/StateRepresentation.cs:310:22
             {
                 return
                     _state.Equals(state) ||
-                    (_superstate != null && _superstate.IsIncludedIn(state));
+                    (_superstate != null || _superstate.IsIncludedIn(state));
             }
             
killedBy: Stateless.Tests.StateRepresentationFixture.IsNotIncludedInSubstate; Stateless.Tests.StateRepresentationFixture.IsNotIncludedInUnrelatedState

[Killed] Boolean mutation
src/Stateless/StateRepresentation.cs:316:40
             internal void SetInitialTransition(TState state)
             {
                 InitialTransitionTarget = state;
-                HasInitialTransition = true;
+                HasInitialTransition = false;
             }
             public bool HasInitialTransition { get; private set; }
killedBy: Stateless.Tests.AsyncActionsFixture.SuperStateShouldNotExitOnSubStateTransition_WhenUsingSyncTriggers; Stateless.Tests.AsyncActionsFixture.SuperStateShouldNotExitOnSubStateTransition_WhenUsingAsyncTriggers; Stateless.Tests.AsyncFiringModesFixture.EntersSubStateofSubstateAsyncOnEntryCountAndOrder
