[Killed] Block removal mutation
src/Stateless/TransitionGuard.cs:18:13
             #region Generic TArg0, ... to object[] converters
 
             public static Func<object[], bool> ToPackedGuard<TArg0>(Func<TArg0, bool> guard)
-            {
-                return args => guard(ParameterConversion.Unpack<TArg0>(args, 0));
-            }
+            {}
 
             public static Func<object[], bool> ToPackedGuard<TArg0, TArg1>(Func<TArg0, TArg1, bool> guard)
killedBy: Stateless.Tests.DynamicAsyncTriggerBehaviourAsyncFixture.PermitDynamicIf_With_TriggerParameter_Throws_When_GuardCondition_Not_Met_Async; Stateless.Tests.DynamicAsyncTriggerBehaviourAsyncFixture.PermitDynamicIf_With_TriggerParameter_Permits_Transition_When_GuardCondition_Met_Async; Stateless.Tests.InternalTransitionAsyncFixture.InternalTransitionAsyncIf_AllowGuardWithParameter

[Killed] Block removal mutation
src/Stateless/TransitionGuard.cs:23:13
             }
 
             public static Func<object[], bool> ToPackedGuard<TArg0, TArg1>(Func<TArg0, TArg1, bool> guard)
-            {
-                return args => guard(
-                    ParameterConversion.Unpack<TArg0>(args, 0), 
-                    ParameterConversion.Unpack<TArg1>(args, 1));
-            }
+            {}
 
             public static Func<object[], bool> ToPackedGuard<TArg0, TArg1, TArg2>(Func<TArg0, TArg1, TArg2, bool> guard)
killedBy: Stateless.Tests.DynamicTriggerBehaviourAsyncFixture.PermitDynamicIf_With_2_TriggerParameters_Throws_When_GuardCondition_Not_Met_Async; Stateless.Tests.DynamicTriggerBehaviourAsyncFixture.PermitDynamicIf_With_2_TriggerParameters_Permits_Transition_When_GuardCondition_Met_Async; Stateless.Tests.DynamicAsyncTriggerBehaviourAsyncFixture.PermitDynamicIf_With_2_TriggerParameters_Throws_When_GuardCondition_Not_Met_Async

[Killed] Block removal mutation
src/Stateless/TransitionGuard.cs:30:13
             }
 
             public static Func<object[], bool> ToPackedGuard<TArg0, TArg1, TArg2>(Func<TArg0, TArg1, TArg2, bool> guard)
-            {
-                return args => guard(
-                    ParameterConversion.Unpack<TArg0>(args, 0),
-                    ParameterConversion.Unpack<TArg1>(args, 1),
-                    ParameterConversion.Unpack<TArg2>(args, 2));
-            }
+            {}
 
             public static Tuple<Func<object[], bool>, string>[] ToPackedGuards<TArg0>(Tuple<Func<TArg0, bool>, string>[] guards)
killedBy: Stateless.Tests.DynamicTriggerBehaviourAsyncFixture.PermitDynamicIf_With_3_TriggerParameters_Throws_When_GuardCondition_Not_Met_Async; Stateless.Tests.DynamicTriggerBehaviourAsyncFixture.PermitDynamicIf_With_3_TriggerParameters_Permits_Transition_When_GuardCondition_Met_Async; Stateless.Tests.DynamicAsyncTriggerBehaviourAsyncFixture.PermitDynamicIf_With_3_TriggerParameters_Permits_Transition_When_GuardCondition_Met_Async

[Killed] Block removal mutation
src/Stateless/TransitionGuard.cs:38:13
             }
 
             public static Tuple<Func<object[], bool>, string>[] ToPackedGuards<TArg0>(Tuple<Func<TArg0, bool>, string>[] guards)
-            {
-                return guards.Select(guard => new Tuple<Func<object[], bool>, string>(
-                        ToPackedGuard(guard.Item1), guard.Item2))
-                    .ToArray();
-            }
+            {}
 
             public static Tuple<Func<object[], bool>, string>[] ToPackedGuards<TArg0, TArg1>(Tuple<Func<TArg0, TArg1, bool>, string>[] guards)
killedBy: Stateless.Tests.StateMachineFixture.ExceptionWhenBothParameterizedGuardClausesFalse; Stateless.Tests.StateMachineFixture.TransitionWhenBothParameterizedGuardClausesTrue

[Killed] Block removal mutation
src/Stateless/TransitionGuard.cs:45:13
             }
 
             public static Tuple<Func<object[], bool>, string>[] ToPackedGuards<TArg0, TArg1>(Tuple<Func<TArg0, TArg1, bool>, string>[] guards)
-            {
-                return guards.Select(guard => new Tuple<Func<object[], bool>, string>(
-                        ToPackedGuard(guard.Item1), guard.Item2))
-                    .ToArray();
-            }
+            {}
 
             public static Tuple<Func<object[], bool>, string>[] ToPackedGuards<TArg0, TArg1, TArg2>(Tuple<Func<TArg0, TArg1, TArg2, bool>, string>[] guards)
killedBy: Stateless.Tests.MutationGapsFixture.PermitIf_TwoParameterTrigger_WithMultipleGuards

[Killed] Block removal mutation
src/Stateless/TransitionGuard.cs:52:13
             }
 
             public static Tuple<Func<object[], bool>, string>[] ToPackedGuards<TArg0, TArg1, TArg2>(Tuple<Func<TArg0, TArg1, TArg2, bool>, string>[] guards)
-            {
-                return guards.Select(guard => new Tuple<Func<object[], bool>, string>(
-                        ToPackedGuard(guard.Item1), guard.Item2))
-                    .ToArray();
-            }
+            {}
 
             #endregion
killedBy: Stateless.Tests.MutationGapsFixture.PermitIf_ThreeParameterTrigger_WithMultipleGuards

[Killed] Block removal mutation
src/Stateless/TransitionGuard.cs:61:13
             #endregion
 
             internal TransitionGuard(Tuple<Func<bool>, string>[] guards)
-            {
-                Conditions = guards
-                    .Select(g => new GuardCondition(g.Item1, Reflection.InvocationInfo.Create(g.Item1, g.Item2)))
-                    .ToList();
-            }
+            {}
 
             internal TransitionGuard(Func<bool> guard, string description = null)
killedBy: Stateless.Tests.TriggerWithParametersFixture.StateParameterIsNotAmbiguous; Stateless.Tests.TriggerWithParametersFixture.StateParameterIsNotAmbiguousAsync; Stateless.Tests.AsyncTransitionTests.GivenTriggerHandledOnSuperStateAndSubState_WhenSubstateTransitionGuardBlocked_ThenShouldUseSuperstateTransitionAsync

[Killed] Collection initializer mutation
src/Stateless/TransitionGuard.cs:69:30
 
             internal TransitionGuard(Func<bool> guard, string description = null)
             {
-                Conditions = new List<GuardCondition>
-                {
-                    new GuardCondition(guard, Reflection.InvocationInfo.Create(guard, description))
-                };
+                Conditions = new List<GuardCondition>
+{};
             }
 
killedBy: Stateless.Tests.InternalTransitionAsyncFixture.InternalTransitionAsyncIf_DeprecatedOverload_AllowGuardWithParameter; Stateless.Tests.InternalTransitionAsyncFixture.InternalTransitionAsyncIf_DeprecatedOverload_GuardExecutedOnlyOnce; Stateless.Tests.InternalTransitionAsyncFixture.InternalTransitionAsyncIf_DeprecatedOverload_AllowGuardWithoutParameter

[Killed] Block removal mutation
src/Stateless/TransitionGuard.cs:76:13
             }
 
             internal TransitionGuard(Tuple<Func<object[], bool>, string>[] guards)
-            {
-                Conditions = guards
-                    .Select(g => new GuardCondition(g.Item1, Reflection.InvocationInfo.Create(g.Item1, g.Item2)))
-                    .ToList();
-            }
+            {}
 
             internal TransitionGuard(Func<object[], bool> guard, string description = null)
killedBy: Stateless.Tests.StateRepresentationFixture.WhenTransitionExistsInSupersate_TriggerCanBeFired; Stateless.Tests.StateRepresentationFixture.WhenTransitionExistAndSuperstateUnmetGuardConditions_FireNotPossible; Stateless.Tests.StateRepresentationFixture.WhenTransitionUnmetGuardConditions_TriggerCannotBeFired

[Killed] Equality mutation
src/Stateless/TransitionGuard.cs:101:44
             /// </summary>
             public bool GuardConditionsMet(object[] args)
             {
-                return Conditions.All(c => c.Guard == null || c.Guard(args));
+                return Conditions.All(c => c.Guard != null || c.Guard(args));
             }
 
killedBy: Stateless.Tests.TriggerBehaviourFixture.WhenGuardConditionFalse_GuardConditionsMetIsFalse; Stateless.Tests.TriggerBehaviourFixture.WhenAllMultipleGuardConditionsFalse_IsGuardConditionsMetIsFalse; Stateless.Tests.IgnoredTriggerBehaviourFixture.WhenGuardConditionFalse_IsGuardConditionMetIsFalse

[Killed] Logical mutation
src/Stateless/TransitionGuard.cs:101:44
             /// </summary>
             public bool GuardConditionsMet(object[] args)
             {
-                return Conditions.All(c => c.Guard == null || c.Guard(args));
+                return Conditions.All(c => c.Guard == null && c.Guard(args));
             }
 
killedBy: Stateless.Tests.TriggerBehaviourFixture.WhenGuardConditionTrue_GuardConditionsMetIsTrue; Stateless.Tests.TriggerBehaviourFixture.WhenOneOfMultipleGuardConditionsFalse_GuardConditionsMetIsFalse; Stateless.Tests.TriggerBehaviourFixture.WhenAllGuardConditionsTrue_GuardConditionsMetIsTrue

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/Stateless/TransitionGuard.cs:111:33
             public ICollection<string> UnmetGuardConditions(object[] args)
             {
                 return Conditions
-                    .Where(c => !c.Guard(args))
+                    .Where(c => c.Guard(args))
                     .Select(c => c.Description)
                     .ToList();
killedBy: Stateless.Tests.DynamicAsyncTriggerBehaviourAsyncFixture.PermitDynamicIf_With_TriggerParameter_Throws_When_GuardCondition_Not_Met_Async; Stateless.Tests.DynamicAsyncTriggerBehaviourAsyncFixture.PermitDynamicIf_With_3_TriggerParameters_Permits_Transition_When_GuardCondition_Met_Async; Stateless.Tests.DynamicAsyncTriggerBehaviourAsyncFixture.PermitDynamicIf_Permits_Reentry_When_GuardCondition_Met_Async
