[Killed] Block removal mutation
src/Stateless/TransitioningTriggerBehaviour.cs:12:13
             // transitionGuard can be null if there is no guard function on the transition
             public TransitioningTriggerBehaviour(TTrigger trigger, TState destination, TransitionGuard transitionGuard)
                 : base(trigger, transitionGuard)
-            {
-                Destination = destination;
-            }
+            {}
         }
     }
killedBy: Stateless.Tests.DotGraphFixture.SpacedUmlWithSubstate; Stateless.Tests.DotGraphFixture.Initial_State_Not_Changed_After_Trigger_Fired; Stateless.Tests.DotGraphFixture.TransitionWithIgnore
